[
    {
        "id": "http://arxiv.org/abs/1910.10142v1",
        "title": "Multiple criteria decision-making for lane-change model",
        "abstract": "  Simulation has long been an essential part of testing autonomous driving\nsystems, but only recently has simulation been useful for building and training\nself-driving vehicles. Vehicle behavioural models are necessary to simulate the\ninteractions between robot cars. This paper proposed a new method to formalize\nthe lane-changing model in urban driving scenarios. We define human incentives\nfrom different perspectives, speed incentive, route change incentive, comfort\nincentive and courtesy incentive etc. We applied a decision-theoretical tool,\ncalled Multi-Criteria Decision Making (MCDM) to take these incentive policies\ninto account. The strategy of combination is according to different driving\nstyle which varies for each driving. Thus a lane-changing decision selection\nalgorithm is proposed. Not only our method allows for varying the motivation of\nlane-changing from the purely egoistic desire to a more courtesy concern, but\nalso they can mimic drivers' state, inattentive or concentrate, which\ninfluences their driving Behaviour. We define some cost functions and calibrate\nthe parameters with different scenarios of traffic data. Distinguishing driving\nstyles are used to aggregate decision-makers' assessments about various\ncriteria weightings to obtain the action drivers desire most. Our result\ndemonstrates the proposed method can produce varied lane-changing behaviour.\nUnlike other lane-changing models based on artificial intelligence methods, our\nmodel has more flexible controllability.\n",
        "published": "2019",
        "authors": [
            "Ao Li",
            "Liting Sun",
            "Wei Zhan",
            "Masayoshi Tomizuka"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2004.08025v2",
        "title": "STT-CBS: A Conflict-Based Search Algorithm for Multi-Agent Path Finding\n  with Stochastic Travel Times",
        "abstract": "  We present an algorithm for finding optimal paths for multiple stochastic\nagents in a graph to reach their destinations with a user-specified maximum\npairwise collision probability. Our algorithm, called STT-CBS, uses\nConflict-Based Search (CBS) with a stochastic travel time (STT) model for the\nagents. We model robot travel time along each edge of the graph by independent\ngamma-distributed random variables, and propose probabilistic collision\nidentification and constraint creation methods to robustly handle travel time\nuncertainty. We show that under reasonable assumptions our algorithm is optimal\nin terms of expected sum of travel times, while ensuring an upper bound on each\npairwise conflict probability. Simulations and hardware experiments show that\nSTT-CBS is able to significantly decrease conflict probability over CBS, while\nremaining within the same complexity class.\n",
        "published": "2020",
        "authors": [
            "Oriana Peltzer",
            "Kyle Brown",
            "Mac Schwager",
            "Mykel J. Kochenderfer",
            "Martin Sehr"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2004.08364v1",
        "title": "Networked and Autonomous Model-scale Vehicles for Experiments in\n  Research and Education",
        "abstract": "  This paper presents the $\\mathrm{\\mu}$Car, a 1:18 model-scale vehicle with\nAckermann steering geometry developed for experiments in networked and\nautonomous driving in research and education. The vehicle is open source,\nmoderately costed and highly flexible, which allows for many applications. It\nis equipped with an inertial measurement unit and an odometer and obtains its\npose via WLAN from an indoor positioning system. The two supported operating\nmodes for controlling the vehicle are (1) computing control inputs on external\nhardware, transmitting them via WLAN and applying received inputs to the\nactuators and (2) transmitting a reference trajectory via WLAN, which is then\nfollowed by a controller running on the onboard Raspberry Pi Zero W. The design\nallows identical vehicles to be used at the same time in order to conduct\nexperiments with a large amount of networked agents.\n",
        "published": "2020",
        "authors": [
            "Patrick Scheffe",
            "Janis Maczijewski",
            "Maximilian Kloock",
            "Alexandru Kampmann",
            "Andreas Derks",
            "Stefan Kowalewski",
            "Bassam Alrifaee"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2004.10063v4",
        "title": "Cyber-Physical Mobility Lab: An Open-Source Platform for Networked and\n  Autonomous Vehicles",
        "abstract": "  This paper introduces our Cyber-Physical Mobility Lab (CPM Lab). It is an\nopen-source development environment for networked and autonomous vehicles with\nfocus on networked decision-making, trajectory planning, and control. The CPM\nLab hosts 20 physical model-scale vehicles ({\\mu}Cars) which we can seamlessly\nextend by unlimited simulated vehicles. The code and construction plans are\npublicly available to enable rebuilding the CPM Lab.\n  Our four-layered architecture enables the seamless use of the same software\nin simulations and in experiments without any further adaptions. A Data\nDistribution Service (DDS) based middleware allows adapting the number of\nvehicles during experiments in a seamless manner. The middleware is also\nresponsible for synchronizing all entities following a logical execution time\napproach to achieve determinism and reproducibility of experiments. This\napproach makes the CPM Lab a unique platform for rapid functional prototyping\nof networked decision-making algorithms.\n  The CPM Lab allows researchers as well as students from different disciplines\nto see their ideas developing into reality. We demonstrate its capabilities\nusing two example experiments. We are working on a remote access to the CPM Lab\nvia a webinterface.\n",
        "published": "2020",
        "authors": [
            "Maximilian Kloock",
            "Patrick Scheffe",
            "Janis Maczijewski",
            "Alexandru Kampmann",
            "Armin Mokhtarian",
            "Stefan Kowalewski",
            "Bassam Alrifaee"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2004.11543v4",
        "title": "Continuous Deep Hierarchical Reinforcement Learning for Ground-Air Swarm\n  Shepherding",
        "abstract": "  The control and guidance of multi-robots (swarm) is a non-trivial problem due\nto the complexity inherent in the coupled interaction among the group. Whether\nthe swarm is cooperative or non-cooperative, lessons can be learnt from\nsheepdogs herding sheep. Biomimicry of shepherding offers computational methods\nfor swarm control with the potential to generalize and scale in different\nenvironments. However, learning to shepherd is complex due to the large search\nspace that a machine learner is faced with. We present a deep hierarchical\nreinforcement learning approach for shepherding, whereby an unmanned aerial\nvehicle (UAV) learns to act as an aerial sheepdog to control and guide a swarm\nof unmanned ground vehicles (UGVs). The approach extends our previous work on\nmachine education to decompose the search space into a hierarchically organized\ncurriculum. Each lesson in the curriculum is learnt by a deep reinforcement\nlearning model. The hierarchy is formed by fusing the outputs of the model. The\napproach is demonstrated first in a high-fidelity robotic-operating-system\n(ROS)-based simulation environment, then with physical UGVs and a UAV in an\nin-door testing facility. We investigate the ability of the method to\ngeneralize as the models move from simulation to the real-world and as the\nmodels move from one scale to another.\n",
        "published": "2020",
        "authors": [
            "Hung The Nguyen",
            "Tung Duy Nguyen",
            "Vu Phi Tran",
            "Matthew Garratt",
            "Kathryn Kasmarik",
            "Sreenatha Anavatti",
            "Michael Barlow",
            "Hussein A. Abbass"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1404.4391v1",
        "title": "Control of Robotic Mobility-On-Demand Systems: a Queueing-Theoretical\n  Perspective",
        "abstract": "  In this paper we present and analyze a queueing-theoretical model for\nautonomous mobility-on-demand (MOD) systems where robotic, self-driving\nvehicles transport customers within an urban environment and rebalance\nthemselves to ensure acceptable quality of service throughout the entire\nnetwork. We cast an autonomous MOD system within a closed Jackson network model\nwith passenger loss. It is shown that an optimal rebalancing algorithm\nminimizing the number of (autonomously) rebalancing vehicles and keeping\nvehicles availabilities balanced throughout the network can be found by solving\na linear program. The theoretical insights are used to design a robust,\nreal-time rebalancing algorithm, which is applied to a case study of New York\nCity. The case study shows that the current taxi demand in Manhattan can be met\nwith about 8,000 robotic vehicles (roughly 60% of the size of the current taxi\nfleet). Finally, we extend our queueing-theoretical setup to include congestion\neffects, and we study the impact of autonomously rebalancing vehicles on\noverall congestion. Collectively, this paper provides a rigorous approach to\nthe problem of system-wide coordination of autonomously driving vehicles, and\nprovides one of the first characterizations of the sustainability benefits of\nrobotic transportation networks.\n",
        "published": "2014",
        "authors": [
            "Rick Zhang",
            "Marco Pavone"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1709.04622v4",
        "title": "An Agent-based Modelling Framework for Driving Policy Learning in\n  Connected and Autonomous Vehicles",
        "abstract": "  Due to the complexity of the natural world, a programmer cannot foresee all\npossible situations, a connected and autonomous vehicle (CAV) will face during\nits operation, and hence, CAVs will need to learn to make decisions\nautonomously. Due to the sensing of its surroundings and information exchanged\nwith other vehicles and road infrastructure, a CAV will have access to large\namounts of useful data. While different control algorithms have been proposed\nfor CAVs, the benefits brought about by connectedness of autonomous vehicles to\nother vehicles and to the infrastructure, and its implications on policy\nlearning has not been investigated in literature. This paper investigates a\ndata driven driving policy learning framework through an agent-based modelling\napproaches. The contributions of the paper are two-fold. A dynamic programming\nframework is proposed for in-vehicle policy learning with and without\nconnectivity to neighboring vehicles. The simulation results indicate that\nwhile a CAV can learn to make autonomous decisions, vehicle-to-vehicle (V2V)\ncommunication of information improves this capability. Furthermore, to overcome\nthe limitations of sensing in a CAV, the paper proposes a novel concept for\ninfrastructure-led policy learning and communication with autonomous vehicles.\nIn infrastructure-led policy learning, road-side infrastructure senses and\ncaptures successful vehicle maneuvers and learns an optimal policy from those\ntemporal sequences, and when a vehicle approaches the road-side unit, the\npolicy is communicated to the CAV. Deep-imitation learning methodology is\nproposed to develop such an infrastructure-led policy learning framework.\n",
        "published": "2017",
        "authors": [
            "Varuna De Silva",
            "Xiongzhao Wang",
            "Deniz Aladagli",
            "Ahmet Kondoz",
            "Erhan Ekmekcioglu"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1709.05273v1",
        "title": "Cooperative Motion Planning for Non-Holonomic Agents with Value\n  Iteration Networks",
        "abstract": "  Cooperative motion planning is still a challenging task for robots. Recently,\nValue Iteration Networks (VINs) were proposed to model motion planning tasks as\nNeural Networks. In this work, we extend VINs to solve cooperative planning\ntasks under non-holonomic constraints. For this, we interconnect multiple VINs\nto pay respect to each other's outputs. Policies for cooperation are generated\nvia iterative gradient descend. Validation in simulation shows that the\nresulting networks can resolve non-holonomic motion planning problems that\nrequire cooperation.\n",
        "published": "2017",
        "authors": [
            "Eike Rehder",
            "Maximilian Naumann",
            "Niels Ole Salscheider",
            "Christoph Stiller"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1709.08215v2",
        "title": "SEAR: A Polynomial-Time Multi-Robot Path Planning Algorithm with\n  Expected Constant-Factor Optimality Guarantee",
        "abstract": "  We study the labeled multi-robot path planning problem in continuous 2D and\n3D domains in the absence of obstacles where robots must not collide with each\nother. For an arbitrary number of robots in arbitrary initial and goal\narrangements, we derive a polynomial time, complete algorithm that produces\nsolutions with constant-factor optimality guarantees on both makespan and\ndistance optimality, in expectation, under the assumption that the robot labels\nare uniformly randomly distributed. Our algorithm only requires a small\nconstant factor expansion of the initial and goal configuration footprints for\nsolving the problem, i.e., the problem can be solved in a fairly small bounded\nregion. Beside theoretical guarantees, we present a thorough computational\nevaluation of the proposed solution. In addition to the baseline\nimplementation, adapting an effective (but non-polynomial time) routing\nsubroutine, we also provide a highly efficient implementation that quickly\ncomputes near-optimal solutions. Hardware experiments on the microMVP platform\ncomposed of non-holonomic robots confirms the practical applicability of our\nalgorithmic pipeline.\n",
        "published": "2017",
        "authors": [
            "Shuai D. Han",
            "Edgar J. Rodriguez",
            "Jingjin Yu"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1907.02125v1",
        "title": "Sensing Volume Coverage of Robot Workspace using On-Robot Time-of-Flight\n  Sensor Arrays for Safe Human Robot Interaction",
        "abstract": "  In this paper, an analysis of the sensing volume coverage of robot workspace\nas well as the shared human-robot collaborative workspace for various\nconfigurations of on-robot Time-of-Flight (ToF) sensor array rings is\npresented. A methodology for volumetry using octrees to quantify the\ndetection/sensing volume of the sensors is proposed. The change in sensing\nvolume coverage by increasing the number of sensors per ToF sensor array ring\nand also increasing the number of rings mounted on robot link is also studied.\nConsiderations of maximum ideal volume around the robot workspace that a given\nToF sensor array ring placement and orientation setup should cover for safe\nhuman robot interaction are presented. The sensing volume coverage measurements\nin this maximum ideal volume are tabulated and observations on various ToF\nconfigurations and their coverage for close and far zones of the robot are\ndetermined.\n",
        "published": "2019",
        "authors": [
            "Shitij Kumar",
            "Ferat Sahin"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1907.05945v1",
        "title": "NH-TTC: A gradient-based framework for generalized anticipatory\n  collision avoidance",
        "abstract": "  We propose NH-TTC, a general method for fast, anticipatory collision\navoidance for autonomous robots having arbitrary equations of motions. Our\nproposed approach exploits implicit differentiation and subgradient descent to\nlocally optimize the non-convex and non-smooth cost functions that arise from\nplanning over the anticipated future positions of nearby obstacles. The result\nis a flexible framework capable of supporting high-quality, collision-free\nnavigation with a wide variety of robot motion models in various challenging\nscenarios. We show results for different navigating tasks, with our method\ncontrolling various numbers of agents (with and without reciprocity), on both\nphysical differential drive robots, and simulated robots with different motion\nmodels and kinematic and dynamic constraints, including acceleration-controlled\nagents, differential-drive agents, and smooth car-like agents. The resulting\npaths are high quality and collision-free, while needing only a few\nmilliseconds of computation as part of an integrated sense-plan-act navigation\nloop.\n",
        "published": "2019",
        "authors": [
            "Bobby Davis",
            "Ioannis Karamouzas",
            "Stephen J. Guy"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1907.07718v2",
        "title": "A Sequential Composition Framework for Coordinating Multi-Robot\n  Behaviors",
        "abstract": "  A number of coordinated behaviors have been proposed for achieving specific\ntasks for multi-robot systems. However, since most applications require more\nthan one such behavior, one needs to be able to compose together sequences of\nbehaviors while respecting local information flow constraints. Specifically,\nwhen the inter-agent communication depends on inter-robot distances, these\nconstraints translate into particular configurations that must be reached in\nfinite time in order for the system to be able to transition between the\nbehaviors. To this end, we develop a distributed framework based on finite-time\nconvergence control barrier functions that enables a team of robots to adjust\nits configuration in order to meet the communication requirements for the\ndifferent tasks. In order to demonstrate the significance of the proposed\nframework, we implemented a full-scale scenario where a team of eight planar\nrobots explore an urban environment in order to localize and rescue a subject.\n",
        "published": "2019",
        "authors": [
            "Pietro Pierpaoli",
            "Anqi Li",
            "Mohit Srinivasan",
            "Xiaoyi Cai",
            "Samuel Coogan",
            "Magnus Egerstedt"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1907.10782v2",
        "title": "A Framework for Monitoring Human Physiological Response during Human\n  Robot Collaborative Task",
        "abstract": "  In this paper, a framework for monitoring human physiological response during\nHuman-Robot Collaborative (HRC) task is presented. The framework highlights the\nimportance of generation of event markers related to both human and robot, and\nalso synchronization of data collected. This framework enables continuous data\ncollection during an HRC task when changing robot movements as a form of\nstimuli to invoke a human physiological response. It also presents two case\nstudies based on this framework and a data visualization tool for\nrepresentation and easy analysis of the collected data during an HRC\nexperiment.\n",
        "published": "2019",
        "authors": [
            "Celal Savur",
            "Shitij Kumar",
            "Ferat Sahin"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1907.11852v1",
        "title": "G-flocking: Flocking Model Optimization based on Genetic Framework",
        "abstract": "  Flocking model has been widely used to control robotic swarm. However, with\nthe increasing scalability, there exist complex conflicts for robotic swarm in\nautonomous navigation, brought by internal pattern maintenance, external\nenvironment changes, and target area orientation, which results in poor\nstability and adaptability. Hence, optimizing the flocking model for robotic\nswarm in autonomous navigation is an important and meaningful research domain.\n",
        "published": "2019",
        "authors": [
            "Li Ma",
            "Weidong Bao",
            "Xiaomin Zhu",
            "Meng Wu",
            "Yuan Wang",
            "Yunxiang Ling",
            "Wen Zhou"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1908.04425v3",
        "title": "A sub-modular receding horizon solution for mobile multi-agent\n  persistent monitoring",
        "abstract": "  We study the problem of persistent monitoring of a finite number of\ninter-connected geographical nodes by a group of heterogeneous mobile agents.\nWe assign to each geographical node a concave and increasing reward function\nthat resets to zero after an agent's visit. Then, we design the optimal\ndispatch policy of which nodes to visit at what time and by what agent by\nfinding a policy set that maximizes a utility that is defined as the total\nreward collected at visit times. We show that this optimization problem is\nNP-hard and its computational complexity increases exponentially with the\nnumber of the agents and the length of the mission horizon. By showing that the\nutility function is a monotone increasing and submodular set function of\nagents' policy, we proceed to propose a suboptimal dispatch policy design with\na known optimality gap. To reduce the time complexity of constructing the\nfeasible search set and also to induce robustness to changes in the operational\nfactors, we perform our suboptimal policy design in a receding horizon fashion.\nThen, to compensate for the shortsightedness of the receding horizon approach\nfor reward distribution beyond the feasible policies of the agents over the\nreceding horizon, we add a new term to our utility, which provides a measure of\nnodal importance beyond the receding horizon's sight. This term gives the\npolicy design an intuition to steer the agents towards the nodes with higher\nrewards on the patrolling graph. Finally, we discuss how our proposed algorithm\ncan be implemented in a decentralized manner. A simulation study demonstrates\nour results.\n",
        "published": "2019",
        "authors": [
            "Navid Rezazadeh",
            "Solmaz S. Kia"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1908.05822v1",
        "title": "Decentralized Multi-Floor Exploration by a Swarm of Miniature Robots\n  Teaming with Wall-Climbing Units",
        "abstract": "  In this paper, we consider the problem of collectively exploring unknown and\ndynamic environments with a decentralized heterogeneous multi-robot system\nconsisting of multiple units of two variants of a miniature robot. The first\nvariant-a wheeled ground unit-is at the core of a swarm of floor-mapping robots\nexhibiting scalability, robustness and flexibility. These properties are\nsystematically tested and quantitatively evaluated in unstructured and dynamic\nenvironments, in the absence of any supporting infrastructure. The results of\nrepeated sets of experiments show a consistent performance for all three\nfeatures, as well as the possibility to inject units into the system while it\nis operating. Several units of the second variant-a wheg-based wall-climbing\nunit-are used to support the swarm of mapping robots when simultaneously\nexploring multiple floors by expanding the distributed communication channel\nnecessary for the coordinated behavior among platforms. Although the\noccupancy-grid maps obtained can be large, they are fully distributed. Not a\nsingle robotic unit possesses the overall map, which is not required by our\ncooperative path-planning strategy.\n",
        "published": "2019",
        "authors": [
            "Jabez L. Kit",
            "Audelia G. Dharmawan",
            "David Mateo",
            "Shaohui Foong",
            "Gim Song Soh",
            "Roland Bouffanais",
            "Kristin L. Wood"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1604.04180v2",
        "title": "Job Selection in a Network of Autonomous UAVs for Delivery of Goods",
        "abstract": "  This article analyzes two classes of job selection policies that control how\na network of autonomous aerial vehicles delivers goods from depots to\ncustomers. Customer requests (jobs) occur according to a spatio-temporal\nstochastic process not known by the system. If job selection uses a policy in\nwhich the first job (FJ) is served first, the system may collapse to\ninstability by removing just one vehicle. Policies that serve the nearest job\n(NJ) first show such threshold behavior only in some settings and can be\nimplemented in a distributed manner. The timing of job selection has\nsignificant impact on delivery time and stability for NJ while it has no impact\nfor FJ. Based on these findings we introduce a methodological approach for\ndecision-making support to set up and operate such a system, taking into\naccount the trade-off between monetary cost and service quality. In particular,\nwe compute a lower bound for the infrastructure expenditure required to achieve\na certain expected delivery time. The approach includes three time horizons:\nlong-term decisions on the number of depots to deploy in the service area,\nmid-term decisions on the number of vehicles to use, and short-term decisions\non the policy to operate the vehicles.\n",
        "published": "2016",
        "authors": [
            "Pasquale Grippa",
            "Doris A. Behrens",
            "Christian Bettstetter",
            "Friederike Wall"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1809.04230v2",
        "title": "Trajectory Generation for Multiagent Point-To-Point Transitions via\n  Distributed Model Predictive Control",
        "abstract": "  This paper introduces a novel algorithm for multiagent offline trajectory\ngeneration based on distributed model predictive control. Central to the\nalgorithm's scalability and success is the development of an on-demand\ncollision avoidance strategy. By predicting future states and sharing this\ninformation with their neighbors, the agents are able to detect and avoid\ncollisions while moving toward their goals. The proposed algorithm can be\nimplemented in a distributed fashion and reduces the computation time by more\nthan 85% compared to previous optimization approaches based on sequential\nconvex programming, while only having a small impact on the optimality of the\nplans. The approach was validated both through extensive simulations and\nexperimentally with teams of up to 25 quadrotors flying in confined indoor\nspaces.\n",
        "published": "2018",
        "authors": [
            "Carlos E. Luis",
            "Angela P. Schoellig"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1812.00868v1",
        "title": "Collision-Free Multi Robot Trajectory Optimization in Unknown\n  Environments using Decentralized Trajectory Planning",
        "abstract": "  Multi robot systems have the potential to be utilized in a variety of\napplications. In most of the previous works, the trajectory generation for\nmulti robot systems is implemented in known environments. To overcome that we\npresent an online trajectory optimization algorithm that utilizes communication\nof robots' current states to account to the other robots while using local\nobject based maps for identifying obstacles. Based upon this data, we predict\nthe trajectory expected to be traversed by the robots and utilize that to avoid\ncollisions by formulating regions of free space that the robot can be without\ncolliding with other robots and obstacles. A trajectory is optimized\nconstraining the robot to remain within this region.The proposed method is\ntested in simulations on Gazebo using ROS.\n",
        "published": "2018",
        "authors": [
            "Vijay Arvindh",
            "Govind Aadithya R",
            "Shravan Krishnan",
            "Sivanathan K"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1812.02193v2",
        "title": "Voluntary Retreat for Decentralized Interference Reduction in Robot\n  Swarms",
        "abstract": "  In densely-packed robot swarms operating in confined regions, spatial\ninterference -- which manifests itself as a competition for physical space --\nforces robots to spend more time navigating around each other rather than\nperforming the primary task. This paper develops a decentralized algorithm that\nenables individual robots to decide whether to stay in the region and\ncontribute to the overall mission, or vacate the region so as to reduce the\nnegative effects that interference has on the overall efficiency of the swarm.\nWe develop this algorithm in the context of a distributed collection task,\nwhere a team of robots collect and deposit objects from one set of locations to\nanother in a given region. Robots do not communicate and use only binary\ninformation regarding the presence of other robots around them to make the\ndecision to stay or retreat. We illustrate the efficacy of the algorithm with\nexperiments on a team of real robots.\n",
        "published": "2018",
        "authors": [
            "Siddharth Mayya",
            "Pietro Pierpaoli",
            "Magnus Egerstedt"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1812.11135v1",
        "title": "Online Decentralized Receding Horizon Trajectory Optimization for\n  Multi-Robot systems",
        "abstract": "  A novel decentralised trajectory generation algorithm for Multi Agent systems\nis presented. Multi-robot systems have the capacity to transform lives in a\nvariety of fields. But, trajectory generation for multi-robot systems is still\nin its nascent stage and limited to heavily controlled environments. To\novercome that, an online trajectory optimization algorithm that generates\ncollision-free trajectories for robots, when given initial state and desired\nend pose, is proposed. It utilizes a simple method for obstacle detection,\nlocal shape based maps for obstacles and communication of robots' current\nstates. Using the local maps, safe regions are formulated. Based upon the\ncommunicated data, trajectories are predicted for other robots and incorporated\nfor collision-avoidance by resizing the regions of free space that the robot\ncan be in without colliding. A trajectory is then optimized constraining the\nrobot to remain within the safe region with the trajectories represented by\npiecewise polynomials parameterized by time. The algorithm is implemented using\na receding horizon principle. The proposed algorithm is extensively tested in\nsimulations on Gazebo using ROS with fourth order differentially flat aerial\nrobots and non-holonomic second order wheeled robots in structured and\nunstructured environments.\n",
        "published": "2018",
        "authors": [
            "Govind Aadithya R",
            "Shravan Krishnan",
            "Vijay Arvindh",
            "Sivanathan K"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1903.05149v3",
        "title": "STRATA: A Unified Framework for Task Assignments in Large Teams of\n  Heterogeneous Agents",
        "abstract": "  Large teams of heterogeneous agents have the potential to solve complex\nmulti-task problems that are intractable for a single agent working\nindependently. However, solving complex multi-task problems requires leveraging\nthe relative strengths of the different kinds of agents in the team. We present\nStochastic TRAit-based Task Assignment (STRATA), a unified framework that\nmodels large teams of heterogeneous agents and performs effective task\nassignments. Specifically, given information on which traits (capabilities) are\nrequired for various tasks, STRATA computes the assignments of agents to tasks\nsuch that the trait requirements are achieved. Inspired by prior work in robot\nswarms and biodiversity, we categorize agents into different species (groups)\nbased on their traits. We model each trait as a continuous variable and\ndifferentiate between traits that can and cannot be aggregated from different\nagents. STRATA is capable of reasoning about both species-level and agent-level\nvariability in traits. Further, we define measures of diversity for any given\nteam based on the team's continuous-space trait model. We illustrate the\nnecessity and effectiveness of STRATA using detailed experiments based in\nsimulation and in a capture-the-flag game environment.\n",
        "published": "2019",
        "authors": [
            "Harish Ravichandar",
            "Kenneth Shaw",
            "Sonia Chernova"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1903.11041v1",
        "title": "Blockchain Solutions for Multi-Agent Robotic Systems: Related Work and\n  Open Questions",
        "abstract": "  The possibilities of decentralization and immutability make blockchain\nprobably one of the most breakthrough and promising technological innovations\nin recent years. This paper presents an overview, analysis, and classification\nof possible blockchain solutions for practical tasks facing multi-agent robotic\nsystems. The paper discusses blockchain-based applications that demonstrate how\ndistributed ledger can be used to extend the existing number of research\nplatforms and libraries for multi-agent robotic systems.\n",
        "published": "2019",
        "authors": [
            "Ilya Afanasyev",
            "Alexander Kolotov",
            "Ruslan Rezin",
            "Konstantin Danilov",
            "Alexey Kashevnik",
            "Vladimir Jotsov"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1903.12118v2",
        "title": "From Motions to Emotions: Can the Fundamental Emotions be Expressed in a\n  Robot Swarm?",
        "abstract": "  This paper explores the expressive capabilities of a swarm of miniature\nmobile robots within the context of inter-robot interactions and their mapping\nto the so-called fundamental emotions. In particular, we investigate how motion\nand shape descriptors that are psychologically associated with different\nemotions can be incorporated into different swarm behaviors for the purpose of\nartistic expositions. Based on these characterizations from social psychology,\na set of swarm behaviors is created, where each behavior corresponds to a\nfundamental emotion. The effectiveness of these behaviors is evaluated in a\nsurvey in which the participants are asked to associate different swarm\nbehaviors with the fundamental emotions. The results of the survey show that\nmost of the research participants assigned to each video the emotion intended\nto be portrayed by design. These results confirm that abstract descriptors\nassociated with the different fundamental emotions in social psychology provide\nuseful motion characterizations that can be effectively transformed into\nexpressive behaviors for a swarm of simple ground mobile robots.\n",
        "published": "2019",
        "authors": [
            "María Santos",
            "Magnus Egerstedt"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1912.06285v1",
        "title": "Mission Oriented Miniature Fixed-wing UAV Swarms: A Multi-layered and\n  Distributed Architecture",
        "abstract": "  UAV swarms have triggered wide concern due to their potential application\nvalues in recent years. While there are studies proposed in terms of the\narchitecture design for UAV swarms, two main challenges still exist: (1)\nScalability, supporting a large scale of vehicles; (2) Versatility, integrating\ndiversified missions. To this end, a multi-layered and distributed architecture\nfor mission oriented miniature fixed-wing UAV swarms is presented in this\npaper. The proposed architecture is built on the concept of modularity. It\ndivides the overall system to five layers: low-level control, high-level\ncontrol, coordination, communication and human interaction layers, and many\nmodules that can be viewed as black boxes with interfaces of inputs and\noutputs. In this way, not only the complexity of developing a large system can\nbe reduced, but also the versatility of supporting diversified missions can be\nensured. Furthermore, the proposed architecture is fully distributed that each\nUAV performs the decision-making procedure autonomously so as to achieve better\nscalability. Moreover, different kinds of aerial platforms can be feasibly\nextended by using the control allocation matrices and the integrated hardware\nbox. A prototype swarm system based on the proposed architecture is built and\nthe proposed architecture is evaluated through field experiments with a scale\nof 21 fixed-wing UAVs. Particularly, to the best of our knowledge, this paper\nis the first work which successfully demonstrates formation flight, target\nrecognition and tracking missions within an integrated architecture for\nfixed-wing UAV swarms through field experiments.\n",
        "published": "2019",
        "authors": [
            "Zhihong Liu",
            "Xiangke Wang",
            "Lincheng Shen",
            "Shulong Zhao",
            "Yirui Cong",
            "Jie Li",
            "Dong Yin",
            "Shengde Jia",
            "Xiaojia Xiang"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2001.02906v1",
        "title": "Multirobot Coverage of Linear Modular Environments",
        "abstract": "  Multirobot systems for covering environments are increasingly used in\napplications like cleaning, industrial inspection, patrolling, and precision\nagriculture. The problem of covering a given environment using multiple robots\ncan be naturally formulated and studied as a multi-Traveling Salesperson\nProblem (mTSP). In a mTSP, the environment is represented as a graph and the\ngoal is to find tours (starting and ending at the same depot) for the robots in\norder to visit all the vertices with minimum global cost, namely the length of\nthe longest tour. The mTSP is an NP-hard problem for which several\napproximation algorithms have been proposed. These algorithms usually assume\ngeneric environments, but tighter approximation bounds can be reached focusing\non specific environments. In this paper, we address the case of environments\ncomposed of sub-parts, called modules, that can be reached from each other only\nthrough some linking structures. Examples are multi-floor buildings, in which\nthe modules are the floors and the linking structures are the staircases or the\nelevators, and floors of large hotels or hospitals, in which the modules are\nthe rooms and the linking structures are the corridors. We focus on linear\nmodular environments, with the modules organized sequentially, presenting an\nefficient (with polynomial worst-case time complexity) algorithm that finds a\nsolution for the mTSP whose cost is within a bounded distance from the cost of\nthe optimal solution. The main idea of our algorithm is to allocate disjoint\n\"blocks\" of adjacent modules to the robots, in such a way that each module is\ncovered by only one robot. We experimentally compare our algorithm against some\nstate-of-the-art algorithms for solving mTSPs in generic environments and show\nthat it is able to provide solutions with lower makespan and spending a\ncomputing time several orders of magnitude shorter.\n",
        "published": "2020",
        "authors": [
            "Mirko Salaris",
            "Alessandro Riva",
            "Francesco Amigoni"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2001.09297v1",
        "title": "Vehicle Scheduling Problem",
        "abstract": "  We define a new problem called the Vehicle Scheduling Problem (VSP). The goal\nis to minimize an objective function, such as the number of tardy vehicles over\na transportation network subject to maintaining safety distances, meeting hard\ndeadlines, and maintaining speeds on each link between the allowed minimums and\nmaximums. We prove VSP is an NP-hard problem for multiple objective functions\nthat are commonly used in the context of job shop scheduling. With the number\nof tardy vehicles as the objective function, we formulate VSP in terms of a\nMixed Integer Linear Programming (MIP) and design a heuristic algorithm. We\nanalyze the complexity of our algorithm and compare the quality of the\nsolutions to the optimal solution for the MIP formulation in the small cases.\nOur main motivation for defining VSP is the upcoming integration of Unmanned\nAerial Vehicles (UAVs) into the airspace for which this novel scheduling\nframework is of paramount importance.\n",
        "published": "2020",
        "authors": [
            "Mirmojtaba Gharibi",
            "Steven L. Waslander",
            "Raouf Boutaba"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2003.01851v2",
        "title": "A Distributed Pipeline for Scalable, Deconflicted Formation Flying",
        "abstract": "  Reliance on external localization infrastructure and centralized coordination\nare main limiting factors for formation flying of vehicles in large numbers and\nin unprepared environments. While solutions using onboard localization address\nthe dependency on external infrastructure, the associated coordination\nstrategies typically lack collision avoidance and scalability. To address these\nshortcomings, we present a unified pipeline with onboard localization and a\ndistributed, collision-free motion planning strategy that scales to a large\nnumber of vehicles. Since distributed collision avoidance strategies are known\nto result in gridlock, we also present a decentralized task assignment solution\nto deconflict vehicles. We experimentally validate our pipeline in simulation\nand hardware. The results show that our approach for solving the optimization\nproblem associated with motion planning gives solutions within seconds in cases\nwhere general purpose solvers fail due to high complexity. In addition, our\nlightweight assignment strategy leads to successful and quicker formation\nconvergence in 96-100% of all trials, whereas indefinite gridlocks occur\nwithout it for 33-50% of trials. By enabling large-scale, deconflicted\ncoordination, this pipeline should help pave the way for anytime, anywhere\ndeployment of aerial swarms.\n",
        "published": "2020",
        "authors": [
            "Parker C. Lusk",
            "Xiaoyi Cai",
            "Samir Wadhwania",
            "Aleix Paris",
            "Kaveh Fathian",
            "Jonathan P. How"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2003.05550v1",
        "title": "The Application of Market-based Multi-Robot Task Allocation to Ambulance\n  Dispatch",
        "abstract": "  Multi-Robot Task Allocation (MRTA) is the problem of distributing a set of\ntasks to a team of robots with the objective of optimising some criteria, such\nas minimising the amount of time or energy spent to complete all the tasks or\nmaximising the efficiency of the team's joint activity. The exploration of MRTA\nmethods is typically restricted to laboratory and field experimentation. There\nare few existing real-world models in which teams of autonomous mobile robots\nare deployed \"in the wild\", e.g., in industrial settings. In the work presented\nhere, a market-based MRTA approach is applied to the problem of ambulance\ndispatch, where ambulances are allocated in respond to patients' calls for\nhelp. Ambulances and robots are limited (and perhaps scarce), specialised\nmobile resources; incidents and tasks represent time-sensitive, specific,\npotentially unlimited, precisely-located demands for the services which the\nresources provide. Historical data from the London Ambulance Service describing\na set of more than 1 million (anonymised) incidents are used as the basis for\nevaluating the predicted performance of the market-based approach versus the\ncurrent, largely manual, method of allocating ambulances to incidents.\nExperimental results show statistically significant improvement in response\ntimes when using the market-based approach.\n",
        "published": "2020",
        "authors": [
            "Eric Schneider",
            "Marcus Poulton",
            "Archie Drake",
            "Leanne Smith",
            "George Roussos",
            "Simon Parsons",
            "Elizabeth I Sklar"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2003.05853v2",
        "title": "An autonomous swarm of micro flying robots with range-based relative\n  localization",
        "abstract": "  Accurate relative localization is an important requirement for a swarm of\nrobots, especially when performing a cooperative task. This paper presents an\nautonomous multi-robot relative positioning technique. An Extended Kalman\nfilter (EKF) uses onboard sensing of velocity, yaw rate, and height as inputs,\nand then estimates the relative position of other robots by fusing these\nquantities with ranging measurements obtained from onboard ultra wide-band\n(UWB). Specifically, innovations involve fast-ranging communication (333Hz for\n2 robots), an automatic initialization procedure, proofs and demonstrations of\nconsistent estimation convergence under control commands such as formation\nflight. Simulations concisely show the high precision, efficiency, and\nstability of the proposed localization method. Real-world experiments are\nconducted on a team of 5 Crazyflie2 quadrotors, demonstrating autonomous\nformation flight and coordinated flight through a window. All results indicate\nthe effectiveness of the proposed relative positioning method for multi-robot\nsystems. Video and code can be found at\n\\textnormal{\\url{https://shushuai3.github.io/autonomous-swarm/}}\n",
        "published": "2020",
        "authors": [
            "Shushuai Li",
            "Mario Coppola",
            "Christophe De Wagter",
            "Guido C. H. E. de Croon"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2003.09485v1",
        "title": "A generic ontology and recovery protocols for Human-Robot Collaboration\n  (HRC) systems",
        "abstract": "  Humans are considered as integral components of Human-Robot Collaboration\n(HRC) systems, not only as object (e.g. in health care), but also as operators\nand service providers in manufacturing. Sophisticated and complex tasks are to\nbe collaboratively executed by devices (robots) and humans. We introduce a\ngeneric ontology for HRC systems. Description of humans is a part of the\nontology. Critical and hazardous (for humans) situations, as well as\ncorresponding safeguards are defined on the basis of the ontology. The ontology\nis an extension of the ontology introduced in Skarzynski et al. (2018)\narXiv:1709.03300. The architecture of SO-MRS (see arXiv:1709.03300), a software\nplatform for automatic task accomplishment, is extended to HRC systems. Ongoing\nexperiments, carried out in a simulated HRC system, are to verify the ontology\nand the architecture.\n",
        "published": "2020",
        "authors": [
            "Kamil Skarzynski",
            "Marcin Stepniak",
            "Waldemar Bartyna",
            "Stanislaw Ambroszkiewicz"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2003.13813v3",
        "title": "The Pluggable Distributed Resource Allocator (PDRA): a Middleware for\n  Distributed Computing in Mobile Robotic Networks",
        "abstract": "  We present the Pluggable Distributed Resource Allocator (PDRA), a middleware\nfor distributed computing in heterogeneous mobile robotic networks. PDRA\nenables autonomous robotic agents to share computational resources for\ncomputationally expensive tasks such as localization and path planning. It sits\nbetween an existing single-agent planner/executor and existing computational\nresources (e.g. ROS packages), intercepts the executor's requests and, if\nneeded, transparently routes them to other robots for execution. PDRA is\npluggable: it can be integrated in an existing single-robot autonomy stack with\nminimal modifications. Task allocation decisions are performed by a\nmixed-integer programming algorithm, solved in a shared-world fashion, that\nmodels CPU resources, latency requirements, and multi-hop, periodic,\nbandwidth-limited network communications; the algorithm can minimize overall\nenergy usage or maximize the reward for completing optional tasks. Simulation\nresults show that PDRA can reduce energy and CPU usage by over 50% in\nrepresentative multi-robot scenarios compared to a naive scheduler; runs on\nembedded platforms; and performs well in delay- and disruption-tolerant\nnetworks (DTNs). PDRA is available to the community under an open-source\nlicense.\n",
        "published": "2020",
        "authors": [
            "Federico Rossi",
            "Tiago Stegun Vaquero",
            "Marc Sanchez Net",
            "Maíra Saboia da Silva",
            "Joshua Vander Hook"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2006.12470v2",
        "title": "Asymptotic Boundary Shrink Control with Multi-robot Systems",
        "abstract": "  Harmful marine spills, such as algae blooms and oil spills, damage ecosystems\nand threaten public health tremendously. Hence, an effective spill coverage and\nremoval strategy will play a significant role in environmental protection. In\nrecent years, low-cost water surface robots have emerged as a solution, with\ntheir efficacy verified at small scale. However, practical limitations such as\nconnectivity, scalability, and sensing and operation ranges significantly\nimpair their large-scale use. To circumvent these limitations, we propose a\nnovel asymptotic boundary shrink control strategy that enables collective\ncoverage of a spill by autonomous robots featuring customized operation ranges.\nFor each robot, a novel controller is implemented that relies only on local\nvision sensors with limited vision range. Moreover, the distributedness of this\nstrategy allows any number of robots to be employed without inter-robot\ncollisions. Finally, features of this approach including the convergence of\nrobot motion during boundary shrink control, spill clearance rate, and the\ncapability to work under limited ranges of vision and wireless connectivity are\nvalidated through extensive experiments with simulation.\n",
        "published": "2020",
        "authors": [
            "Shaocheng Luo",
            "Jonghoek Kim",
            "Byung-Cheol Min"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2007.00100v1",
        "title": "Robust Multi-Agent Task Assignment in Failure-Prone and Adversarial\n  Environments",
        "abstract": "  The problem of assigning agents to tasks is a central computational challenge\nin many multi-agent autonomous systems. However, in the real world, agents are\nnot always perfect and may fail due to a number of reasons. A motivating\napplication is where the agents are robots that operate in the physical world\nand are susceptible to failures. This paper studies the problem of Robust\nMulti-Agent Task Assignment, which seeks to find an assignment that maximizes\noverall system performance while accounting for potential failures of the\nagents. We investigate both, stochastic and adversarial failures under this\nframework. For both cases, we present efficient algorithms that yield optimal\nor near-optimal results.\n",
        "published": "2020",
        "authors": [
            "Russell Schwartz",
            "Pratap Tokekar"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2007.13897v1",
        "title": "Adaptive Workload Allocation for Multi-human Multi-robot Teams for\n  Independent and Homogeneous Tasks",
        "abstract": "  Multi-human multi-robot (MH-MR) systems have the ability to combine the\npotential advantages of robotic systems with those of having humans in the\nloop. Robotic systems contribute precision performance and long operation on\nrepetitive tasks without tiring, while humans in the loop improve situational\nawareness and enhance decision-making abilities. A system's ability to adapt\nallocated workload to changing conditions and the performance of each\nindividual (human and robot) during the mission is vital to maintaining overall\nsystem performance. Previous works from literature including market-based and\noptimization approaches have attempted to address the task/workload allocation\nproblem with focus on maximizing the system output without regarding individual\nagent conditions, lacking in real-time processing and have mostly focused\nexclusively on multi-robot systems. Given the variety of possible combination\nof teams (autonomous robots and human-operated robots: any number of human\noperators operating any number of robots at a time) and the operational scale\nof MH-MR systems, development of a generalized framework of workload allocation\nhas been a particularly challenging task. In this paper, we present such a\nframework for independent homogeneous missions, capable of adaptively\nallocating the system workload in relation to health conditions and work\nperformances of human-operated and autonomous robots in real-time. The\nframework consists of removable modular function blocks ensuring its\napplicability to different MH-MR scenarios. A new workload transition function\nblock ensures smooth transition without the workload change having adverse\neffects on individual agents. The effectiveness and scalability of the system's\nworkload adaptability is validated by experiments applying the proposed\nframework in a MH-MR patrolling scenario with changing human and robot\ncondition, and failing robots.\n",
        "published": "2020",
        "authors": [
            "Tamzidul Mina",
            "Shyam Sundar Kannan",
            "Wonse Jo",
            "Byung-Cheol Min"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2008.11925v1",
        "title": "Algorithmic Approaches to Reconfigurable Assembly Systems",
        "abstract": "  Assembly of large scale structural systems in space is understood as critical\nto serving applications that cannot be deployed from a single launch. Recent\nliterature proposes the use of discrete modular structures for in-space\nassembly and relatively small scale robotics that are able to modify and\ntraverse the structure. This paper addresses the algorithmic problems in\nscaling reconfigurable space structures built through robotic construction,\nwhere reconfiguration is defined as the problem of transforming an initial\nstructure into a different goal configuration. We analyze different algorithmic\nparadigms and present corresponding abstractions and graph formulations,\nexamining specialized algorithms that consider discretized space and time\nsteps. We then discuss fundamental design trades for different computational\narchitectures, such as centralized versus distributed, and present two\nrepresentative algorithms as concrete examples for comparison. We analyze how\nthose algorithms achieve different objective functions and goals, such as\nminimization of total distance traveled, maximization of fault-tolerance, or\nminimization of total time spent in assembly. This is meant to offer an\nimpression of algorithmic constraints on scalability of corresponding\nstructural and robotic design. From this study, a set of recommendations is\ndeveloped on where and when to use each paradigm, as well as implications for\nphysical robotic and structural system design.\n",
        "published": "2020",
        "authors": [
            "Allan Costa",
            "Benjamin Jenett",
            "Irina Kostitsyna",
            "Amira Abdel-Rahman",
            "Neil Gershenfeld",
            "Kenneth Cheung"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2010.06274v2",
        "title": "Swarming of Aerial Robots with Markov Random Field Optimization",
        "abstract": "  Swarms are highly robust systems that offer unique benefits compared to their\nalternatives. In this work, we propose a bio-inspired and artificial potential\nfield-driven robot swarm control method, where the swarm formation dynamics are\nmodeled on the basis of Markov Random Field (MRF) optimization. We integrate\nthe internal agent-wise local interactions and external environmental\ninfluences into the MRF. The optimized formation configurations at different\nstages of the trajectory can be viewed as formation \"shapes\" which further\nallows us to integrate dynamics-constrained motion control of the robots. We\nshow that this approach can be used to generate dynamically feasible\ntrajectories to navigate teams of aerial robots in complex environments.\n",
        "published": "2020",
        "authors": [
            "Malintha Fernando",
            "Lantao Liu"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2010.11061v2",
        "title": "MADER: Trajectory Planner in Multi-Agent and Dynamic Environments",
        "abstract": "  This paper presents MADER, a 3D decentralized and asynchronous trajectory\nplanner for UAVs that generates collision-free trajectories in environments\nwith static obstacles, dynamic obstacles, and other planning agents. Real-time\ncollision avoidance with other dynamic obstacles or agents is done by\nperforming outer polyhedral representations of every interval of the\ntrajectories and then including the plane that separates each pair of polyhedra\nas a decision variable in the optimization problem. MADER uses our recently\ndeveloped MINVO basis to obtain outer polyhedral representations with volumes\n2.36 and 254.9 times, respectively, smaller than the Bernstein or B-Spline\nbases used extensively in the planning literature. Our decentralized and\nasynchronous algorithm guarantees safety with respect to other agents by\nincluding their committed trajectories as constraints in the optimization and\nthen executing a collision check-recheck scheme. Finally, extensive simulations\nin challenging cluttered environments show up to a 33.9% reduction in the\nflight time, and a 88.8% reduction in the number of stops compared to the\nBernstein and B-Spline bases, shorter flight distances than centralized\napproaches, and shorter total times on average than synchronous decentralized\napproaches.\n",
        "published": "2020",
        "authors": [
            "Jesus Tordesillas",
            "Jonathan P. How"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2010.11376v1",
        "title": "Heterogeneous Vehicle Routing and Teaming with Gaussian Distributed\n  Energy Uncertainty",
        "abstract": "  For robot swarms operating on complex missions in an uncertain environment,\nit is important that the decision-making algorithm considers both heterogeneity\nand uncertainty. This paper presents a stochastic programming framework for the\nvehicle routing problem with stochastic travel energy costs and heterogeneous\nvehicles and tasks. We represent the heterogeneity as linear constraints,\nestimate the uncertain energy cost through Gaussian process regression,\nformulate this stochasticity as chance constraints or stochastic recourse\ncosts, and then solve the stochastic programs using branch and cut algorithms\nto minimize the expected energy cost. The performance and practicality are\ndemonstrated through extensive computational experiments and a practical test\ncase.\n",
        "published": "2020",
        "authors": [
            "Bo Fu",
            "William Smith",
            "Denise Rizzo",
            "Matthew Castanier",
            "Kira Barton"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2010.16106v3",
        "title": "MAPS-X: Explainable Multi-Robot Motion Planning via Segmentation",
        "abstract": "  Traditional multi-robot motion planning (MMP) focuses on computing\ntrajectories for multiple robots acting in an environment, such that the robots\ndo not collide when the trajectories are taken simultaneously. In\nsafety-critical applications, a human supervisor may want to verify that the\nplan is indeed collision-free. In this work, we propose a notion of explanation\nfor a plan of MMP, based on visualization of the plan as a short sequence of\nimages representing time segments, where in each time segment the trajectories\nof the agents are disjoint, clearly illustrating the safety of the plan. We\nshow that standard notions of optimality (e.g., makespan) may create conflict\nwith short explanations. Thus, we propose meta-algorithms, namely multi-agent\nplan segmenting-X (MAPS-X) and its lazy variant, that can be plugged on\nexisting centralized sampling-based tree planners X to produce plans with good\nexplanations using a desirable number of images. We demonstrate the efficacy of\nthis explanation-planning scheme and extensively evaluate the performance of\nMAPS-X.\n",
        "published": "2020",
        "authors": [
            "Justin Kottinger",
            "Shaull Almagor",
            "Morteza Lahijanian"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2101.00671v1",
        "title": "Past, Present, and Future of Swarm Robotics",
        "abstract": "  Swarm Robotics is an emerging field of adapting the phenomenon of natural\nswarms to robotics. It is a study of robots that are aimed to mimic natural\nswarms, like ants and birds, to form a system that is scalable, flexible, and\nrobust. These robots show self-organization, autonomy, cooperation, and\ncoordination amongst themselves. The cost and design complexity factor is aimed\nto keep low, hence trying to form systems that are very much similar to natural\nswarms. The robots operate without any central entity to control them, and the\ncommunication amongst the robots can either be direct (robot-to-robot) or\nindirect (robot-to-environment). Swarm robotics has a wide range of application\nfields, from simple household tasks to military missions. This paper reviews\nthe swarm robotics approach from its history to its future. It discusses the\nbasic idea of swarm robotics, its important features, simulators, projects,\nreal life applications and some future ideas.\n",
        "published": "2021",
        "authors": [
            "Ahmad Reza Cheraghi",
            "Sahdia Shahzad",
            "Kalman Graffi"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2101.01978v1",
        "title": "Dynamic Prioritization for Conflict-Free Path Planning of Multi-Robot\n  Systems",
        "abstract": "  Planning collision-free paths for multi-robot systems (MRS) is a challenging\nproblem because of the safety and efficiency constraints required for\nreal-world solutions. Even though coupled path planning approaches provide\noptimal collision-free paths for each agent of the MRS, they search the\ncomposite space of all the agents and therefore, suffer from exponential\nincrease in computation with the number of robots. On the other hand,\nprioritized approaches provide a practical solution to applications with large\nnumber of robots, especially when path computation time and collision avoidance\ntake precedence over guaranteed globally optimal solution. While most\ncentrally-planned algorithms use static prioritization, a dynamic\nprioritization algorithm, PD*, is proposed that employs a novel metric, called\nfreedom index, to decide the priority order of the robots at each time step.\nThis allows the PD* algorithm to simultaneously plan the next step for all\nrobots while ensuring collision-free operation in obstacle ridden environments.\nExtensive simulations were performed to test and compare the performance of the\nproposed PD* scheme with other state-of-the-art algorithms. It was found that\nPD* improves upon the computational time by 25% while providing solutions of\nsimilar path lengths. Increase in efficiency was particularly prominent in\nscenarios with large number of robots and/or higher obstacle densities, where\nthe probability of collisions is higher, suggesting the suitability of PD* in\nsolving such problems.\n",
        "published": "2021",
        "authors": [
            "Aditya Rathi",
            "Rohith G",
            "Madhu Vadali"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2101.02889v1",
        "title": "Practical Control for Multicopters to Avoid Non-Cooperative Moving\n  Obstacles",
        "abstract": "  Unmanned Aerial Vehicles (UAVs) are now becoming increasingly accessible to\namateur and commercial users alike. The main task for UAVs is to keep a\nprescribed separation with obstacles in the air. In this paper, a\ncollision-avoidance control method for non-cooperative moving obstacles is\nproposed for a multicopter with the altitude hold mode by using a Lyapunov-like\nbarrier function. Lyapunov-like functions are designed elaborately, based on\nwhich formal analysis and proofs of the proposed control are made to show that\nthe collision-avoidance control problem can be solved if the moving obstacle is\nslower than the multicopter. The result can be extended to some cases of\nmultiple obstacles. What is more, by the proposed control, a multicopter can\nkeep away from obstacles as soon as possible, once obstacles enter into the\nsafety area of the multicopter accidentally, and converge to the waypoint.\nSimulations and experiments are given to show the effectiveness of the proposed\nmethod by showing the distance between UAV and waypoint, obstacles\nrespectively.\n",
        "published": "2021",
        "authors": [
            "Quan Quan",
            "Rao Fu",
            "Kai-Yuan Cai"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2101.07578v2",
        "title": "Practical Distributed Control for VTOL UAVs to Pass a Virtual Tube",
        "abstract": "  Unmanned Aerial Vehicles (UAVs) are now becoming increasingly accessible to\namateur and commercial users alike. An air traffic management (ATM) system is\nneeded to help ensure that this newest entrant into the skies does not collide\nwith others. In an ATM, airspace can be composed of airways, intersections and\nnodes. In this paper, for simplicity, distributed coordinating the motions of\nVertical TakeOff and Landing (VTOL) UAVs to pass an airway is focused. This is\nformulated as a virtual tube passing problem, which includes passing a virtual\ntube, inter-agent collision avoidance and keeping within the virtual tube.\nLyapunov-like functions are designed elaborately, and formal analysis based on\ninvariant set theorem is made to show that all UAVs can pass the virtual tube\nwithout getting trapped, avoid collision and keep within the virtual tube. What\nis more, by the proposed distributed control, a VTOL UAV can keep away from\nanother VTOL UAV or return back to the virtual tube as soon as possible, once\nit enters into the safety area of another or has a collision with the virtual\ntube during it is passing the virtual tube. Simulations and experiments are\ncarried out to show the effectiveness of the proposed method and the comparison\nwith other methods.\n",
        "published": "2021",
        "authors": [
            "Quan Quan",
            "Rao Fu",
            "Mengxin Li",
            "Donghui Wei",
            "Yan Gao",
            "Kai-Yuan Cai"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2101.11093v2",
        "title": "Non-Monotone Energy-Aware Information Gathering for Heterogeneous Robot\n  Teams",
        "abstract": "  This paper considers the problem of planning trajectories for a team of\nsensor-equipped robots to reduce uncertainty about a dynamical process.\nOptimizing the trade-off between information gain and energy cost (e.g.,\ncontrol effort, distance travelled) is desirable but leads to a non-monotone\nobjective function in the set of robot trajectories. Therefore, common\nmulti-robot planning algorithms based on techniques such as coordinate descent\nlose their performance guarantees. Methods based on local search provide\nperformance guarantees for optimizing a non-monotone submodular function, but\nrequire access to all robots' trajectories, making it not suitable for\ndistributed execution. This work proposes a distributed planning approach based\non local search and shows how lazy/greedy methods can be adopted to reduce the\ncomputation and communication of the approach. We demonstrate the efficacy of\nthe proposed method by coordinating robot teams composed of both ground and\naerial vehicles with different sensing/control profiles and evaluate the\nalgorithm's performance in two target tracking scenarios. Compared to the naive\ndistributed execution of local search, our approach saves up to 60%\ncommunication and 80--92% computation on average when coordinating up to 10\nrobots, while outperforming the coordinate descent based algorithm in achieving\na desirable trade-off between sensing and energy cost.\n",
        "published": "2021",
        "authors": [
            "Xiaoyi Cai",
            "Brent Schlotfeldt",
            "Kasra Khosoussi",
            "Nikolay Atanasov",
            "George J. Pappas",
            "Jonathan P. How"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2105.01889v1",
        "title": "Density-Aware Federated Imitation Learning for Connected and Automated\n  Vehicles with Unsignalized Intersection",
        "abstract": "  Intelligent Transportation System (ITS) has become one of the essential\ncomponents in Industry 4.0. As one of the critical indicators of ITS,\nefficiency has attracted wide attention from researchers. However, the next\ngeneration of urban traffic carried by multiple transport service providers may\nprohibit the raw data interaction among multiple regions for privacy reasons,\neasily ignored in the existing research. This paper puts forward a federated\nlearning-based vehicle control framework to solve the above problem, including\ninteractors, trainers, and an aggregator. In addition, the density-aware model\naggregation method is utilized in this framework to improve vehicle control.\nWhat is more, to promote the performance of the end-to-end learning algorithm\nin the safety aspect, this paper proposes an imitation learning algorithm,\nwhich can obtain collision avoidance capabilities from a set of collision\navoidance rules. Furthermore, a loss-aware experience selection strategy is\nalso explored, reducing the communication overhead between the interactors and\nthe trainers via extra computing. Finally, the experiment results demonstrate\nthat the proposed imitation learning algorithm obtains the ability to avoid\ncollisions and reduces discomfort by 55.71%. Besides, density-aware model\naggregation can further reduce discomfort by 41.37%, and the experience\nselection scheme can reduce the communication overhead by 12.80% while ensuring\nmodel convergence.\n",
        "published": "2021",
        "authors": [
            "Tianhao Wu",
            "Mingzhi Jiang",
            "Yinhui Han",
            "Zheng Yuan",
            "Lin Zhang"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2105.07132v3",
        "title": "Offline Time-Independent Multi-Agent Path Planning",
        "abstract": "  This paper studies a novel planning problem for multiple agents that cannot\nshare holding resources, named OTIMAPP (Offline Time-Independent Multi-Agent\nPath Planning). Given a graph and a set of start-goal pairs, the problem\nconsists in assigning a path to each agent such that every agent eventually\nreaches their goal without blocking each other, regardless of how the agents\nare being scheduled at runtime. The motivation stems from the nature of\ndistributed environments that agents take actions fully asynchronous and have\nno knowledge about those exact timings of other actors. We present solution\nconditions, computational complexity, solvers, and robotic applications.\n",
        "published": "2021",
        "authors": [
            "Keisuke Okumura",
            "François Bonnet",
            "Yasumasa Tamura",
            "Xavier Défago"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2107.04926v1",
        "title": "Potential iLQR: A Potential-Minimizing Controller for Planning\n  Multi-Agent Interactive Trajectories",
        "abstract": "  Many robotic applications involve interactions between multiple agents where\nan agent's decisions affect the behavior of other agents. Such behaviors can be\ncaptured by the equilibria of differential games which provide an expressive\nframework for modeling the agents' mutual influence. However, finding the\nequilibria of differential games is in general challenging as it involves\nsolving a set of coupled optimal control problems. In this work, we propose to\nleverage the special structure of multi-agent interactions to generate\ninteractive trajectories by simply solving a single optimal control problem,\nnamely, the optimal control problem associated with minimizing the potential\nfunction of the differential game. Our key insight is that for a certain class\nof multi-agent interactions, the underlying differential game is indeed a\npotential differential game for which equilibria can be found by solving a\nsingle optimal control problem. We introduce such an optimal control problem\nand build on single-agent trajectory optimization methods to develop a\ncomputationally tractable and scalable algorithm for planning multi-agent\ninteractive trajectories. We will demonstrate the performance of our algorithm\nin simulation and show that our algorithm outperforms the state-of-the-art game\nsolvers. To further show the real-time capabilities of our algorithm, we will\ndemonstrate the application of our proposed algorithm in a set of experiments\ninvolving interactive trajectories for two quadcopters.\n",
        "published": "2021",
        "authors": [
            "Talha Kavuncu",
            "Ayberk Yaraneri",
            "Negar Mehr"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2107.14580v1",
        "title": "Distributed Event- and Self-Triggered Coverage Control with Speed\n  Constrained Unicycle Robots",
        "abstract": "  Voronoi coverage control is a particular problem of importance in the area of\nmulti-robot systems, which considers a network of multiple autonomous robots,\ntasked with optimally covering a large area. This is a common task for fleets\nof fixed-wing Unmanned Aerial Vehicles (UAVs), which are described in this work\nby a unicycle model with constant forward-speed constraints. We develop\nevent-based control/communication algorithms to relax the resource requirements\non wireless communication and control actuators, an important feature for\nbattery-driven or otherwise energy-constrained systems. To overcome the\ndrawback that the event-triggered algorithm requires continuous measurement of\nsystem states, we propose a self-triggered algorithm to estimate the next\ntriggering time. Hardware experiments illustrate the theoretical results.\n",
        "published": "2021",
        "authors": [
            "Yuni Zhou",
            "Lingxuan Kong",
            "Stefan Sosnowski",
            "Qingchen Liu",
            "Sandra Hirche"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2202.00756v2",
        "title": "Ranging-Based Localizability Optimization for Mobile Robotic Networks",
        "abstract": "  In robotic networks relying on noisy range measurements between agents for\ncooperative localization, the achievable positioning accuracy strongly strongly\ndepends on the network geometry. This motivates the problem of planning robot\ntrajectories in such multi-robot systems in a way that maintains high\nlocalization accuracy. We present potential-based planning methods, where\nlocalizability potentials are introduced to characterize the quality of the\nnetwork geometry for cooperative position estimation. These potentials are\nbased on Cramer Rao Lower Bounds (CRLB) and provide a theoretical lower bound\non the error covariance achievable by any unbiased position estimator. In the\nprocess, we establish connections between CRLBs and the theory of graph\nrigidity, which has been previously used to plan the motion of robotic\nnetworks. We develop decentralized deployment algorithms appropriate for large\nnetworks, and we use equality-constrained CRLBs to extend the concept of\nlocalizability to scenarios where additional information about the relative\npositions of the ranging sensors is known. We illustrate the resulting robot\ndeployment methodology through simulated examples and an experiment.\n",
        "published": "2022",
        "authors": [
            "Justin Cano",
            "Jerome Le Ny"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2202.00919v1",
        "title": "Dynamic Time Slot Allocation Algorithm for Quadcopter Swarms",
        "abstract": "  A swarm of quadcopters can perform cooperative tasks, such as monitoring of a\nlarge area, more efficiently than a single one. However, to be able to\nsuccessfully work together, the quadcopters must be aware of the position of\nthe other swarm members, especially to avoid collisions. A quadcopter can share\nits own position by transmitting it via radio waves and in order to allow\nmultiple quadcopters to communicate effectively, a decentralized channel access\nprotocol is essential. We propose a new dynamic channel access protocol, called\nDynamic time slot allocation (DTSA), where the quadcopters share the total\nchannel access time in a non-periodic and decentralized manner. Quadcopters\nwith higher communication demands occupy more time slots than less active ones.\nOur dynamic approach allows the agents to adapt to changing swarm situations\nand therefore to act efficiently, as compared to the state-of-the-art periodic\nchannel access protocol, time division multiple access (TDMA). Along with\nsimulations, we also do experiments using real Crazyflie quadcopters to show\nthe improved performance of DTSA as compared to TDMA.\n",
        "published": "2022",
        "authors": [
            "Sharif Azem",
            "Anam Tahir",
            "Heinz Koeppl"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2202.06071v3",
        "title": "Deadlock Resolution and Feasibility Guarantee in MPC-based Multi-robot\n  Trajectory Generation",
        "abstract": "  Online collision-free trajectory generation within a shared workspace is\nfundamental for most multi-robot applications. However, many widely-used\nmethods based on model predictive control (MPC) lack theoretical guarantees on\nthe feasibility of underlying optimization. Furthermore, when applied in a\ndistributed manner without a central coordinator, deadlocks often occur where\nseveral robots block each other indefinitely. Whereas heuristic methods such as\nintroducing random perturbations exist, no profound analyses are given to\nvalidate these measures. Towards this end, we propose a systematic method\ncalled infinite-horizon model predictive control with deadlock resolution. The\nMPC is formulated as a convex optimization over the proposed modified buffered\nVoronoi with warning band. Based on this formulation, the condition of\ndeadlocks is formally analyzed and proven to be analogous to a force\nequilibrium. A detection-resolution scheme is proposed, which can effectively\ndetect deadlocks online before they even happen. Once detected, it utilizes an\nadaptive resolution scheme to resolve deadlocks, under which no stable\ndeadlocks can exist under minor conditions. In addition, the proposed planning\nalgorithm ensures recursive feasibility of the underlying optimization at each\ntime step under both input and model constraints, is concurrent for all robots\nand requires only local communication. Comprehensive simulation and experiment\nstudies are conducted over large-scale multi-robot systems. Significant\nimprovements on success rate are reported, in comparison with other\nstate-of-the-art methods and especially in crowded and high-speed scenarios.\n",
        "published": "2022",
        "authors": [
            "Yuda Chen",
            "Meng Guo",
            "Zhongkui Li"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2202.09748v1",
        "title": "Velocity Obstacle Based Risk-Bounded Motion Planning for Stochastic\n  Multi-Agent Systems",
        "abstract": "  In this paper, we present an innovative risk-bounded motion planning\nmethodology for stochastic multi-agent systems. For this methodology, the\ndisturbance, noise, and model uncertainty are considered; and a velocity\nobstacle method is utilized to formulate the collision-avoidance constraints in\nthe velocity space. With the exploitation of geometric information of static\nobstacles and velocity obstacles, a distributed optimization problem with\nprobabilistic chance constraints is formulated for the stochastic multi-agent\nsystem. Consequently, collision-free trajectories are generated under a\nprescribed collision risk bound. Due to the existence of probabilistic and\ndisjunctive constraints, the distributed chance-constrained optimization\nproblem is reformulated as a mixed-integer program by introducing the binary\nvariable to improve computational efficiency. This approach thus renders it\npossible to execute the motion planning task in the velocity space instead of\nthe position space, which leads to smoother collision-free trajectories for\nmulti-agent systems and higher computational efficiency. Moreover, the risk of\npotential collisions is bounded with this robust motion planning methodology.\nTo validate the effectiveness of the methodology, different scenarios for\nmultiple agents are investigated, and the simulation results clearly show that\nthe proposed approach can generate high-quality trajectories under a predefined\ncollision risk bound and avoid potential collisions effectively in the velocity\nspace.\n",
        "published": "2022",
        "authors": [
            "Xiaoxue Zhang",
            "Jun Ma",
            "Zilong Cheng",
            "Masayoshi Tomizuka",
            "Tong Heng Lee"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1607.04358v3",
        "title": "Modelling resource contention in multi-robot task allocation problems\n  with uncertain timing",
        "abstract": "  This paper proposes an analytical framework for modelling resource contention\nin multi-robot systems, where the travel times and task durations are\nuncertain. It uses several approximation methods to quickly and accurately\ncalculate the probability distributions describing the times at which the tasks\nstart and finish. Specific contributions include exact and fast approximation\nmethods for calculating the probability of a set of independent normally\ndistributed random events occurring in a given order, a method for calculating\nthe most likely and n-th most likely orders of occurrence for a set of\nindependent normally distributed random events that have equal standard\ndeviations, and a method for approximating the conditional probability\ndistributions of the events given a specific order of the events. The complete\nframework is shown to be faster than a Monte Carlo approach for the same\naccuracy in two multi-robot task allocation problems. In addition, the\nimportance of incorporating uncertainty is demonstrated through a comparison\nwith a deterministic method. This is a general framework that is agnostic to\nthe optimisation method and objective function used, and is applicable to a\nwide range of problems.\n",
        "published": "2016",
        "authors": [
            "Andrew W. Palmer",
            "Andrew J. Hill",
            "Steven J. Scheding"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1607.04881v1",
        "title": "Stochastic Broadcast Control of Multi-Agent Swarms",
        "abstract": "  We present a model for controlling swarms of mobile agents via broadcast\ncontrol, assumed to be detected by a random set of agents in the swarm. The\nagents that detect the control signal become ad-hoc leaders of the swarm. The\nagents are assumed to be velocity controlled, identical, anonymous, memory-less\nunits with limited capabilities of sensing their neighborhood. Each agent is\nprogrammed to behave according to a linear local gathering process, based on\nthe relative position of all its neighbors. The detected exogenous control,\nwhich is a desired velocity vector, is added by the leaders to the local\ngathering control. The graph induced by the agents adjacency is referred to as\nthe visibility graph. We show that for piece-wise constant system parameters\nand a connected visibility graph, the swarm asymptotically aligns in each\ntime-interval on a line in the direction of the exogenous control signal, and\nall the agents move with identical speed. These results hold for two models of\npairwise influence in the gathering process, uniform and scaled. The impact of\nthe influence model is mostly evident when the visibility graph is incomplete.\nThese results are conditioned by the preservation of the connectedness of the\nvisibility graph. In the second part of the report we analyze sufficient\nconditions for preserving the connectedness of the visibility graph. We show\nthat if the visibility graph is complete then certain bounds on the control\nsignal suffice to preserve the completeness of the graph. However, when the\ngraph is incomplete, general conditions, independent of the leaders topology,\ncould not be found.\n",
        "published": "2016",
        "authors": [
            "Ilana Segall",
            "Alfred Bruckstein"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1612.00480v1",
        "title": "A Scalable and Adaptable Multiple-Place Foraging Algorithm for\n  Ant-Inspired Robot Swarms",
        "abstract": "  Individual robots are not effective at exploring large unmapped areas. An\nalternate approach is to use a swarm of simple robots that work together,\nrather than a single highly capable robot. The central-place foraging algorithm\n(CPFA) is effective for coordinating robot swarm search and collection tasks.\nRobots start at a centrally placed location (nest), explore potential targets\nin the area without global localization or central control, and return the\ntargets to the nest. The scalability of the CPFA is limited because large\nnumbers of robots produce more inter-robot collisions and large search areas\nresult in substantial travel costs. We address these problems with the\nmultiple-place foraging algorithm (MPFA), which uses multiple nests distributed\nthroughout the search area. Robots start from a randomly assigned home nest but\nreturn to the closest nest with found targets. We simulate the foraging\nbehavior of robot swarms in the robot simulator ARGoS and employ a genetic\nalgorithm to discover different optimized foraging strategies as swarm sizes\nand the number of targets are scaled up. In our experiments, the MPFA always\nproduces higher foraging rates, fewer collisions, and lower travel and search\ntime compared to the CPFA for the partially clustered targets distribution. The\nmain contribution of this paper is that we systematically quantify the\nadvantages of the MPFA (reduced travel time and collisions), the potential\ndisadvantages (less communication among robots), and the ability of a genetic\nalgorithm to tune MPFA parameters to mitigate search inefficiency due to less\ncommunication.\n",
        "published": "2016",
        "authors": [
            "Qi Lu",
            "Melanie E. Moses",
            "Joshua P. Hecker"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1612.08126v1",
        "title": "Brain-Swarm Interface (BSI): Controlling a Swarm of Robots with Brain\n  and Eye Signals from an EEG Headset",
        "abstract": "  This work presents a novel marriage of Swarm Robotics and Brain Computer\nInterface technology to produce an interface which connects a user to a swarm\nof robots. The proposed interface enables the user to control the swarm's size\nand motion employing just thoughts and eye movements. The thoughts and eye\nmovements are recorded as electrical signals from the scalp by an off-the-shelf\nElectroencephalogram (EEG) headset. Signal processing techniques are used to\nfilter out noise and decode the user's eye movements from raw signals, while a\nHidden Markov Model technique is employed to decipher the user's thoughts from\nfiltered signals. The dynamics of the robots are controlled using a swarm\ncontroller based on potential fields. The shape and motion parameters of the\npotential fields are modulated by the human user through the brain-swarm\ninterface to move the robots. The method is demonstrated experimentally with a\nhuman controlling a swarm of three M3pi robots in a laboratory environment, as\nwell as controlling a swarm of 128 robots in a computer simulation.\n",
        "published": "2016",
        "authors": [
            "Aamodh Suresh",
            "Mac Schwager"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1704.00079v3",
        "title": "Algorithms for Routing of Unmanned Aerial Vehicles with Mobile\n  Recharging Stations",
        "abstract": "  We study the problem of planning a tour for an energy-limited Unmanned Aerial\nVehicle (UAV) to visit a set of sites in the least amount of time. We envision\nscenarios where the UAV can be recharged along the way either by landing on\nstationary recharging stations or on Unmanned Ground Vehicles (UGVs) acting as\nmobile recharging stations. This leads to a new variant of the Traveling\nSalesperson Problem (TSP) with mobile recharging stations. We present an\nalgorithm that finds not only the order in which to visit the sites but also\nwhen and where to land on the charging stations to recharge. Our algorithm\nplans tours for the UGVs as well as determines best locations to place\nstationary charging stations. While the problems we study are NP-Hard, we\npresent a practical solution using Generalized TSP that finds the optimal\nsolution. If the UGVs are slower, the algorithm also finds the minimum number\nof UGVs required to support the UAV mission such that the UAV is not required\nto wait for the UGV. Our simulation results show that the running time is\nacceptable for reasonably sized instances in practice.\n",
        "published": "2017",
        "authors": [
            "Kevin Yu",
            "Ashish Kumar Budhiraja",
            "Pratap Tokekar"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1704.05905v1",
        "title": "A Coalition Formation Algorithm for Multi-Robot Task Allocation in\n  Large-Scale Natural Disasters",
        "abstract": "  In large-scale natural disasters, humans are likely to fail when they attempt\nto reach high-risk sites or act in search and rescue operations. Robots,\nhowever, outdo their counterparts in surviving the hazards and handling the\nsearch and rescue missions due to their multiple and diverse sensing and\nactuation capabilities. The dynamic formation of optimal coalition of these\nheterogeneous robots for cost efficiency is very challenging and research in\nthe area is gaining more and more attention. In this paper, we propose a novel\nheuristic. Since the population of robots in large-scale disaster settings is\nvery large, we rely on Quantum Multi-Objective Particle Swarm Optimization\n(QMOPSO). The problem is modeled as a multi-objective optimization problem.\nSimulations with different test cases and metrics, and comparison with other\nalgorithms such as NSGA-II and SPEA-II are carried out. The experimental\nresults show that the proposed algorithm outperforms the existing algorithms\nnot only in terms of convergence but also in terms of diversity and processing\ntime.\n",
        "published": "2017",
        "authors": [
            "Carla Mouradian",
            "Jagruti Sahoo",
            "Roch H. Glitho",
            "Monique J. Morrow",
            "Paul A. Polakos"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1708.06962v1",
        "title": "Towards Cooperative Motion Planning for Automated Vehicles in Mixed\n  Traffic",
        "abstract": "  While motion planning techniques for automated vehicles in a reactive and\nanticipatory manner are already widely presented, approaches to cooperative\nmotion planning are still remaining. In this paper, we present an approach to\nenhance common motion planning algorithms, that allows for cooperation with\nhuman-driven vehicles. Unlike previous approaches, we integrate the prediction\nof other traffic participants into the motion planning, such that the influence\nof the ego vehicle's behavior on the other traffic participants can be taken\ninto account. For this purpose, a new cost functional is presented, containing\nthe cost for all relevant traffic participants in the scene. Finally, we\npropose a path-velocity-decomposing sampling-based implementation of our\napproach for selected scenarios, which is evaluated in a simulation.\n",
        "published": "2017",
        "authors": [
            "Maximilian Naumann",
            "Christoph Stiller"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1710.04296v1",
        "title": "ALAN: Adaptive Learning for Multi-Agent Navigation",
        "abstract": "  In multi-agent navigation, agents need to move towards their goal locations\nwhile avoiding collisions with other agents and static obstacles, often without\ncommunication with each other. Existing methods compute motions that are\noptimal locally but do not account for the aggregated motions of all agents,\nproducing inefficient global behavior especially when agents move in a crowded\nspace. In this work, we develop methods to allow agents to dynamically adapt\ntheir behavior to their local conditions. We accomplish this by formulating the\nmulti-agent navigation problem as an action-selection problem, and propose an\napproach, ALAN, that allows agents to compute time-efficient and collision-free\nmotions. ALAN is highly scalable because each agent makes its own decisions on\nhow to move using a set of velocities optimized for a variety of navigation\ntasks. Experimental results show that the agents using ALAN, in general, reach\ntheir destinations faster than using ORCA, a state-of-the-art collision\navoidance framework, the Social Forces model for pedestrian navigation, and a\nPredictive collision avoidance model.\n",
        "published": "2017",
        "authors": [
            "Julio Godoy",
            "Tiannan Chen",
            "Stephen J. Guy",
            "Ioannis Karamouzas",
            "Maria Gini"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1710.04726v2",
        "title": "RAWSim-O: A Simulation Framework for Robotic Mobile Fulfillment Systems",
        "abstract": "  This paper deals with a new type of warehousing system, Robotic Mobile\nFulfillment Systems (RMFS). In such systems, robots are sent to carry storage\nunits, so-called \"pods\", from the inventory and bring them to human operators\nworking at stations. At the stations, the items are picked according to\ncustomers' orders. There exist new decision problems in such systems, for\nexample, the reallocation of pods after their visits at work stations or the\nselection of pods to fulfill orders. In order to analyze decision strategies\nfor these decision problems and relations between them, we develop a simulation\nframework called \"RAWSim-O\" in this paper. Moreover, we show a real-world\napplication of our simulation framework by integrating simple robot prototypes\nbased on vacuum cleaning robots.\n",
        "published": "2017",
        "authors": [
            "Marius Merschformann",
            "Lin Xie",
            "Hanyi Li"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1804.02915v2",
        "title": "AutoRVO: Local Navigation with Dynamic Constraints in Dense\n  Heterogeneous Traffic",
        "abstract": "  We present a novel algorithm for computing collision-free navigation for\nheterogeneous road-agents such as cars, tricycles, bicycles, and pedestrians in\ndense traffic. Our approach currently assumes the positions, shapes, and\nvelocities of all vehicles and pedestrians are known and computes smooth\ntrajectories for each agent by taking into account the dynamic constraints. We\ndescribe an efficient optimization-based algorithm for each road-agent based on\nreciprocal velocity obstacles that takes into account kinematic and dynamic\nconstraints. Our algorithm uses tight fitting shape representations based on\nmedial axis to compute collision-free trajectories in dense traffic situations.\nWe evaluate the performance of our algorithm in real-world dense traffic\nscenarios and highlight the benefits over prior reciprocal collision avoidance\nschemes.\n",
        "published": "2018",
        "authors": [
            "Yuexin Ma",
            "Dinesh Manocha",
            "Wenping Wang"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1804.04986v2",
        "title": "Resilient Assignment Using Redundant Robots on Transport Networks with\n  Uncertain Travel Time",
        "abstract": "  This paper considers the problem of assigning multiple mobile robots to goals\non transport networks with uncertain information about travel times. Our aim is\nto produce optimal assignments, such that the average waiting time at\ndestinations is minimized. Since noisy travel time estimates result in\nsub-optimal assignments, we propose a method that offers resilience to\nuncertainty by making use of redundant robots. However, solving the redundant\nassignment problem optimally is strongly NP-hard. Hence, we exploit structural\nproperties of our mathematical problem formulation to propose a\npolynomial-time, near-optimal solution. We demonstrate that our problem can be\nreduced to minimizing a supermodular cost function subject to a matroid\nconstraint. This allows us to develop a greedy algorithm, for which we derive\nsub-optimality bounds. We demonstrate the effectiveness of our approach with\nsimulations on transport networks, where uncertain edge costs and uncertain\nnode positions lead to noisy travel time estimates. Comparisons to benchmark\nalgorithms show that our method performs near-optimally and significantly\nbetter than non-redundant assignment. Finally, our findings include results on\nthe benefit of diversity and complementarity in redundant robot coalitions;\nthese insights contribute towards providing resilience to uncertainty through\ntargeted robot team compositions.\n",
        "published": "2018",
        "authors": [
            "Amanda Prorok"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1805.05374v2",
        "title": "Generating Comfortable, Safe and Comprehensible Trajectories for\n  Automated Vehicles in Mixed Traffic",
        "abstract": "  While motion planning approaches for automated driving often focus on safety\nand mathematical optimality with respect to technical parameters, they barely\nconsider convenience, perceived safety for the passenger and comprehensibility\nfor other traffic participants. For automated driving in mixed traffic,\nhowever, this is key to reach public acceptance. In this paper, we revise the\nproblem statement of motion planning in mixed traffic: Instead of largely\nsimplifying the motion planning problem to a convex optimization problem, we\nkeep a more complex probabilistic multi agent model and strive for a near\noptimal solution. We assume cooperation of other traffic participants, yet\nbeing aware of violations of this assumption. This approach yields solutions\nthat are provably safe in all situations, and convenient and comprehensible in\nsituations that are also unambiguous for humans. Thus, it outperforms existing\napproaches in mixed traffic scenarios, as we show in simulation.\n",
        "published": "2018",
        "authors": [
            "Maximilian Naumann",
            "Martin Lauer",
            "Christoph Stiller"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1805.08320v1",
        "title": "The Swarmathon: An Autonomous Swarm Robotics Competition",
        "abstract": "  The Swarmathon is a swarm robotics programming challenge that engages college\nstudents from minority-serving institutions in NASA's Journey to Mars. Teams\ncompete by programming a group of robots to search for, pick up, and drop off\nresources in a collection zone. The Swarmathon produces prototypes for robot\nswarms that would collect resources on the surface of Mars. Robots operate\ncompletely autonomously with no global map, and each team's algorithm must be\nsufficiently flexible to effectively find resources from a variety of unknown\ndistributions. The Swarmathon includes Physical and Virtual Competitions.\nPhysical competitors test their algorithms on robots they build at their\nschools; they then upload their code to run autonomously on identical robots\nduring the three day competition in an outdoor arena at Kennedy Space Center.\nVirtual competitors complete an identical challenge in simulation. Participants\nmentor local teams to compete in a separate High School Division. In the first\n2 years, over 1,100 students participated. 63% of students were from\nunderrepresented ethnic and racial groups. Participants had significant gains\nin both interest and core robotic competencies that were equivalent across\ngender and racial groups, suggesting that the Swarmathon is effectively\neducating a diverse population of future roboticists.\n",
        "published": "2018",
        "authors": [
            "Sarah M. Ackerman",
            "G. Matthew Fricke",
            "Joshua P. Hecker",
            "Kastro M. Hamed",
            "Samantha R. Fowler",
            "Antonio D. Griego",
            "Jarett C. Jones",
            "J. Jake Nichol",
            "Kurt W. Leucht",
            "Melanie E. Moses"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1805.08629v1",
        "title": "Correlation Clustering Based Coalition Formation For Multi-Robot Task\n  Allocation",
        "abstract": "  In this paper, we study the multi-robot task allocation problem where a group\nof robots needs to be allocated to a set of tasks so that the tasks can be\nfinished optimally. One task may need more than one robot to finish it.\nTherefore the robots need to form coalitions to complete these tasks.\nMulti-robot coalition formation for task allocation is a well-known NP-hard\nproblem. To solve this problem, we use a linear-programming based graph\npartitioning approach along with a region growing strategy which allocates\n(near) optimal robot coalitions to tasks in a negligible amount of time. Our\nproposed algorithm is fast (only taking 230 secs. for 100 robots and 10 tasks)\nand it also finds a near-optimal solution (up to 97.66% of the optimal). We\nhave empirically demonstrated that the proposed approach in this paper always\nfinds a solution which is closer (up to 9.1 times) to the optimal solution than\na theoretical worst-case bound proved in an earlier work.\n",
        "published": "2018",
        "authors": [
            "Ayan Dutta",
            "Vladimir Ufimtsev",
            "Asai Asaithambi"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1810.02517v1",
        "title": "Multi-Vehicle Trajectory Optimisation On Road Networks",
        "abstract": "  This paper addresses the problem of planning time-optimal trajectories for\nmultiple cooperative agents along specified paths through a static road\nnetwork. Vehicle interactions at intersections create non-trivial decisions,\nwith complex flow-on effects for subsequent interactions. A globally optimal,\nminimum time trajectory is found for all vehicles using Mixed Integer Linear\nProgramming (MILP). Computational performance is improved by minimising binary\nvariables using iteratively applied targeted collision constraints, and\nefficient goal constraints. Simulation results in an open-pit mining scenario\ncompare the proposed method against a fast heuristic method and a reactive\napproach based on site practices. The heuristic is found to scale better with\nproblem size while the MILP is able to avoid local minima.\n",
        "published": "2018",
        "authors": [
            "Philip Gun",
            "Andrew Hill",
            "Robin Vujanic"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1810.04016v2",
        "title": "Redundant Robot Assignment on Graphs with Uncertain Edge Costs",
        "abstract": "  We provide a framework for the assignment of multiple robots to goal\nlocations, when robot travel times are uncertain. Our premise is that time is\nthe most valuable asset in the system. Hence, we make use of redundant robots\nto counter the effect of uncertainty and minimize the average waiting time at\ndestinations. We apply our framework to transport networks represented as\ngraphs, and consider uncertainty in the edge costs (i.e., travel time). Since\nsolving the redundant assignment problem is strongly NP-hard, we exploit\nstructural properties of our problem to propose a polynomial-time solution with\nprovable sub-optimality bounds. Our method uses distributive aggregate\nfunctions, which allow us to efficiently (i.e., incrementally) compute the\neffective cost of assigning redundant robots. Experimental results on random\ngraphs show that the deployment of redundant robots through our method reduces\nwaiting times at goal locations, when edge traversals are uncertain.\n",
        "published": "2018",
        "authors": [
            "Amanda Prorok"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1810.07910v2",
        "title": "Urban Swarms: A new approach for autonomous waste management",
        "abstract": "  Modern cities are growing ecosystems that face new challenges due to the\nincreasing population demands. One of the many problems they face nowadays is\nwaste management, which has become a pressing issue requiring new solutions.\nSwarm robotics systems have been attracting an increasing amount of attention\nin the past years and they are expected to become one of the main driving\nfactors for innovation in the field of robotics. The research presented in this\npaper explores the feasibility of a swarm robotics system in an urban\nenvironment. By using bio-inspired foraging methods such as multi-place\nforaging and stigmergy-based navigation, a swarm of robots is able to improve\nthe efficiency and autonomy of the urban waste management system in a realistic\nscenario. To achieve this, a diverse set of simulation experiments was\nconducted using real-world GIS data and implementing different garbage\ncollection scenarios driven by robot swarms. Results presented in this research\nshow that the proposed system outperforms current approaches. Moreover, results\nnot only show the efficiency of our solution, but also give insights about how\nto design and customize these systems.\n",
        "published": "2018",
        "authors": [
            "Antonio Luca Alfeo",
            "Eduardo Castelló Ferrer",
            "Yago Lizarribar Carrillo",
            "Arnaud Grignard",
            "Luis Alonso Pastor",
            "Dylan T. Sleeper",
            "Mario G. C. A. Cimino",
            "Bruno Lepri",
            "Gigliola Vaglini",
            "Kent Larson",
            "Marco Dorigo",
            "Alex `Sandy' Pentland"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1810.11541v1",
        "title": "Human-Robot Trust Integrated Task Allocation and Symbolic Motion\n  planning for Heterogeneous Multi-robot Systems",
        "abstract": "  This paper presents a human-robot trust integrated task allocation and motion\nplanning framework for multi-robot systems (MRS) in performing a set of tasks\nconcurrently. A set of task specifications in parallel are conjuncted with MRS\nto synthesize a task allocation automaton. Each transition of the task\nallocation automaton is associated with the total trust value of human in\ncorresponding robots. Here, the human-robot trust model is constructed with a\ndynamic Bayesian network (DBN) by considering individual robot performance,\nsafety coefficient, human cognitive workload and overall evaluation of task\nallocation. Hence, a task allocation path with maximum encoded human-robot\ntrust can be searched based on the current trust value of each robot in the\ntask allocation automaton. Symbolic motion planning (SMP) is implemented for\neach robot after they obtain the sequence of actions. The task allocation path\ncan be intermittently updated with this DBN based trust model. The overall\nstrategy is demonstrated by a simulation with 5 robots and 3 parallel subtask\nautomata.\n",
        "published": "2018",
        "authors": [
            "Huanfei Zheng",
            "Zhanrui Liao",
            "Yue Wang"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1904.02994v1",
        "title": "Towards a Realistic Simulation Framework for Vehicular Platooning\n  Applications",
        "abstract": "  Cooperative vehicle platooning applications increasingly demand realistic\nsimulation tools to ease their validation and to bridge the gap between\ndevelopment and real-world deployment. However, their complexity and cost often\nhinder its validation in the real world. In this paper, we propose a realistic\nsimulation framework for vehicular platoons that integrates Gazebo with OMNeT++\nover Robot Operating System (ROS) to support the simulation of realistic\nscenarios of autonomous vehicular platoons and their cooperative control.\n",
        "published": "2019",
        "authors": [
            "Bruno Vieira",
            "Ricardo Severino",
            "Anis Koubaa",
            "Eduardo Tovar"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1904.07379v1",
        "title": "Speed and Separation Monitoring using on-robot Time--of--Flight\n  laser--ranging sensor arrays",
        "abstract": "  In this paper, a speed and separation monitoring (SSM) based safety\ncontroller using three time-of-flight ranging sensor arrays fastened to the\nrobot links, is implemented. Based on the human-robot minimum distance and\ntheir relative velocities, a controller output characterized by a modulating\nrobot operation speed is obtained. To avert self-avoidance, a self occlusion\ndetection method is implemented using ray-casting technique to filter out the\ndistance values associated with the robot-self and the restricted robot\nworkspace. For validation, the robot workspace is monitored using a motion\ncapture setup to create a digital twin of the human and robot. This setup is\nused to compare the safety,performance and productivity of various versions of\nSSM safety configurations based on minimum distance between human and robot\ncalculated using on-robot Time-of-Flight sensors, motion capture and a 2D\nscanning lidar.\n",
        "published": "2019",
        "authors": [
            "Shitij Kumar",
            "Sarthak Arora",
            "Ferat Sahin"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1904.08310v1",
        "title": "LegenDary 2012 Soccer 2D Simulation Team Description Paper",
        "abstract": "  In LegenDary project, we started a new research based on Agent2D in RoboCup\n2D soccer simulation. In this paper, we mainly present the team algorithms and\nstructures which we used to develop our team in separated section. We have\nfocused on passing, dribbling and blocking skills. We improved them and made\nthe team ready for this competition. Through pass is the most important part of\nour team that we work a lot on it.\n",
        "published": "2019",
        "authors": [
            "Pourya Saljoughi",
            "Reza Ma'anijou",
            "Ehsan Fouladi",
            "Narges Majidi",
            "Saber Yaghoobi",
            "Houman Fallah",
            "Saeideh Zahedi"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1905.00199v2",
        "title": "Cyber-Physical Testbed for Human-Robot Collaborative Task Planning and\n  Execution",
        "abstract": "  In this paper, we present a cyber-physical testbed created to enable a\nhuman-robot team to perform a shared task in a shared workspace. The testbed is\nsuitable for the implementation of a tabletop manipulation task, a common\nhuman-robot collaboration scenario. The testbed integrates elements that exist\nin the physical and virtual world. In this work, we report the insights we\ngathered throughout our exploration in understanding and implementing task\nplanning and execution for human-robot team.\n",
        "published": "2019",
        "authors": [
            "Tuly Hazbar",
            "Shitij Kumar",
            "Ferat Sahin"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1905.00500v1",
        "title": "Hierarchically Consistent Motion Primitives for Quadrotor Coordination",
        "abstract": "  We present a hierarchical framework for motion planning of a large collection\nof agents. The proposed framework starts from low level motion primitives over\na gridded workspace and provides a set of rules for constructing higher level\nmotion primitives. Our hierarchical approach is highly scalable and robust\nmaking it an ideal tool for planning for multi-agent systems. Results are\ndemonstrated experimentally on a collection of quadrotors that must navigate a\ncluttered environment while maintaining a formation.\n",
        "published": "2019",
        "authors": [
            "Marijan Vukosavljev",
            "Angela P. Schoellig",
            "Mireille E. Broucke"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1905.01026v1",
        "title": "HRC-SoS: Human Robot Collaboration Experimentation Platform as System of\n  Systems",
        "abstract": "  This paper presents an experimentation platform for human robot collaboration\nas a system of systems as well as proposes a conceptual framework describing\nthe aspects of Human Robot Collaboration. These aspects are Awareness,\nIntelligence and Compliance of the system. Based on this framework case studies\ndescribing experiment setups performed using this platform are discussed. Each\nexperiment highlights the use of the subsystems such as the digital twin,\nmotion capture system, human-physiological monitoring system, data collection\nsystem and robot control and interface systems. A highlight of this paper\nshowcases a subsystem with the ability to monitor human physiological feedback\nduring a human robot collaboration task.\n",
        "published": "2019",
        "authors": [
            "Celal Savur",
            "Shitij Kumar",
            "Sarthak Arora",
            "Tuly Hazbar",
            "Ferat Sahin"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1905.02648v2",
        "title": "Collaborative Localization for Micro Aerial Vehicles",
        "abstract": "  In this paper, we present a framework for performing collaborative\nlocalization for groups of micro aerial vehicles (MAV) that use vision based\nsensing. The vehicles are each assumed to be equipped with a forward-facing\nmonocular camera, and to be capable of communicating with each other. This\ncollaborative localization approach is developed as a decentralized algorithm\nand built in a distributed fashion where individual and relative pose\nestimation techniques are combined for the group to localize against\nsurrounding environments. The MAVs initially detect and match salient features\nbetween each other to create a sparse reconstruction of the observed\nenvironment, which acts as a global map. Once a map is available, each MAV\nperforms feature detection and tracking with a robust outlier rejection process\nto estimate its own pose in 6 degrees of freedom. Occasionally, one or more\nMAVs can be tasked to compute poses for another MAV through relative\nmeasurements, which is achieved by exploiting multiple view geometry concepts.\nThese relative measurements are then fused with individual measurements in a\nconsistent fashion. We present the results of the algorithm on image data from\nMAV flights both in simulation and real life, and discuss the advantages of\ncollaborative localization in improving pose estimation accuracy.\n",
        "published": "2019",
        "authors": [
            "Sai Vemprala",
            "Srikanth Saripalli"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1905.09988v2",
        "title": "Decentralized Informative Path Planning with Exploration-Exploitation\n  Balance for Swarm Robotic Search",
        "abstract": "  Swarm robotic search is concerned with searching targets in unknown\nenvironments (e.g., for search and rescue or hazard localization), using a\nlarge number of collaborating simple mobile robots. In such applications,\ndecentralized swarm systems are touted for their task/coverage scalability,\ntime efficiency, and fault tolerance. To guide the behavior of such swarm\nsystems, two broad classes of approaches are available, namely nature-inspired\nswarm heuristics and multi-robotic search methods. However, simultaneously\noffering computationally-efficient scalability and fundamental insights into\nthe exhibited behavior (instead of a black-box behavior model), remains\nchallenging under either of these two class of approaches. In this paper, we\ndevelop an important extension of the batch Bayesian search method for\napplication to embodied swarm systems, searching in a physical 2D space. Key\ncontributions lie in: 1) designing an acquisition function that not only\nbalances exploration and exploitation across the swarm, but also allows\nmodeling knowledge extraction over trajectories; and 2) developing its\ndistributed implementation to allow asynchronous task inference and path\nplanning by the swarm robots. The resulting collective informative path\nplanning approach is tested on target search case studies of varying\ncomplexity, where the target produces a spatially varying (measurable) signal.\nSignificantly superior performance, in terms of mission completion efficiency,\nis observed compared to exhaustive search and random walk baselines, along with\nfavorable performance scalability with increasing swarm size.\n",
        "published": "2019",
        "authors": [
            "Payam Ghassemi",
            "Souma Chowdhury"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1906.00401v2",
        "title": "Multiple Drones driven Hexagonally Partitioned Area Exploration:\n  Simulation and Evaluation",
        "abstract": "  In this paper, we simulated a distributed, cooperative path planning\ntechnique for multiple drones (~200) to explore an unknown region (~10,000\nconnected units) in the presence of obstacles. The map of an unknown region is\ndynamically created based on the information obtained from sensors and other\ndrones. The unknown area is considered a connected region made up of hexagonal\nunit cells. These cells are grouped to form larger cells called sub-areas. We\nuse long range and short range communication. The short-range communication\nwithin drones in smaller proximity helps avoid re-exploration of cells already\nexplored by companion drones located in the same subarea. The long-range\ncommunication helps drones identify next subarea to be targeted based on\nweighted RNN (Reverse nearest neighbor). Simulation results show that weighted\nRNN in a hexagonal representation makes exploration more efficient, scalable\nand resilient to communication failures.\n",
        "published": "2019",
        "authors": [
            "Ayush Datta",
            "Rahul Tallamraju",
            "Kamalakar Karlapalem"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1906.01957v1",
        "title": "Maximizing Energy Battery Efficiency in Swarm Robotics",
        "abstract": "  Miniaturization and cost, two of the main attractive factors of swarm\nrobotics, have motivated its use as a solution in object collecting tasks,\nsearch & rescue missions, and other applications. However, in the current\nliterature only a few papers consider energy allocation efficiency within a\nswarm. Generally, robots recharge to their maximum level every time\nunconditionally, and do not incorporate estimates of the energy needed for\ntheir next task. In this paper we present an energy efficiency maximization\nmethod that minimizes the overall energy cost within a swarm while\nsimultaneously maximizing swarm performance on an object gathering task. The\nmethod utilizes dynamic thresholds for upper and lower battery limits. This\nmethod has also shown to improve the efficiency of existing energy management\nmethods.\n",
        "published": "2019",
        "authors": [
            "Anthony Chen",
            "John Harwell",
            "Maria Gini"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1906.07030v1",
        "title": "Simple Swarm Foraging Algorithm Based on Gradient Computation",
        "abstract": "  Swarm foraging is a common test case application for multi-robot systems. In\nthis paper we present a novel algorithm for controlling swarm robots with\nlimited communication range and storage capacity to efficiently search for and\nretrieve targets within an unknown environment. In our approach, robots search\nusing random walk and adjust their turn probability based on attraction and\nrepulsion signals they sense from other robots. We compared our algorithm with\nfive different variations reflecting absence or presence of attractive and/or\nrepulsive communication signals. Our results show that best performance is\nachieved when both signals are used by robots for communication. Furthermore,\nwe show through hardware experiments how the communication model we used in the\nsimulation could be realized on real robots.\n",
        "published": "2019",
        "authors": [
            "Simon O. Obute",
            "Mehmet R. Dogar",
            "Jordan H. Boyle"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1906.07492v1",
        "title": "Chemotaxis Based Virtual Fence for Swarm Robots in Unbounded\n  Environments",
        "abstract": "  This paper presents a novel swarm robotics application of chemotaxis\nbehaviour observed in microorganisms. This approach was used to cause\nexploration robots to return to a work area around the swarm's nest within a\nboundless environment. We investigate the performance of our algorithm through\nextensive simulation studies and hardware validation. Results show that the\nchemotaxis approach is effective for keeping the swarm close to both stationary\nand moving nests. Performance comparison of these results with the unrealistic\ncase where a boundary wall was used to keep the swarm within a target search\narea showed that our chemotaxis approach produced competitive results.\n",
        "published": "2019",
        "authors": [
            "Simon O. Obute",
            "Mehmet R. Dogar",
            "Jordan H. Boyle"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1906.11452v1",
        "title": "Traffic Management Strategies for Multi-Robotic Rigid Payload Transport\n  Systems",
        "abstract": "  In this work, we address traffic management of multiple payload transport\nsystems comprising of non-holonomic robots. We consider loosely coupled rigid\nrobot formations carrying a payload from one place to another. Each payload\ntransport system (PTS) moves in various kinds of environments with obstacles.\nWe ensure each PTS completes its given task by avoiding collisions with other\npayload systems and obstacles as well. Each PTS has one leader and multiple\nfollowers and the followers maintain a desired distance and angle with respect\nto the leader using a decentralized leader-follower control architecture while\nmoving in the traffic. We showcase, through simulations the time taken by each\nPTS to traverse its respective trajectory with and without other PTS and\nobstacles. We show that our strategies help manage the traffic for a large\nnumber of PTS moving from one place to another.\n",
        "published": "2019",
        "authors": [
            "Yahnit Sirineni",
            "Pulkit Verma",
            "Kamalakar Karlapalem"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1906.11614v2",
        "title": "Methodology of Designing Multi-agent Robot Control Systems Utilising\n  Hierarchical Petri Nets",
        "abstract": "  A robot system is designed as a set of embodied agents. An embodied agent is\ndecomposed into cooperating subsystems. In our previous work activities of\nsubsystems were defined by hierarchical finite state machines. With their\nstates, activities were associated. In that approach communication between\nsubsystems was treated as an implementation issue. This paper represents the\nactivities of a robot system using hierarchical Petri nets with conditions.\nSuch net is created by specifying consecutive layers: multi-agent robot system\nlayer, agent layer, subsystem layer, behaviour layer and communication layer.\nThis decomposition not only organizes in a systematic manner the development of\na robot system but also introduces a comprehensive description of concurrently\nacting subsystems. Based on those theoretical considerations, a tool was\ncreated for producing hierarchical Petri nets defining the model of a robotic\nsystem and enabling automatic generation of the robot controller code,\nresulting in a significant acceleration of the implementation phase. The\ncapabilities of the tool are presented by the development of a robot controller\nperforming a rudimentary task.\n",
        "published": "2019",
        "authors": [
            "Maksym Figat",
            "Cezary Zieliński"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1909.04838v1",
        "title": "3D traffic flow model for UAVs",
        "abstract": "  In this work, we introduce a microscopic traffic flow model called Scalar\nCapacity Model (SCM) which can be used to study the formation of traffic on an\nairway link for autonomous Unmanned Aerial Vehicles (UAV) as well as for the\nground vehicles on the road. Given the 3D nature of UAV flights, the main\nnovelty in our model is to eliminate the commonly used notion of lanes and\nreplace it with a notion of density and capacity of flow, but in such a way\nthat individual vehicle motions can still be modeled. We name this a\nDensity/Capacity View (DCV) of the link capacity and how vehicles utilize it\nversus the traditional One/Multi-Lane View (OMV). An interesting feature of\nthis model is exhibiting both passing and blocking regimes (analogous to\nmulti-lane or single-lane) depending on the set scalar parameter for capacity.\nWe show the model has linear local (platoon) and string stability. Also, we\nperform numerical simulations and show evidence for non-linear stability. Our\ntraffic flow model is represented by a nonlinear differential equation which we\ntransform into a linear form. This makes our model analytically solvable in the\nblocking regime and piece-wise analytically solvable in the passing regime.\n",
        "published": "2019",
        "authors": [
            "Mirmojtaba Gharibi",
            "Raouf Boutaba",
            "Steven L. Waslander"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1909.07487v3",
        "title": "Improving Human Performance Using Mixed Granularity of Control in\n  Multi-Human Multi-Robot Interaction",
        "abstract": "  Due to the potentially large number of units involved, the interaction with a\nmulti-robot system is likely to exceed the limits of the span of apprehension\nof any individual human operator. In previous work, we studied how this issue\ncan be tackled by interacting with the robots in two modalities --\nenvironment-oriented and robot-oriented. In this paper, we study how this\nconcept can be applied to the case in which multiple human operators perform\nsupervisory control on a multi-robot system. While the presence of extra\noperators suggests that more complex tasks could be accomplished, little\nresearch exists on how this could be achieved efficiently. In particular, one\nchallenge arises -- the out-of-the-loop performance problem caused by a lack of\nengagement in the task, awareness of its state, and trust in the system and in\nthe other operators. Through a user study involving 28 human operators and 8\nreal robots, we study how the concept of mixed granularity in multi-human\nmulti-robot interaction affects user engagement, awareness, and trust while\nbalancing the workload between multiple operators.\n",
        "published": "2019",
        "authors": [
            "Jayam Patel",
            "Carlo Pinciroli"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1909.08290v1",
        "title": "SPARCAS: A Decentralized, Truthful Multi-Agent Collision-free Path\n  Finding Mechanism",
        "abstract": "  We propose a decentralized collision-avoidance mechanism for a group of\nindependently controlled robots moving on a shared workspace. Existing\nalgorithms achieve multi-robot collision avoidance either (a) in a centralized\nsetting, or (b) in a decentralized setting with collaborative robots. We focus\non the setting with competitive robots in a decentralized environment, where\nrobots may strategically reveal their information to get prioritized. We\npropose the mechanism SPARCAS in this setting that, using principles of\nmechanism design, ensures truthful revelation of the robots' private\ninformation and provides locally efficient movement of the robots. It is free\nfrom collisions and deadlocks, and handles a dynamic arrival of robots. In\npractice, this mechanism scales well for a large number of robots where the\noptimal collision-avoiding path-finding algorithm (M*) does not scale. Yet,\nSPARCAS does not compromise the path optimality too much. Our mechanism\nprioritizes the robots in the order of their `true' higher needs, but for a\nhigher payment. It uses monetary transfers which is small enough compared to\nthe value received by the robots.\n",
        "published": "2019",
        "authors": [
            "Sankar Das",
            "Swaprava Nath",
            "Indranil Saha"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1909.10378v1",
        "title": "Decentralized Connectivity Control in Quadcopters: a Field Study of\n  Communication Performance",
        "abstract": "  Redundancy and parallelism make decentralized multi-robot systems appealing\nsolutions for the exploration of extreme environments. However, effective\ncooperation often requires team-wide connectivity and a carefully designed\ncommunication strategy. Several recently proposed decentralized connectivity\nmaintenance approaches exploit elegant algebraic results drawn from spectral\ngraph theory. Yet, these proposals are rarely taken beyond simulations or\nlaboratory implementations. In this work, we present two major contributions:\n(i) we describe the full-stack implementation---from hardware to software---of\na decentralized control law for robust connectivity maintenance; and (ii) we\nassess, in the field, our setup's ability to correctly exchange all the\nnecessary information required to maintain connectivity in a team of\nquadcopters.\n",
        "published": "2019",
        "authors": [
            "Jacopo Panerati",
            "Benjamin Ramtoula",
            "David St-Onge",
            "Yanjun Cao",
            "Marcel Kaufmann",
            "Aidan Cowley",
            "Lorenzo Sabattini",
            "Giovanni Beltrame"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1909.11227v3",
        "title": "Negotiation-based Human-Robot Collaboration via Augmented Reality",
        "abstract": "  Effective human-robot collaboration (HRC) requires extensive communication\namong the human and robot teammates, because their actions can potentially\nproduce conflicts, synergies, or both. We develop a novel augmented reality\n(AR) interface to bridge the communication gap between human and robot\nteammates. Building on our AR interface, we develop an AR-mediated,\nnegotiation-based (ARN) framework for HRC. We have conducted experiments both\nin simulation and on real robots in an office environment, where multiple\nmobile robots work on delivery tasks. The robots could not complete the tasks\non their own, but sometimes need help from their human teammate, rendering\nhuman-robot collaboration necessary. Results suggest that ARN significantly\nreduced the human-robot team's task completion time compared to a non-AR\nbaseline approach.\n",
        "published": "2019",
        "authors": [
            "Kishan Chandan",
            "Vidisha Kudalkar",
            "Xiang Li",
            "Shiqi Zhang"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1911.04074v2",
        "title": "SUMMIT: A Simulator for Urban Driving in Massive Mixed Traffic",
        "abstract": "  Autonomous driving in an unregulated urban crowd is an outstanding challenge,\nespecially, in the presence of many aggressive, high-speed traffic\nparticipants. This paper presents SUMMIT, a high-fidelity simulator that\nfacilitates the development and testing of crowd-driving algorithms. By\nleveraging the open-source OpenStreetMap map database and a heterogeneous\nmulti-agent motion prediction model developed in our earlier work, SUMMIT\nsimulates dense, unregulated urban traffic for heterogeneous agents at any\nworldwide locations that OpenStreetMap supports. SUMMIT is built as an\nextension of CARLA and inherits from it the physics and visual realism for\nautonomous driving simulation. SUMMIT supports a wide range of applications,\nincluding perception, vehicle control and planning, and end-to-end learning. We\nprovide a context-aware planner together with benchmark scenarios and show that\nSUMMIT generates complex, realistic traffic behaviors in challenging\ncrowd-driving settings.\n",
        "published": "2019",
        "authors": [
            "Panpan Cai",
            "Yiyuan Lee",
            "Yuanfu Luo",
            "David Hsu"
        ]
    },
    {
        "id": "http://arxiv.org/abs/1911.10578v1",
        "title": "Prioritized Multi-agent Path Finding for Differential Drive Robots",
        "abstract": "  Methods for centralized planning of the collision-free trajectories for a\nfleet of mobile robots typically solve the discretized version of the problem\nand rely on numerous simplifying assumptions, e.g. moves of uniform duration,\ncardinal only translations, equal speed and size of the robots etc., thus the\nresultant plans can not always be directly executed by the real robotic\nsystems. To mitigate this issue we suggest a set of modifications to the\nprominent prioritized planner -- AA-SIPP(m) -- aimed at lifting the most\nrestrictive assumptions (syncronized translation only moves, equal size and\nspeed of the robots) and at providing robustness to the solutions. We evaluate\nthe suggested algorithm in simulation and on differential drive robots in\ntypical lab environment (indoor polygon with external video-based navigation\nsystem). The results of the evaluation provide a clear evidence that the\nalgorithm scales well to large number of robots (up to hundreds in simulation)\nand is able to produce solutions that are safely executed by the robots prone\nto imperfect trajectory following. The video of the experiments can be found at\nhttps://youtu.be/Fer_irn4BG0.\n",
        "published": "2019",
        "authors": [
            "Konstantin Yakovlev",
            "Anton Andreychuk",
            "Vitaly Vorobyev"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2002.04517v1",
        "title": "A Versatile Multi-Robot Monte Carlo Tree Search Planner for On-Line\n  Coverage Path Planning",
        "abstract": "  Mobile robots hold great promise in reducing the need for humans to perform\njobs such as vacuuming, seeding,harvesting, painting, search and rescue, and\ninspection. In practice, these tasks must often be done without an exact map of\nthe area and could be completed more quickly through the use of multiple robots\nworking together. The task of simultaneously covering and mapping an area with\nmultiple robots is known as multi-robot on-line coverage and is a growing area\nof research. Many multi-robot on-line coverage path planning algorithms have\nbeen developed as extensions of well established off-line coverage algorithms.\nIn this work we introduce a novel approach to multi-robot on-line coverage path\nplanning based on a method borrowed from game theory and machine learning-\nMonte Carlo Tree Search. We implement a Monte Carlo Tree Search planner and\ncompare completion times against a Boustrophedon-based on-line multi-robot\nplanner. The MCTS planner is shown to perform on par with the conventional\nBoustrophedon algorithm in simulations varying the number of robots and the\ndensity of obstacles in the map. The versatility of the MCTS planner is\ndemonstrated by incorporating secondary objectives such as turn minimization\nwhile performing the same coverage task. The versatility of the MCTS planner\nsuggests it is well suited to many multi-objective tasks that arise in mobile\nrobotics.\n",
        "published": "2020",
        "authors": [
            "Phillip Hyatt",
            "Zachary Brock",
            "Marc D. Killpack"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2005.08153v1",
        "title": "Coordinated Coverage and Fault Tolerance using Fixed-Wing Unmanned\n  Aerial Vehicles",
        "abstract": "  This paper presents an approach for deploying and maintaining a fleet of\nhomogeneous fixed-wing unmanned aerial vehicles (UAVs) for all-time coverage of\nan area. Two approaches for loiter circle packing have been presented: square\nand hexagon packing, and the benefits of hexagon packing for minimizing the\nnumber of deployed UAVs have been shown. Based on the number of UAVs available\nand the desired loitering altitude, the proposed algorithm solves an\noptimization problem to calculate the centres of the loitering circles and the\nloitering radius for that altitude. The algorithm also incorporates fault\nrecovery capacity in case of simultaneous multiple UAV failures. These failures\ncould form clusters of survivor (active) UAVs over the area with no overall\nsurvivor information. The algorithm deploys a super-agent with a larger\ncommunication capacity at a higher altitude to recover from the failure. The\nsuper-agent collects the information of survivors, and updates the homogeneous\nradius and the locations of the loitering circles at the same altitude to\nrestore the full coverage. The individual survivor UAVs are then informed and\ntransit to the new loitering circles using Dubin's paths. The relationship with\nthe extent of recoverable loss fractions of the deployed UAVs have been\nanalysed for varying the initial loiter radii. Simulation results have been\npresented to demonstrate the applicability of the approach and compare the two\npresented packing approaches.\n",
        "published": "2020",
        "authors": [
            "Sachin Shriwastav",
            "Zhuoyuan Song"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2005.13187v3",
        "title": "Time-Independent Planning for Multiple Moving Agents",
        "abstract": "  Typical Multi-agent Path Finding (MAPF) solvers assume that agents move\nsynchronously, thus neglecting the reality gap in timing assumptions, e.g.,\ndelays caused by an imperfect execution of asynchronous moves. So far, two\npolicies enforce a robust execution of MAPF plans taken as input: either by\nforcing agents to synchronize or by executing plans while preserving temporal\ndependencies. This paper proposes an alternative approach, called\ntime-independent planning, which is both online and distributed. We represent\nreality as a transition system that changes configurations according to atomic\nactions of agents, and use it to generate a time-independent schedule.\nEmpirical results in a simulated environment with stochastic delays of agents'\nmoves support the validity of our proposal.\n",
        "published": "2020",
        "authors": [
            "Keisuke Okumura",
            "Yasumasa Tamura",
            "Xavier Défago"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2005.14455v1",
        "title": "A Hierarchical Collision Avoidance Architecture for Multiple Fixed-Wing\n  UAVs in an Integrated Airspace",
        "abstract": "  This paper studies the collision avoidance problem for autonomous multiple\nfixedwing UAVs in the complex integrated airspace. By studying and combining\nthe online path planning method, the distributed model predictive control\nalgorithm, and the geometric reactive control approach, a three-layered\ncollision avoidance system integrating conflict detection and resolution\nprocedures is developed for multiple fixed-wing UAVs modeled by unicycle\nkinematics subject to input constraints. The effectiveness of the proposed\nmethodology is evaluated and validated via test results of comparative\nsimulations under both deterministic and probabilistic sensing conditions.\n",
        "published": "2020",
        "authors": [
            "Yajing Wang",
            "Xiangke Wang",
            "Shulong Zhao",
            "Lincheng Shen"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2009.00288v2",
        "title": "Needs-driven Heterogeneous Multi-Robot Cooperation in Rescue Missions",
        "abstract": "  This paper focuses on the teaming aspects and the role of heterogeneity in a\nmulti-robot system applied to robot-aided urban search and rescue (USAR)\nmissions. We propose a needs-driven multi-robot cooperation mechanism\nrepresented through a Behavior Tree structure and evaluate the system's\nperformance in terms of the group utility and energy cost to achieve the rescue\nmission in a limited time. From the theoretical analysis, we prove that the\nneeds-driven cooperation in a heterogeneous robot system enables higher group\nutility than a homogeneous robot system. We also perform simulation experiments\nto verify the proposed needs-driven collaboration and show that the\nheterogeneous multi-robot cooperation can achieve better performance and\nincrease system robustness by reducing uncertainty in task execution. Finally,\nwe discuss the application to human-robot teaming.\n",
        "published": "2020",
        "authors": [
            "Qin Yang",
            "Ramviyas Parasuraman"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2009.04593v2",
        "title": "Resilient Task Allocation in Heterogeneous Multi-Robot Systems",
        "abstract": "  For a multi-robot system equipped with heterogeneous capabilities, this paper\npresents a mechanism to allocate robots to tasks in a resilient manner when\nanomalous environmental conditions such as weather events or adversarial\nattacks affect the performance of robots within the tasks. Our primary\nobjective is to ensure that each task is assigned the requisite level of\nresources, measured as the aggregated capabilities of the robots allocated to\nthe task. By keeping track of task performance deviations under external\nperturbations, our framework quantifies the extent to which robot capabilities\n(e.g., visual sensing or aerial mobility) are affected by environmental\nconditions. This enables an optimization-based framework to flexibly reallocate\nrobots to tasks based on the most degraded capabilities within each task. In\nthe face of resource limitations and adverse environmental conditions, our\nalgorithm minimally relaxes the resource constraints corresponding to some\ntasks, thus exhibiting a graceful degradation of performance. Simulated\nexperiments in a multi-robot coverage and target tracking scenario demonstrate\nthe efficacy of the proposed approach.\n",
        "published": "2020",
        "authors": [
            "Siddharth Mayya",
            "Diego S. D'antonio",
            "David Saldaña",
            "Vijay Kumar"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2009.04655v3",
        "title": "SkyTrakx: A Toolkit for Simulation and Verification of Unmanned\n  Air-Traffic Management Systems (Extended Version)",
        "abstract": "  The key concept for safe and efficient traffic management for Unmanned\nAircraft Systems (UAS) is the notion of operation volume (OV). An OV is a\n4-dimensional block of airspace and time, which can express an aircraft's\nintent, and can be used for planning, de-confliction, and traffic management.\nWhile there are several high-level simulators for UAS Traffic Management (UTM),\nwe are lacking a framework for creating, manipulating, and reasoning about OVs\nfor heterogeneous air vehicles. In this paper, we address this and present\nSkyTrakx -- a software toolkit for simulation and verification of UTM scenarios\nbased on OVs. First, we illustrate a use case of SkyTrakx by presenting a\nspecific air traffic coordination protocol. This protocol communicates OVs\nbetween participating aircraft and an airspace manager for traffic routing. We\nshow how existing formal verification tools, Dafny and Dione, can assist in\nautomatically checking key properties of the protocol. Second, we show how the\nOVs can be computed for heterogeneous air vehicles like quadcopters and\nfixed-wing aircraft using another verification technique, namely reachability\nanalysis. Finally, we show that SkyTrakx can be used to simulate complex\nscenarios involving heterogeneous vehicles, for testing and performance\nevaluation in terms of workload and response delays analysis. Our experiments\ndelineate the trade-off between performance and workload across different\nstrategies for generating OVs.\n",
        "published": "2020",
        "authors": [
            "Chiao Hsieh",
            "Hussein Sibai",
            "Hebron Taylor",
            "Yifeng Ni",
            "Sayan Mitra"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2009.09537v1",
        "title": "Multi-Robot Target Search using Probabilistic Consensus on Discrete\n  Markov Chains",
        "abstract": "  In this paper, we propose a probabilistic consensus-based multi-robot search\nstrategy that is robust to communication link failures, and thus is suitable\nfor disaster affected areas. The robots, capable of only local communication,\nexplore a bounded environment according to a random walk modeled by a\ndiscrete-time discrete-state (DTDS) Markov chain and exchange information with\nneighboring robots, resulting in a time-varying communication network topology.\nThe proposed strategy is proved to achieve consensus, here defined as agreement\non the presence of a static target, with no assumptions on the connectivity of\nthe communication network. Using numerical simulations, we investigate the\neffect of the robot population size, domain size, and information uncertainty\non the consensus time statistics under this scheme. We also validate our\ntheoretical results with 3D physics-based simulations in Gazebo. The\nsimulations demonstrate that all robots achieve consensus in finite time with\nthe proposed search strategy over a range of robot densities in the\nenvironment.\n",
        "published": "2020",
        "authors": [
            "Aniket Shirsat",
            "Karthik Elamvazhuthi",
            "Spring Berman"
        ]
    }
]