[
    {
        "id": "http://arxiv.org/abs/2212.06628v1",
        "title": "Target Defense against Sequentially Arriving Intruders",
        "abstract": "  We consider a variant of the target defense problem where a single defender\nis tasked to capture a sequence of incoming intruders. The intruders' objective\nis to breach the target boundary without being captured by the defender. As\nsoon as the current intruder breaches the target or gets captured by the\ndefender, the next intruder appears at a random location on a fixed circle\nsurrounding the target. Therefore, the defender's final location at the end of\nthe current game becomes its initial location for the next game. Thus, the\nplayers pick strategies that are advantageous for the current as well as for\nthe future games. Depending on the information available to the players, each\ngame is divided into two phases: partial information and full information\nphase. Under some assumptions on the sensing and speed capabilities, we analyze\nthe agents' strategies in both phases. We derive equilibrium strategies for\nboth the players to optimize the capture percentage using the notions of\nengagement surface and capture circle. We quantify the percentage of capture\nfor both finite and infinite sequences of incoming intruders.\n",
        "published": "2022",
        "authors": [
            "Arman Pourghorban",
            "Michael Dorothy",
            "Daigo Shishika",
            "Alexander Von Moll",
            "Dipankar Maity"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2212.14116v2",
        "title": "Coordination of Drones at Scale: Decentralized Energy-aware Swarm\n  Intelligence for Spatio-temporal Sensing",
        "abstract": "  Smart City applications, such as traffic monitoring and disaster response,\noften use swarms of intelligent and cooperative drones to efficiently collect\nsensor data over different areas of interest and time spans. However, when the\nrequired sensing becomes spatio-temporally large and varying, a collective\narrangement of sensing tasks to a large number of battery-restricted and\ndistributed drones is challenging. To address this problem, this paper\nintroduces a scalable and energy-aware model for planning and coordination of\nspatio-temporal sensing. The coordination model is built upon a decentralized\nmulti-agent collective learning algorithm (EPOS) to ensure scalability,\nresilience, and flexibility that existing approaches lack of. Experimental\nresults illustrate the outstanding performance of the proposed method compared\nto state-of-the-art methods. Analytical results contribute a deeper\nunderstanding of how coordinated mobility of drones influences sensing\nperformance. This novel coordination solution is applied to traffic monitoring\nusing real-world data to demonstrate a $46.45\\%$ more accurate and $2.88\\%$\nmore efficient detection of vehicles as the number of drones become a scarce\nresource.\n",
        "published": "2022",
        "authors": [
            "Chuhao Qin",
            "Evangelos Pournaras"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2301.04386v1",
        "title": "Decentralized iLQR for Cooperative Trajectory Planning of Connected\n  Autonomous Vehicles via Dual Consensus ADMM",
        "abstract": "  Developments in cooperative trajectory planning of connected autonomous\nvehicles (CAVs) have gathered considerable momentum and research attention.\nGenerally, such problems present strong non-linearity and non-convexity,\nrendering great difficulties in finding the optimal solution. Existing methods\ntypically suffer from low computational efficiency, and this hinders the\nappropriate applications in large-scale scenarios involving an increasing\nnumber of vehicles. To tackle this problem, we propose a novel decentralized\niterative linear quadratic regulator (iLQR) algorithm by leveraging the dual\nconsensus alternating direction method of multipliers (ADMM). First, the\noriginal non-convex optimization problem is reformulated into a series of\nconvex optimization problems through iterative neighbourhood approximation.\nThen, the dual of each convex optimization problem is shown to have a consensus\nstructure, which facilitates the use of consensus ADMM to solve for the dual\nsolution in a fully decentralized and parallel architecture. Finally, the\nprimal solution corresponding to the trajectory of each vehicle is recovered by\nsolving a linear quadratic regulator (LQR) problem iteratively, and a novel\ntrajectory update strategy is proposed to ensure the dynamic feasibility of\nvehicles. With the proposed development, the computation burden is\nsignificantly alleviated such that real-time performance is attainable. Two\ntraffic scenarios are presented to validate the proposed algorithm, and\nthorough comparisons between our proposed method and baseline methods\n(including centralized iLQR, IPOPT, and SQP) are conducted to demonstrate the\nscalability of the proposed approach.\n",
        "published": "2023",
        "authors": [
            "Zhenmin Huang",
            "Shaojie Shen",
            "Jun Ma"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2301.06977v1",
        "title": "Byzantine Resilience at Swarm Scale: A Decentralized Blocklist Protocol\n  from Inter-robot Accusations",
        "abstract": "  The Weighted-Mean Subsequence Reduced (W-MSR) algorithm, the state-of-the-art\nmethod for Byzantine-resilient design of decentralized multi-robot systems, is\nbased on discarding outliers received over Linear Consensus Protocol (LCP).\nAlthough W-MSR provides well-understood theoretical guarantees relating robust\nnetwork connectivity to the convergence of the underlying consensus, the method\ncomes with several limitations preventing its use at scale: (1) the number of\nByzantine robots, F, to tolerate should be known a priori, (2) the requirement\nthat each robot maintains 2F+1 neighbors is impractical for large F, (3)\ninformation propagation is hindered by the requirement that F+1 robots\nindependently make local measurements of the consensus property in order for\nthe swarm's decision to change, and (4) W-MSR is specific to LCP and does not\ngeneralize to applications not implemented over LCP. In this work, we propose a\nDecentralized Blocklist Protocol (DBP) based on inter-robot accusations.\nAccusations are made on the basis of locally-made observations of misbehavior,\nand once shared by cooperative robots across the network are used as input to a\ngraph matching algorithm that computes a blocklist. DBP generalizes to\napplications not implemented via LCP, is adaptive to the number of Byzantine\nrobots, and allows for fast information propagation through the multi-robot\nsystem while simultaneously reducing the required network connectivity relative\nto W-MSR. On LCP-type applications, DBP reduces the worst-case connectivity\nrequirement of W-MSR from (2F+1)-connected to (F+1)-connected and the number of\ncooperative observers required to propagate new information from F+1 to just 1\nobserver. We demonstrate empirically that our approach to Byzantine resilience\nscales to hundreds of robots on cooperative target tracking, time\nsynchronization, and localization case studies.\n",
        "published": "2023",
        "authors": [
            "Kacper Wardega",
            "Max von Hippel",
            "Roberto Tron",
            "Cristina Nita-Rotaru",
            "Wenchao Li"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2301.08537v1",
        "title": "Towards Multi-robot Exploration: A Decentralized Strategy for UAV Forest\n  Exploration",
        "abstract": "  Efficient exploration strategies are vital in tasks such as search-and-rescue\nmissions and disaster surveying. Unmanned Aerial Vehicles (UAVs) have become\nparticularly popular in such applications, promising to cover large areas at\nhigh speeds. Moreover, with the increasing maturity of onboard UAV perception,\nresearch focus has been shifting toward higher-level reasoning for single- and\nmulti-robot missions. However, autonomous navigation and exploration of\npreviously unknown large spaces still constitutes an open challenge, especially\nwhen the environment is cluttered and exhibits large and frequent occlusions\ndue to high obstacle density, as is the case of forests. Moreover, the problem\nof long-distance wireless communication in such scenes can become a limiting\nfactor, especially when automating the navigation of a UAV swarm. In this\nspirit, this work proposes an exploration strategy that enables UAVs, both\nindividually and in small swarms, to quickly explore complex scenes in a\ndecentralized fashion. By providing the decision-making capabilities to each\nUAV to switch between different execution modes, the proposed strategy strikes\na great balance between cautious exploration of yet completely unknown regions\nand more aggressive exploration of smaller areas of unknown space. This results\nin full coverage of forest areas of variable density, consistently faster than\nthe state of the art. Demonstrating successful deployment with a single UAV as\nwell as a swarm of up to three UAVs, this work sets out the basic principles\nfor multi-root exploration of cluttered scenes, with up to 65% speed up in the\nsingle UAV case and 40% increase in explored area for the same mission time in\nmulti-UAV setups.\n",
        "published": "2023",
        "authors": [
            "Luca Bartolomei",
            "Lucas Teixeira",
            "Margarita Chli"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2301.11313v1",
        "title": "Distributed Optimization Methods for Multi-Robot Systems: Part I -- A\n  Tutorial",
        "abstract": "  Distributed optimization provides a framework for deriving distributed\nalgorithms for a variety of multi-robot problems. This tutorial constitutes the\nfirst part of a two-part series on distributed optimization applied to\nmulti-robot problems, which seeks to advance the application of distributed\noptimization in robotics. In this tutorial, we demonstrate that many canonical\nmulti-robot problems can be cast within the distributed optimization framework,\nsuch as multi-robot simultaneous localization and planning (SLAM), multi-robot\ntarget tracking, and multi-robot task assignment problems. We identify three\nbroad categories of distributed optimization algorithms: distributed\nfirst-order methods, distributed sequential convex programming, and the\nalternating direction method of multipliers (ADMM). We describe the basic\nstructure of each category and provide representative algorithms within each\ncategory. We then work through a simulation case study of multiple drones\ncollaboratively tracking a ground vehicle. We compare solutions to this problem\nusing a number of different distributed optimization algorithms. In addition,\nwe implement a distributed optimization algorithm in hardware on a network of\nRasberry Pis communicating with XBee modules to illustrate robustness to the\nchallenges of real-world communication networks.\n",
        "published": "2023",
        "authors": [
            "Ola Shorinwa",
            "Trevor Halsted",
            "Javier Yu",
            "Mac Schwager"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2301.11361v1",
        "title": "Distributed Optimization Methods for Multi-Robot Systems: Part II -- A\n  Survey",
        "abstract": "  Although the field of distributed optimization is well-developed, relevant\nliterature focused on the application of distributed optimization to\nmulti-robot problems is limited. This survey constitutes the second part of a\ntwo-part series on distributed optimization applied to multi-robot problems. In\nthis paper, we survey three main classes of distributed optimization algorithms\n-- distributed first-order methods, distributed sequential convex programming\nmethods, and alternating direction method of multipliers (ADMM) methods --\nfocusing on fully-distributed methods that do not require coordination or\ncomputation by a central computer. We describe the fundamental structure of\neach category and note important variations around this structure, designed to\naddress its associated drawbacks. Further, we provide practical implications of\nnoteworthy assumptions made by distributed optimization algorithms, noting the\nclasses of robotics problems suitable for these algorithms. Moreover, we\nidentify important open research challenges in distributed optimization,\nspecifically for robotics problem.\n",
        "published": "2023",
        "authors": [
            "Ola Shorinwa",
            "Trevor Halsted",
            "Javier Yu",
            "Mac Schwager"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2302.01489v1",
        "title": "Online Re-Planning and Adaptive Parameter Update for Multi-Agent Path\n  Finding with Stochastic Travel Times",
        "abstract": "  This study explores the problem of Multi-Agent Path Finding with continuous\nand stochastic travel times whose probability distribution is unknown. Our\npurpose is to manage a group of automated robots that provide package delivery\nservices in a building where pedestrians and a wide variety of robots coexist,\nsuch as delivery services in office buildings, hospitals, and apartments. It is\noften the case with these real-world applications that the time required for\nthe robots to traverse a corridor takes a continuous value and is randomly\ndistributed, and the prior knowledge of the probability distribution of the\ntravel time is limited. Multi-Agent Path Finding has been widely studied and\napplied to robot management systems; however, automating the robot operation in\nsuch environments remains difficult. We propose 1) online re-planning to update\nthe action plan of robots while it is executed, and 2) parameter update to\nestimate the probability distribution of travel time using Bayesian inference\nas the delay is observed. We use a greedy heuristic to obtain solutions in a\nlimited computation time. Through simulations, we empirically compare the\nperformance of our method to those of existing methods in terms of the conflict\nprobability and the actual travel time of robots. The simulation results\nindicate that the proposed method can find travel paths with at least 50% fewer\nconflicts and a shorter actual total travel time than existing methods. The\nproposed method requires a small number of trials to achieve the performance\nbecause the parameter update is prioritized on the important edges for path\nplanning, thereby satisfying the requirements of quick implementation of robust\nplanning of automated delivery services.\n",
        "published": "2023",
        "authors": [
            "Atsuyoshi Kita",
            "Nobuhiro Suenari",
            "Masashi Okada",
            "Tadahiro Taniguchi"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2302.04691v1",
        "title": "Power Line Inspection Tasks with Multi-Aerial Robot Systems via Signal\n  Temporal Logic Specifications",
        "abstract": "  A framework for computing feasible and constrained trajectories for a fleet\nof quad-rotors leveraging on Signal Temporal Logic (STL) specifications for\npower line inspection tasks is proposed in this paper. The planner allows the\nformulation of complex missions that avoid obstacles and maintain a safe\ndistance between drones while performing the planned mission. An optimization\nproblem is set to generate optimal strategies that satisfy these specifications\nand also take vehicle constraints into account. Further, an event-triggered\nreplanner is proposed to reply to unforeseen events and external disturbances.\nAn energy minimization term is also considered to implicitly save quad-rotors\nbattery life while carrying out the mission. Numerical simulations in MATLAB\nand experimental results show the validity and the effectiveness of the\nproposed approach, and demonstrate its applicability in real-world scenarios.\n",
        "published": "2023",
        "authors": [
            "Giuseppe Silano",
            "Tomas Baca",
            "Robert Penicka",
            "Davide Liuzza",
            "Martin Saska"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2302.05258v1",
        "title": "PACNav: A collective navigation approach for UAV swarms deprived of\n  communication and external localization",
        "abstract": "  This article proposes Persistence Administered Collective Navigation (PACNav)\nas an approach for achieving decentralized collective navigation of Unmanned\nAerial Vehicle (UAV) swarms. The technique is based on the flocking and\ncollective navigation behavior observed in natural swarms, such as cattle\nherds, bird flocks, and even large groups of humans. As global and concurrent\ninformation of all swarm members is not available in natural swarms, these\nsystems use local observations to achieve the desired behavior. Similarly,\nPACNav relies only on local observations of relative positions of UAVs, making\nit suitable for large swarms deprived of communication capabilities and\nexternal localization systems. We introduce the novel concepts of path\npersistence and path similarity that allow each swarm member to analyze the\nmotion of other members in order to determine its own future motion. PACNav is\nbased on two main principles: (1) UAVs with little variation in motion\ndirection have high path persistence, and are considered by other UAVs to be\nreliable leaders; (2) groups of UAVs that move in a similar direction have high\npath similarity, and such groups are assumed to contain a reliable leader. The\nproposed approach also embeds a reactive collision avoidance mechanism to avoid\ncollisions with swarm members and environmental obstacles. This collision\navoidance ensures safety while reducing deviations from the assigned path.\nAlong with several simulated experiments, we present a real-world experiment in\na natural forest, showcasing the validity and effectiveness of the proposed\ncollective navigation approach in challenging environments. The source code is\nreleased as open-source, making it possible to replicate the obtained results\nand facilitate the continuation of research by the community.\n",
        "published": "2023",
        "authors": [
            "Afzal Ahmad",
            "Daniel Bonilla Licea",
            "Giuseppe Silano",
            "Tomas Baca",
            "Martin Saska"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2302.06803v1",
        "title": "Bringing Diversity to Autonomous Vehicles: An Interpretable\n  Multi-vehicle Decision-making and Planning Framework",
        "abstract": "  With the development of autonomous driving, it is becoming increasingly\ncommon for autonomous vehicles (AVs) and human-driven vehicles (HVs) to travel\non the same roads. Existing single-vehicle planning algorithms on board\nstruggle to handle sophisticated social interactions in the real world.\nDecisions made by these methods are difficult to understand for humans, raising\nthe risk of crashes and making them unlikely to be applied in practice.\nMoreover, vehicle flows produced by open-source traffic simulators suffer from\nbeing overly conservative and lacking behavioral diversity. We propose a\nhierarchical multi-vehicle decision-making and planning framework with several\nadvantages. The framework jointly makes decisions for all vehicles within the\nflow and reacts promptly to the dynamic environment through a high-frequency\nplanning module. The decision module produces interpretable action sequences\nthat can explicitly communicate self-intent to the surrounding HVs. We also\npresent the cooperation factor and trajectory weight set, bringing diversity to\nautonomous vehicles in traffic at both the social and individual levels. The\nsuperiority of our proposed framework is validated through experiments with\nmultiple scenarios, and the diverse behaviors in the generated vehicle\ntrajectories are demonstrated through closed-loop simulations.\n",
        "published": "2023",
        "authors": [
            "Licheng Wen",
            "Pinlong Cai",
            "Daocheng Fu",
            "Song Mao",
            "Yikang Li"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2302.09250v1",
        "title": "Distributed Planning with Asynchronous Execution with Local Navigation\n  for Multi-agent Pickup and Delivery Problem",
        "abstract": "  We propose a distributed planning method with asynchronous execution for\nmulti-agent pickup and delivery (MAPD) problems for environments with\noccasional delays in agents' activities and flexible endpoints. MAPD is a\ncrucial problem framework with many applications; however, most existing\nstudies assume ideal agent behaviors and environments, such as a fixed speed of\nagents, synchronized movements, and a well-designed environment with many short\ndetours for multiple agents to perform tasks easily. However, such an\nenvironment is often infeasible; for example, the moving speed of agents may be\naffected by weather and floor conditions and is often prone to delays. The\nproposed method can relax some infeasible conditions to apply MAPD in more\nrealistic environments by allowing fluctuated speed in agents' actions and\nflexible working locations (endpoints). Our experiments showed that our method\nenables agents to perform MAPD in such an environment efficiently, compared to\nthe baseline methods. We also analyzed the behaviors of agents using our method\nand discuss the limitations.\n",
        "published": "2023",
        "authors": [
            "Yuki Miyashita",
            "Tomoki Yamauchi",
            "Toshiharu Sugawara"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2302.10817v1",
        "title": "Inferring Implicit Trait Preferences for Task Allocation in\n  Heterogeneous Teams",
        "abstract": "  Task allocation in heterogeneous multi-agent teams often requires reasoning\nabout multi-dimensional agent traits (i.e., capabilities) and the demands\nplaced on them by tasks. However, existing methods tend to ignore the fact that\nnot all traits equally contribute to a given task. Ignoring such inherent\npreferences or relative importance can lead to unintended sub-optimal\nallocations of limited agent resources that do not necessarily contribute to\ntask success. Further, reasoning over a large number of traits can incur a\nhefty computational burden. To alleviate these concerns, we propose an\nalgorithm to infer task-specific trait preferences implicit in expert\ndemonstrations. We leverage the insight that the consistency with which an\nexpert allocates a trait to a task across demonstrations reflects the trait's\nimportance to that task. Inspired by findings in psychology, we account for the\nfact that the inherent diversity of a trait in the dataset influences the\ndataset's informativeness and, thereby, the extent of the inferred preference\nor the lack thereof. Through detailed numerical simulations and evaluations of\na publicly-available soccer dataset (FIFA 20), we demonstrate that we can\nsuccessfully infer implicit trait preferences and that accounting for the\ninferred preferences leads to more computationally efficient and effective task\nallocation, compared to a baseline approach that treats all traits equally.\n",
        "published": "2023",
        "authors": [
            "Vivek Mallampati",
            "Harish Ravichandar"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2302.11033v1",
        "title": "MultiVehicle Simulator (MVSim): lightweight dynamics simulator for\n  multiagents and mobile robotics research",
        "abstract": "  Development of applications related to closed-loop control requires either\ntesting on the field or on a realistic simulator, with the latter being more\nconvenient, inexpensive, safe, and leading to shorter development cycles. To\naddress that need, the present work introduces MVSim, a simulator for multiple\nvehicles or robots capable of running dozens of agents in simple scenarios, or\na handful of them in complex scenarios. MVSim employs realistic\nphysics-grounded friction models for tire-ground interaction, and aims at\naccurate and GPU-accelerated simulation of most common modern sensors employed\nin mobile robotics and autonomous vehicle research, such as depth and RGB\ncameras, or 2D and 3D LiDAR scanners. All depth-related sensors are able to\naccurately measure distances to 3D models provided by the user to define custom\nworld elements. Efficient simulation is achieved by means of focusing on ground\nvehicles, which allows the use of a simplified 2D physics engine for body\ncollisions while solving wheel-ground interaction forces separately. The core\nparts of the system are written in C++ for maximum efficiency, while Python,\nROS 1, and ROS 2 wrappers are also offered for easy integration into user\nsystems. A custom publish/subscribe protocol based on ZeroMQ (ZMQ) is defined\nto allow for multiprocess applications to access or modify a running\nsimulation. This simulator enables and makes easier to do research and\ndevelopment on vehicular dynamics, autonomous navigation algorithms, and\nsimultaneous localization and mapping (SLAM) methods.\n",
        "published": "2023",
        "authors": [
            "José-Luis Blanco-Claraco",
            "Borys Tymchenko",
            "Francisco José Mañas-Alvarez",
            "Fernando Cañadas-Aránega",
            "Ángel López-Gázquez",
            "José Carlos Moreno"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2302.14289v1",
        "title": "DrMaMP: Distributed Real-time Multi-agent Mission Planning in Cluttered\n  Environment",
        "abstract": "  Solving a collision-aware multi-agent mission planning (task allocation and\npath finding) problem is challenging due to the requirement of real-time\ncomputational performance, scalability, and capability of handling\nstatic/dynamic obstacles and tasks in a cluttered environment. This paper\nproposes a distributed real-time (on the order of millisecond) algorithm\nDrMaMP, which partitions the entire unassigned task set into subsets via\napproximation and decomposes the original problem into several single-agent\nmission planning problems. This paper presents experiments with dynamic\nobstacles and tasks and conducts optimality and scalability comparisons with an\nexisting method, where DrMaMP outperforms the existing method in both indices.\nFinally, this paper analyzes the computational burden of DrMaMP which is\nconsistent with the observations from comparisons, and presents the optimality\ngap in small-size problems.\n",
        "published": "2023",
        "authors": [
            "Zehui Lu",
            "Tianyu Zhou",
            "Shaoshuai Mou"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2303.01619v2",
        "title": "Conflict-Based Model Predictive Control for Scalable Multi-Robot Motion\n  Planning",
        "abstract": "  This paper presents a scalable multi-robot motion planning algorithm called\nConflict-Based Model Predictive Control (CB-MPC). Inspired by Conflict-Based\nSearch (CBS), the planner leverages a similar high-level conflict tree to\nefficiently resolve robot-robot conflicts in the continuous space, while\nreasoning about each agent's kinematic and dynamic constraints and actuation\nlimits using MPC as the low-level planner. We show that tracking high-level\nmulti-robot plans with a vanilla MPC controller is insufficient, and results in\nunexpected collisions in tight navigation scenarios. Compared to other\nvariations of multi-robot MPC like joint, prioritized, and distributed, we\ndemonstrate that CB-MPC improves the executability and success rate, allows for\ncloser robot-robot interactions, and reduces the computational cost\nsignificantly without compromising the solution quality across a variety of\nenvironments. Furthermore, we show that CB-MPC combined with a high-level path\nplanner can effectively substitute computationally expensive full-horizon\nmulti-robot kinodynamic planners.\n",
        "published": "2023",
        "authors": [
            "Ardalan Tajbakhsh",
            "Lorenz T. Biegler",
            "Aaron M. Johnson"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2303.02104v1",
        "title": "Proximal Exploration of Venus Volcanism with Teams of Autonomous\n  Buoyancy-Controlled Balloons",
        "abstract": "  Altitude-controlled balloons hold great promise for performing high-priority\nscientific investigations of Venus's atmosphere and geological phenomena,\nincluding tectonic and volcanic activity, as demonstrated by a number of recent\nEarth-based experiments. In this paper, we explore a concept of operations\nwhere multiple autonomous, altitude-controlled balloons monitor explosive\nvolcanic activity on Venus through infrasound microbarometers, and autonomously\nnavigate the uncertain wind field to perform follow-on observations of detected\nevents of interest. We propose a novel autonomous guidance technique for\naltitude-controlled balloons in Venus's uncertain wind field, and show the\napproach can result in an increase of up to 63% in the number of close-up\nobservations of volcanic events compared to passive drifters, and a 16%\nincrease compared to ground-in-the-loop guidance. The results are robust to\nuncertainty in the wind field, and hold across large changes in the frequency\nof explosive volcanic events, sensitivity of the microbarometer detectors, and\nnumbers of aerial platforms.\n",
        "published": "2023",
        "authors": [
            "Federico Rossi",
            "Maira Saboia",
            "Siddharth Krishnamoorthy",
            "Joshua Vander Hook"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2303.03539v2",
        "title": "A Study on Multirobot Quantile Estimation in Natural Environments",
        "abstract": "  Quantiles of a natural phenomena can provide scientists with an important\nunderstanding of different spreads of concentrations. When there are several\navailable robots, it may be advantageous to pool resources in a collaborative\nway to improve performance. A multirobot team can be difficult to practically\nbring together and coordinate. To this end, we present a study across several\naxes of the impact of using multiple robots to estimate quantiles of a\ndistribution of interest using an informative path planning formulation. We\nmeasure quantile estimation accuracy with increasing team size to understand\nwhat benefits result from a multirobot approach in a drone exploration task of\nanalyzing the algae concentration in lakes. We additionally perform an analysis\non several parameters, including the spread of robot initial positions, the\nplanning budget, and inter-robot communication, and find that while using more\nrobots generally results in lower estimation error, this benefit is achieved\nunder certain conditions. We present our findings in the context of real field\nrobotic applications and discuss the implications of the results and\ninteresting directions for future work.\n",
        "published": "2023",
        "authors": [
            "Isabel M. Rayas Fernández",
            "Christopher E. Denniston",
            "Gaurav S. Sukhatme"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2303.04271v1",
        "title": "Minimally Constrained Multi-Robot Coordination with Line-of-sight\n  Connectivity Maintenance",
        "abstract": "  In this paper, we consider a team of mobile robots executing simultaneously\nmultiple behaviors by different subgroups, while maintaining global and\nsubgroup line-of-sight (LOS) network connectivity that minimally constrains the\noriginal multi-robot behaviors. The LOS connectivity between pairwise robots is\npreserved when two robots stay within the limited communication range and their\nLOS remains occlusion-free from static obstacles while moving. By using control\nbarrier functions (CBF) and minimum volume enclosing ellipsoids (MVEE), we\nfirst introduce the LOS connectivity barrier certificate (LOS-CBC) to\ncharacterize the state-dependent admissible control space for pairwise robots,\nfrom which their resulting motion will keep the two robots LOS connected over\ntime. We then propose the Minimum Line-of-Sight Connectivity Constraint\nSpanning Tree (MLCCST) as a step-wise bilevel optimization framework to jointly\noptimize (a) the minimum set of LOS edges to actively maintain, and (b) the\ncontrol revision with respect to a nominal multi-robot controller due to LOS\nconnectivity maintenance. As proved in the theoretical analysis, this allows\nthe robots to improvise the optimal composition of LOS-CBC control constraints\nthat are least constraining around the nominal controllers, and at the same\ntime enforce the global and subgroup LOS connectivity through the resulting\npreserved set of pairwise LOS edges. The framework thus leads to robots staying\nas close to their nominal behaviors, while exhibiting dynamically changing\nLOS-connected network topology that provides the greatest flexibility for the\nexisting multi-robot tasks in real time. We demonstrate the effectiveness of\nour approach through simulations with up to 64 robots.\n",
        "published": "2023",
        "authors": [
            "Yupeng Yang",
            "Yiwei Lyu",
            "Wenhao Luo"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2303.06222v6",
        "title": "Robust MADER: Decentralized Multiagent Trajectory Planner Robust to\n  Communication Delay in Dynamic Environments",
        "abstract": "  Communication delays can be catastrophic for multiagent systems. However,\nmost existing state-of-the-art multiagent trajectory planners assume perfect\ncommunication and therefore lack a strategy to rectify this issue in real-world\nenvironments. To address this challenge, we propose Robust MADER (RMADER), a\ndecentralized, asynchronous multiagent trajectory planner robust to\ncommunication delay. RMADER ensures safety by introducing (1) a Delay Check\nstep, (2) a two-step trajectory publication scheme, and (3) a novel\ntrajectory-storing-and-checking approach. Our primary contributions include:\nproving recursive feasibility for collision-free trajectory generation in\nasynchronous decentralized trajectory-sharing, simulation benchmark studies,\nand hardware experiments with different network topologies and dynamic\nobstacles. We show that RMADER outperforms existing approaches by achieving a\n100% success rate of collision-free trajectory generation, whereas the next\nbest asynchronous decentralized method only achieves 83% success.\n",
        "published": "2023",
        "authors": [
            "Kota Kondo",
            "Reinaldo Figueroa",
            "Juan Rached",
            "Jesus Tordesillas",
            "Parker C. Lusk",
            "Jonathan P. How"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2303.08933v2",
        "title": "Efficient Planning of Multi-Robot Collective Transport using Graph\n  Reinforcement Learning with Higher Order Topological Abstraction",
        "abstract": "  Efficient multi-robot task allocation (MRTA) is fundamental to various\ntime-sensitive applications such as disaster response, warehouse operations,\nand construction. This paper tackles a particular class of these problems that\nwe call MRTA-collective transport or MRTA-CT -- here tasks present varying\nworkloads and deadlines, and robots are subject to flight range, communication\nrange, and payload constraints. For large instances of these problems involving\n100s-1000's of tasks and 10s-100s of robots, traditional non-learning solvers\nare often time-inefficient, and emerging learning-based policies do not scale\nwell to larger-sized problems without costly retraining. To address this gap,\nwe use a recently proposed encoder-decoder graph neural network involving\nCapsule networks and multi-head attention mechanism, and innovatively add\ntopological descriptors (TD) as new features to improve transferability to\nunseen problems of similar and larger size. Persistent homology is used to\nderive the TD, and proximal policy optimization is used to train our\nTD-augmented graph neural network. The resulting policy model compares\nfavorably to state-of-the-art non-learning baselines while being much faster.\nThe benefit of using TD is readily evident when scaling to test problems of\nsize larger than those used in training.\n",
        "published": "2023",
        "authors": [
            "Steve Paul",
            "Wenyuan Li",
            "Brian Smyth",
            "Yuzhou Chen",
            "Yulia Gel",
            "Souma Chowdhury"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2303.09003v1",
        "title": "Integrated Design of Cooperative Area Coverage and Target Tracking with\n  Multi-UAV System",
        "abstract": "  This paper systematically studies the cooperative area coverage and target\ntracking problem of multiple-unmanned aerial vehicles (multi-UAVs). The problem\nis solved by decomposing into three sub-problems: information fusion, task\nassignment, and multi-UAV behavior decision-making. Specifically, in the\ninformation fusion process, we use the maximum consistency protocol to update\nthe joint estimation states of multi-targets (JESMT) and the area detection\ninformation. The area detection information is represented by the equivalent\nvisiting time map (EVTM), which is built based on the detection probability and\nthe actual visiting time of the area. Then, we model the task assignment\nproblem of multi-UAV searching and tracking multi-targets as a network flow\nmodel with upper and lower flow bounds. An algorithm named task assignment\nminimum-cost maximum-flow (TAMM) is proposed. Cooperative behavior\ndecision-making uses Fisher information as the mission reward to obtain the\noptimal tracking action of the UAV. Furthermore, a coverage behavior\ndecision-making algorithm based on the anti-flocking method is designed for\nthose UAVs assigned the coverage task. Finally, a distributed multi-UAV\ncooperative area coverage and target tracking algorithm is designed, which\nintegrates information fusion, task assignment, and behavioral decision-making.\nNumerical and hardware-in-the-loop simulation results show that the proposed\nmethod can achieve persistent area coverage and cooperative target tracking.\n",
        "published": "2023",
        "authors": [
            "Mengge Zhang",
            "Jie Li",
            "Xiangke Wang"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2303.17459v2",
        "title": "coExplore: Combining multiple rankings for multi-robot exploration",
        "abstract": "  Multi-robot exploration is a field which tackles the challenge of exploring a\npreviously unknown environment with a number of robots. This is especially\nrelevant for search and rescue operations where time is essential. Current\nstate of the art approaches are able to explore a given environment with a\nlarge number of robots by assigning them to frontiers. However, this assignment\ngenerally favors large frontiers and hence omits potentially valuable\nmedium-sized frontiers.\n  In this paper we showcase a novel multi-robot exploration algorithm, which\nimproves and adapts the existing approaches. Through the addition of\ninformation gain based ranking we improve the exploration time for closed urban\nenvironments while maintaining similar exploration performance compared to the\nstate-of-the-art for open environments. Accompanying this paper, we further\npublish our research code in order to lower the barrier to entry for further\nmulti-robot exploration research. We evaluate the performance in three\nsimulated scenarios, two urban and one open scenario, where our algorithm\noutperforms the state of the art by 5% overall.\n",
        "published": "2023",
        "authors": [
            "Ingo Scheler",
            "Robin Dietrich"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2304.01386v2",
        "title": "Attrition-Aware Adaptation for Multi-Agent Patrolling",
        "abstract": "  Multi-agent patrolling is a key problem in a variety of domains such as\nintrusion detection, area surveillance, and policing which involves repeated\nvisits by a group of agents to specified points in an environment. While the\nproblem is well-studied, most works do not provide performance guarantees and\neither do not consider agent attrition or impose significant communication\nrequirements to enable adaptation. In this work, we present the Adaptive\nHeuristic-based Patrolling Algorithm, which is capable of adaptation to agent\nloss using minimal communication by taking advantage of Voronoi partitioning,\nand which meets guaranteed performance bounds. Additionally, we provide new\ncentralized and distributed mathematical programming formulations of the\npatrolling problem, analyze the properties of Voronoi partitioning, and\nfinally, show the value of our adaptive heuristic algorithm by comparison with\nvarious benchmark algorithms using a realistic simulation environment based on\nthe Robot Operating System (ROS) 2.\n",
        "published": "2023",
        "authors": [
            "Anthony Goeckner",
            "Xinliang Li",
            "Ermin Wei",
            "Qi Zhu"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2304.02418v2",
        "title": "SA-reCBS: Multi-robot task assignment with integrated reactive path\n  generation",
        "abstract": "  In this paper, we study the multi-robot task assignment and path-finding\nproblem (MRTAPF), where a number of agents are required to visit all given goal\nlocations while avoiding collisions with each other. We propose a novel\ntwo-layer algorithm SA-reCBS that cascades the simulated annealing algorithm\nand conflict-based search to solve this problem. Compared to other approaches\nin the field of MRTAPF, the advantage of SA-reCBS is that without requiring a\npre-bundle of goals to groups with the same number of groups as the number of\nrobots, it enables a part of agents needed to visit all goals in collision-free\npaths. We test the algorithm in various simulation instances and compare it\nwith state-of-the-art algorithms. The result shows that SA-reCBS has a better\nperformance with a higher success rate, less computational time, and better\nobjective values.\n",
        "published": "2023",
        "authors": [
            "Yifan Bai",
            "Christoforos Kanellakis",
            "George Nikolakopoulos"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2304.06873v2",
        "title": "Reducing Network Load via Message Utility Estimation for Decentralized\n  Multirobot Teams",
        "abstract": "  We are motivated by quantile estimation of algae concentration in lakes and\nhow decentralized multirobot teams can effectively tackle this problem. We find\nthat multirobot teams improve performance in this task over single robots, and\ncommunication-enabled teams further over communication-deprived teams; however,\nreal robots are resource-constrained, and communication networks cannot support\narbitrary message loads, making naive, constant information-sharing but also\ncomplex modeling and decision-making infeasible. With this in mind, we propose\nonline, locally computable metrics for determining the utility of transmitting\na given message to the other team members and a decision-theoretic approach\nthat chooses to transmit only the most useful messages, using a decentralized\nand independent framework for maintaining beliefs of other teammates. We\nvalidate our approach in simulation on a real-world aquatic dataset, and we\nshow that restricting communication via a utility estimation method based on\nthe expected impact of a message on future teammate behavior results in a 42%\ndecrease in network load while simultaneously decreasing quantile estimation\nerror by 1.84%.\n",
        "published": "2023",
        "authors": [
            "Isabel M. Rayas Fernández",
            "Christopher E. Denniston",
            "Gaurav S. Sukhatme"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2304.09462v2",
        "title": "Decentralized Multi-Agent Planning for Multirotors: a Fully Online and\n  Communication Latency Robust Approach",
        "abstract": "  There are many industrial, commercial and social applications for multi-agent\nplanning for multirotors such as autonomous agriculture, infrastructure\ninspection and search and rescue. Thus, improving on the state-of-the-art of\nmulti-agent planning to make it a viable real-world solution is of great\nbenefit. In this work, we propose a new method for multi-agent planning in a\nstatic environment that improves our previous work by making it fully online as\nwell as robust to communication latency. The proposed framework generates a\nglobal path and a Safe Corridor to avoid static obstacles in an online fashion\n(generated offline in our previous work). It then generates a time-aware Safe\nCorridor which takes into account the future positions of other agents to avoid\nintra-agent collisions. The time-aware Safe Corridor is given with a local\nreference trajectory to an MIQP (Mixed-Integer Quadratic Problem)/MPC (Model\nPredictive Control) solver that outputs a safe and optimal trajectory. The\nplanning frequency is adapted to account for communication delays. The proposed\nmethod is fully online, real-time, decentralized, and synchronous. It is\ncompared to 3 recent state-of-the-art methods in simulations. It outperforms\nall methods in robustness and safety as well as flight time. It also\noutperforms the only other state-of-the-art latency robust method in\ncomputation time.\n",
        "published": "2023",
        "authors": [
            "Charbel Toumieh"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2304.11204v1",
        "title": "Emergent Cooperative Behavior in Distributed Target Tracking with\n  Unknown Occlusions",
        "abstract": "  Tracking multiple moving objects of interest (OOI) with multiple robot\nsystems (MRS) has been addressed by active sensing that maintains a shared\nbelief of OOIs and plans the motion of robots to maximize the information\nquality. Mobility of robots enables the behavior of pursuing better visibility,\nwhich is constrained by sensor field of view (FoV) and occlusion objects. We\nfirst extend prior work to detect, maintain and share occlusion information\nexplicitly, allowing us to generate occlusion-aware planning even if a priori\nsemantic occlusion information is unavailable. The efficacy of active sensing\napproaches is often evaluated according to estimation error and information\ngain metrics. However, these metrics do not directly explain the level of\ncooperative behavior engendered by the active sensing algorithms. Next, we\nextract different emergent cooperative behaviors that stem from the same\nunderlying algorithms but manifest differently under differing scenarios. In\nparticular, we highlight and demonstrate three emergent behavior patterns in\nactive sensing MRS: (i) Change of tracking responsibility between agents when\ntracking trajectories with divergent directions or due to a re-allocation of\nthe resource among heterogeneous agents; (ii) Awareness of occlusions to a\ntrajectory and temporal leave-and-return of the sensing agent; (iii) Sharing of\nlocal occlusion objects in MRS that subsequently improves the awareness of\nocclusion.\n",
        "published": "2023",
        "authors": [
            "Tianqi Li",
            "Lucas W. Krakow",
            "Swaminathan Gopalswamy"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2304.12033v2",
        "title": "A Spatial Calibration Method for Robust Cooperative Perception",
        "abstract": "  Cooperative perception is a promising technique for enhancing the perception\ncapabilities of automated vehicles through vehicle-to-everything (V2X)\ncooperation, provided that accurate relative pose transforms are available.\nNevertheless, obtaining precise positioning information often entails high\ncosts associated with navigation systems. Moreover, signal drift resulting from\nfactors such as occlusion and multipath effects can compromise the stability of\nthe positioning information. Hence, a low-cost and robust method is required to\ncalibrate relative pose information for multi-agent cooperative perception. In\nthis paper, we propose a simple but effective inter-agent object association\napproach (CBM), which constructs contexts using the detected bounding boxes,\nfollowed by local context matching and global consensus maximization. Based on\nthe matched correspondences, optimal relative pose transform is estimated,\nfollowed by cooperative perception fusion. Extensive experimental studies are\nconducted on both the simulated and real-world datasets, high object\nassociation precision and decimeter level relative pose calibration accuracy is\nachieved among the cooperating agents even with larger inter-agent localization\nerrors. Furthermore, the proposed approach outperforms the state-of-the-art\nmethods in terms of object association and relative pose estimation accuracy,\nas well as the robustness of cooperative perception against the pose errors of\nthe connected agents. The code will be available at\nhttps://github.com/zhyingS/CBM.\n",
        "published": "2023",
        "authors": [
            "Zhiying Song",
            "Tenghui Xie",
            "Hailiang Zhang",
            "Fuxi Wen",
            "Jun Li"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2305.01869v1",
        "title": "Decentralised Active Perception in Continuous Action Spaces for the\n  Coordinated Escort Problem",
        "abstract": "  We consider the coordinated escort problem, where a decentralised team of\nsupporting robots implicitly assist the mission of higher-value principal\nrobots. The defining challenge is how to evaluate the effect of supporting\nrobots' actions on the principal robots' mission. To capture this effect, we\ndefine two novel auxiliary reward functions for supporting robots called\nsatisfaction improvement and satisfaction entropy, which computes the\nimprovement in probability of mission success, or the uncertainty thereof.\nGiven these reward functions, we coordinate the entire team of principal and\nsupporting robots using decentralised cross entropy method (Dec-CEM), a new\nextension of CEM to multi-agent systems based on the product distribution\napproximation. In a simulated object avoidance scenario, our planning framework\ndemonstrates up to two-fold improvement in task satisfaction against\nconventional decoupled information gathering.The significance of our results is\nto introduce a new family of algorithmic problems that will enable important\nnew practical applications of heterogeneous multi-robot systems.\n",
        "published": "2023",
        "authors": [
            "Rhett Hull",
            "Ki Myung Brian Lee",
            "Jennifer Wakulicz",
            "Chanyeol Yoo",
            "James McMahon",
            "Bryan Clarke",
            "Stuart Anstee",
            "Jijoong Kim",
            "Robert Fitch"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2305.04352v1",
        "title": "We Need to Talk: Identifying and Overcoming Communication-Critical\n  Scenarios for Self-Driving",
        "abstract": "  In this work, we consider the task of collision-free trajectory planning for\nconnected self-driving vehicles. We specifically consider\ncommunication-critical situations--situations where single-agent systems have\nblindspots that require multi-agent collaboration. To identify such situations,\nwe propose a method which (1) simulates multi-agent perspectives from real\nself-driving datasets, (2) finds scenarios that are challenging for isolated\nagents, and (3) augments scenarios with adversarial obstructions. To overcome\nthese challenges, we propose to extend costmap-based trajectory evaluation to a\ndistributed multi-agent setting. We demonstrate that our bandwidth-efficient,\nuncertainty-aware method reduces collision rates by up to 62.5% compared to\nsingle agent baselines.\n",
        "published": "2023",
        "authors": [
            "Nathaniel Moore Glaser",
            "Zsolt Kira"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2305.04511v1",
        "title": "Deadlock-Free Collision Avoidance for Nonholonomic Robots",
        "abstract": "  We present a method for deadlock-free and collision-free navigation in a\nmulti-robot system with nonholonomic robots. The problem is solved by quadratic\nprogramming and is applicable to most wheeled mobile robots with linear\nkinematic constraints. We introduce masked velocity and Masked Cooperative\nCollision Avoidance (MCCA) algorithm to encourage a fully decentralized\ndeadlock avoidance behavior. To verify the method, we provide a detailed\nimplementation and introduce heading oscillation avoidance for\ndifferential-drive robots. To the best of our knowledge, it is the first method\nto give very promising and stable results for deadlock avoidance even in\nsituations with a large number of robots and narrow passages.\n",
        "published": "2023",
        "authors": [
            "Ruochen Zheng",
            "Siyu Li"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2305.06929v1",
        "title": "Path-Based Sensors: Will the Knowledge of Correlation in Random\n  Variables Accelerate Information Gathering?",
        "abstract": "  Effective communication is crucial for deploying robots in mission-specific\ntasks, but inadequate or unreliable communication can greatly reduce mission\nefficacy, for example in search and rescue missions where communication-denied\nconditions may occur. In such missions, robots are deployed to locate targets,\nsuch as human survivors, but they might get trapped at hazardous locations,\nsuch as in a trapping pit or by debris. Thus, the information the robot\ncollected is lost owing to the lack of communication. In our prior work, we\ndeveloped the notion of a path-based sensor. A path-based sensor detects\nwhether or not an event has occurred along a particular path, but it does not\nprovide the exact location of the event. Such path-based sensor observations\nare well-suited to communication-denied environments, and various studies have\nexplored methods to improve information gathering in such settings. In some\nmissions it is typical for target elements to be in close proximity to\nhazardous factors that hinder the information-gathering process. In this study,\nwe examine a similar scenario and conduct experiments to determine if\nadditional knowledge about the correlation between hazards and targets improves\nthe efficiency of information gathering. To incorporate this knowledge, we\nutilize a Bayesian network representation of domain knowledge and develop an\nalgorithm based on this representation. Our empirical investigation reveals\nthat such additional information on correlation is beneficial only in\nenvironments with moderate hazard lethality, suggesting that while knowledge of\ncorrelation helps, further research and development is necessary for optimal\noutcomes.\n",
        "published": "2023",
        "authors": [
            "Alkesh K. Srivastava",
            "George P. Kontoudis",
            "Donald Sofge",
            "Michael Otte"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2305.11465v1",
        "title": "Counterfactual Fairness Filter for Fair-Delay Multi-Robot Navigation",
        "abstract": "  Multi-robot navigation is the task of finding trajectories for a team of\nrobotic agents to reach their destinations as quickly as possible without\ncollisions. In this work, we introduce a new problem: fair-delay multi-robot\nnavigation, which aims not only to enable such efficient, safe travels but also\nto equalize the travel delays among agents in terms of actual trajectories as\ncompared to the best possible trajectories. The learning of a navigation policy\nto achieve this objective requires resolving a nontrivial credit assignment\nproblem with robotic agents having continuous action spaces. Hence, we\ndeveloped a new algorithm called Navigation with Counterfactual Fairness Filter\n(NCF2). With NCF2, each agent performs counterfactual inference on whether it\ncan advance toward its goal or should stay still to let other agents go. Doing\nso allows us to effectively address the aforementioned credit assignment\nproblem and improve fairness regarding travel delays while maintaining high\nefficiency and safety. Our extensive experimental results in several\nchallenging multi-robot navigation environments demonstrate the greater\neffectiveness of NCF2 as compared to state-of-the-art fairness-aware\nmulti-agent reinforcement learning methods. Our demo videos and code are\navailable on the project webpage: https://omron-sinicx.github.io/ncf2/\n",
        "published": "2023",
        "authors": [
            "Hikaru Asano",
            "Ryo Yonetani",
            "Mai Nishimura",
            "Tadashi Kozuno"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2305.15288v1",
        "title": "Concurrent Constrained Optimization of Unknown Rewards for Multi-Robot\n  Task Allocation",
        "abstract": "  Task allocation can enable effective coordination of multi-robot teams to\naccomplish tasks that are intractable for individual robots. However, existing\napproaches to task allocation often assume that task requirements or reward\nfunctions are known and explicitly specified by the user. In this work, we\nconsider the challenge of forming effective coalitions for a given\nheterogeneous multi-robot team when task reward functions are unknown. To this\nend, we first formulate a new class of problems, dubbed COncurrent Constrained\nOnline optimization of Allocation (COCOA). The COCOA problem requires online\noptimization of coalitions such that the unknown rewards of all the tasks are\nsimultaneously maximized using a given multi-robot team with constrained\nresources. To address the COCOA problem, we introduce an online optimization\nalgorithm, named Concurrent Multi-Task Adaptive Bandits (CMTAB), that leverages\nand builds upon continuum-armed bandit algorithms. Experiments involving\ndetailed numerical simulations and a simulated emergency response task reveal\nthat CMTAB can effectively trade-off exploration and exploitation to\nsimultaneously and efficiently optimize the unknown task rewards while\nrespecting the team's resource constraints.\n",
        "published": "2023",
        "authors": [
            "Sukriti Singh",
            "Anusha Srikanthan",
            "Vivek Mallampati",
            "Harish Ravichandar"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2305.16063v1",
        "title": "Individuality in Swarm Robots with the Case Study of Kilobots: Noise,\n  Bug, or Feature?",
        "abstract": "  Inter-individual differences are studied in natural systems, such as fish,\nbees, and humans, as they contribute to the complexity of both individual and\ncollective behaviors. However, individuality in artificial systems, such as\nrobotic swarms, is undervalued or even overlooked. Agent-specific deviations\nfrom the norm in swarm robotics are usually understood as mere noise that can\nbe minimized, for example, by calibration. We observe that robots have\nconsistent deviations and argue that awareness and knowledge of these can be\nexploited to serve a task. We measure heterogeneity in robot swarms caused by\nindividual differences in how robots act, sense, and oscillate. Our use case is\nKilobots and we provide example behaviors where the performance of robots\nvaries depending on individual differences. We show a non-intuitive example of\nphototaxis with Kilobots where the non-calibrated Kilobots show better\nperformance than the calibrated supposedly ``ideal\" one. We measure the\ninter-individual variations for heterogeneity in sensing and oscillation, too.\nWe briefly discuss how these variations can enhance the complexity of\ncollective behaviors. We suggest that by recognizing and exploring this new\nperspective on individuality, and hence diversity, in robotic swarms, we can\ngain a deeper understanding of these systems and potentially unlock new\npossibilities for their design and implementation of applications.\n",
        "published": "2023",
        "authors": [
            "Mohsen Raoufi",
            "Pawel Romanczuk",
            "Heiko Hamann"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2305.16126v1",
        "title": "Automatic off-line design of robot swarms: exploring the transferability\n  of control software and design methods across different platforms",
        "abstract": "  Automatic off-line design is an attractive approach to implementing robot\nswarms. In this approach, a designer specifies a mission for the swarm, and an\noptimization process generates suitable control software for the individual\nrobots through computer-based simulations. Most relevant literature has focused\non effectively transferring control software from simulation to physical\nrobots. For the first time, we investigate (i) whether control software\ngenerated via automatic design is transferable across robot platforms and (ii)\nwhether the design methods that generate such control software are themselves\ntransferable. We experiment with two ground mobile platforms with equivalent\ncapabilities. Our measure of transferability is based on the performance drop\nobserved when control software and/or design methods are ported from one\nplatform to another. Results indicate that while the control software generated\nvia automatic design is transferable in some cases, better performance can be\nachieved when a transferable method is directly applied to the new platform.\n",
        "published": "2023",
        "authors": [
            "Miquel Kegeleirs",
            "David Garzón Ramos",
            "Lorenzo Garattoni",
            "Gianpiero Francesca",
            "Mauro Birattari"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2305.18119v1",
        "title": "Emergent Incident Response for Unmanned Warehouses with Multi-agent\n  Systems*",
        "abstract": "  Unmanned warehouses are an important part of logistics, and improving their\noperational efficiency can effectively enhance service efficiency. However, due\nto the complexity of unmanned warehouse systems and their susceptibility to\nerrors, incidents may occur during their operation, most often in inbound and\noutbound operations, which can decrease operational efficiency. Hence it is\ncrucial to to improve the response to such incidents. This paper proposes a\ncollaborative optimization algorithm for emergent incident response based on\nSafe-MADDPG. To meet safety requirements during emergent incident response, we\ninvestigated the intrinsic hidden relationships between various factors. By\nobtaining constraint information of agents during the emergent incident\nresponse process and of the dynamic environment of unmanned warehouses on\nagents, the algorithm reduces safety risks and avoids the occurrence of chain\naccidents; this enables an unmanned system to complete emergent incident\nresponse tasks and achieve its optimization objectives: (1) minimizing the\nlosses caused by emergent incidents; and (2) maximizing the operational\nefficiency of inbound and outbound operations during the response process. A\nseries of experiments conducted in a simulated unmanned warehouse scenario\ndemonstrate the effectiveness of the proposed method.\n",
        "published": "2023",
        "authors": [
            "Yibo Guo",
            "Mingxin Li",
            "Jingting Zong",
            "Mingliang Xu"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2306.04083v1",
        "title": "Coverage Path Planning with Budget Constraints for Multiple Unmanned\n  Ground Vehicles",
        "abstract": "  This paper proposes a state-machine model for a multi-modal, multi-robot\nenvironmental sensing algorithm. This multi-modal algorithm integrates two\ndifferent exploration algorithms: (1) coverage path planning using variable\nformations and (2) collaborative active sensing using multi-robot swarms. The\nstate machine provides the logic for when to switch between these different\nsensing algorithms. We evaluate the performance of the proposed approach on a\ngas source localisation and mapping task. We use hardware-in-the-loop\nexperiments and real-time experiments with a radio source simulating a real gas\nfield. We compare the proposed approach with a single-mode, state-of-the-art\ncollaborative active sensing approach. Our results indicate that our\nmulti-modal switching approach can converge more rapidly than single-mode\nactive sensing.\n",
        "published": "2023",
        "authors": [
            "Vu Phi Tran",
            "Asanka Perera",
            "Matthew A. Garratt",
            "Kathryn Kasmarik",
            "Sreenatha Anavatti"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2306.06455v1",
        "title": "Scalable Rail Planning and Replanning with Soft Deadlines",
        "abstract": "  The Flatland Challenge, which was first held in 2019 and reported in NeurIPS\n2020, is designed to answer the question: How to efficiently manage dense\ntraffic on complex rail networks? Considering the significance of punctuality\nin real-world railway network operation and the fact that fast passenger trains\nshare the network with slow freight trains, Flatland version 3 introduces\ntrains with different speeds and scheduling time windows. This paper introduces\nthe Flatland 3 problem definitions and extends an award-winning MAPF-based\nsoftware, which won the NeurIPS 2020 competition, to efficiently solve Flatland\n3 problems. The resulting system won the Flatland 3 competition. We designed a\nnew priority ordering for initial planning, a new neighbourhood selection\nstrategy for efficient solution quality improvement with Multi-Agent Path\nFinding via Large Neighborhood Search(MAPF-LNS), and use MAPF-LNS for partially\nreplanning the trains influenced by malfunction.\n",
        "published": "2023",
        "authors": [
            "Zhe Chen",
            "Jiaoyang Li",
            "Daniel Harabor",
            "Peter J. Stuckey"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2306.07385v1",
        "title": "Range Limited Coverage Control using Air-Ground Multi-Robot Teams",
        "abstract": "  In this paper, we investigate how heterogeneous multi-robot systems with\ndifferent sensing capabilities can observe a domain with an apriori unknown\ndensity function. Common coverage control techniques are targeted towards\nhomogeneous teams of robots and do not consider what happens when the sensing\ncapabilities of the robots are vastly different. This work proposes an\nextension to Lloyd's algorithm that fuses coverage information from\nheterogeneous robots with differing sensing capabilities to effectively observe\na domain. Namely, we study a bimodal team of robots consisting of aerial and\nground agents. In our problem formulation we use aerial robots with coarse\ndomain sensors to approximate the number of ground robots needed within their\nsensing region to effectively cover it. This information is relayed to ground\nrobots, who perform an extension to the Lloyd's algorithm that balances a\nlocally focused coverage controller with a globally focused distribution\ncontroller. The stability of the Lloyd's algorithm extension is proven and its\nperformance is evaluated through simulation and experiments using the\nRobotarium, a remotely-accessible, multi-robot testbed.\n",
        "published": "2023",
        "authors": [
            "Max Rudolph",
            "Sean Wilson",
            "Magnus Egerstedt"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2306.12331v1",
        "title": "Decentralized Aerial Transportation and Manipulation of a Cable-Slung\n  Payload With Swarm of Agents",
        "abstract": "  With the advent of Unmanned Aerial Vehicles (UAV) and Micro Aerial Vehicles\n(MAV) in commercial sectors, their application for transporting and\nmanipulating payloads has attracted many research work. A swarm of agents,\ncooperatively working to transport and manipulate a payload can overcome the\nphysical limitations of a single agent, adding redundancy and tolerance against\nfailures. In this paper, the dynamics of a swarm connected to a payload via\nflexible cables are modeled, and a decentralized control is designed using\nArtificial Potential Field (APF). The swarm is able to transport the payload\nthrough an unknown environment to a goal position while avoiding obstacles from\nthe local information received from the onboard sensors. The key contributions\nare (a) the cables are modelled more accurately using lumped mass model instead\nof geometric constraints, (b) a decentralized swarm control is designed using\npotential field approach to ensure hover stability of system without payload\nstate information, (c) the manipulation of payload elevation and azimuth angles\nare controlled by APF, and (d) the trajectory of the payload for transportation\nis governed by potential fields generated by goal point and obstacles. The\nefficacy of the method proposed in this work are evaluated through numerical\nsimulations under the influence of external disturbances and failure of agents.\n",
        "published": "2023",
        "authors": [
            "Aniket Sharma",
            "Nandan K Sinha"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2306.12629v1",
        "title": "Swarm of One: Bottom-up Emergence of Stable Robot Bodies from Identical\n  Cells",
        "abstract": "  Unlike most human-engineered systems, biological systems are emergent from\nlow-level interactions, allowing much broader diversity and superior adaptation\nto the complex environments. Inspired by the process of morphogenesis in\nnature, a bottom-up design approach for robot morphology is proposed to treat a\nrobot's body as an emergent response to underlying processes rather than a\npredefined shape. This paper presents Loopy, a \"Swarm-of-One\" polymorphic robot\ntestbed that can be viewed simultaneously as a robotic swarm and a single\nrobot. Loopy's shape is determined jointly by self-organization and\nmorphological computing using physically linked homogeneous cells. Experimental\nresults show that Loopy can form symmetric shapes consisting of lobes. Using\nthe the same set of parameters, even small amounts of initial noise can change\nthe number of lobes formed. However, once in a stable configuration, Loopy has\nan \"inertia\" to transfiguring in response to dynamic parameters. By making the\nconnections among self-organization, morphological computing, and robot design,\nthis paper lays the foundation for more adaptable robot designs in the future.\n",
        "published": "2023",
        "authors": [
            "Trevor Smith",
            "R. Michael Butts",
            "Nathan Adkins",
            "Yu Gu"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2307.00500v2",
        "title": "CQLite: Communication-Efficient Multi-Robot Exploration Using\n  Coverage-biased Distributed Q-Learning",
        "abstract": "  Frontier exploration and reinforcement learning have historically been used\nto solve the problem of enabling many mobile robots to autonomously and\ncooperatively explore complex surroundings. These methods need to keep an\ninternal global map for navigation, but they do not take into consideration the\nhigh costs of communication and information sharing between robots. This study\noffers CQLite, a novel distributed Q-learning technique designed to minimize\ndata communication overhead between robots while achieving rapid convergence\nand thorough coverage in multi-robot exploration. The proposed CQLite method\nuses ad hoc map merging, and selectively shares updated Q-values at recently\nidentified frontiers to significantly reduce communication costs. The\ntheoretical analysis of CQLite's convergence and efficiency, together with\nextensive numerical verification on simulated indoor maps utilizing several\nrobots, demonstrates the method's novelty. With over 2x reductions in\ncomputation and communication alongside improved mapping performance, CQLite\noutperformed cutting-edge multi-robot exploration techniques like Rapidly\nExploring Random Trees and Deep Reinforcement Learning. Related codes are\nopen-sourced at \\url{https://github.com/herolab-uga/cqlite}.\n",
        "published": "2023",
        "authors": [
            "Ehsan Latif",
            "Ramviyas Parasuraman"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2307.03103v1",
        "title": "Role Engine Implementation for a Continuous and Collaborative\n  Multi-Robot System",
        "abstract": "  In situations involving teams of diverse robots, assigning appropriate roles\nto each robot and evaluating their performance is crucial. These roles define\nthe specific characteristics of a robot within a given context. The stream\nactions exhibited by a robot based on its assigned role are referred to as the\nprocess role. Our research addresses the depiction of process roles using a\nmultivariate probabilistic function. The main aim of this study is to develop a\nrole engine for collaborative multi-robot systems and optimize the behavior of\nthe robots. The role engine is designed to assign suitable roles to each robot,\ngenerate approximately optimal process roles, update them on time, and identify\ninstances of robot malfunction or trigger replanning when necessary. The\nenvironment considered is dynamic, involving obstacles and other agents. The\nrole engine operates hybrid, with central initiation and decentralized action,\nand assigns unlabeled roles to agents. We employ the Gaussian Process (GP)\ninference method to optimize process roles based on local constraints and\nconstraints related to other agents. Furthermore, we propose an innovative\napproach that utilizes the environment's skeleton to address initialization and\nfeasibility evaluation challenges. We successfully demonstrated the proposed\napproach's feasibility, and efficiency through simulation studies and\nreal-world experiments involving diverse mobile robots.\n",
        "published": "2023",
        "authors": [
            "Behzad Akbari",
            "Zikai Wang",
            "Haibin Zhu",
            "Lucas Wan",
            "Ryan Adderson",
            "Ya-Jun Pan"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2307.03891v4",
        "title": "MARBLER: An Open Platform for Standardized Evaluation of Multi-Robot\n  Reinforcement Learning Algorithms",
        "abstract": "  Multi-Agent Reinforcement Learning (MARL) has enjoyed significant recent\nprogress thanks, in part, to the integration of deep learning techniques for\nmodeling interactions in complex environments. This is naturally starting to\nbenefit multi-robot systems (MRS) in the form of multi-robot RL (MRRL).\nHowever, existing infrastructure to train and evaluate policies predominantly\nfocus on the challenges of coordinating virtual agents, and ignore\ncharacteristics important to robotic systems. Few platforms support realistic\nrobot dynamics, and fewer still can evaluate Sim2Real performance of learned\nbehavior. To address these issues, we contribute MARBLER: Multi-Agent RL\nBenchmark and Learning Environment for the Robotarium. MARBLER offers a robust\nand comprehensive evaluation platform for MRRL by marrying Georgia Tech's\nRobotarium (which enables rapid deployment on physical MRS) and OpenAI's Gym\ninterface (which facilitates standardized use of modern learning algorithms).\nMARBLER offers a highly controllable environment with realistic dynamics,\nincluding barrier certificate-based obstacle avoidance. It allows anyone across\nthe world to train and deploy MRRL algorithms on a physical testbed with\nreproducibility. Further, we introduce five novel scenarios inspired by common\nchallenges in MRS and provide support for new custom scenarios. Finally, we use\nMARBLER to evaluate popular MARL algorithms and provide insights into their\nsuitability for MRRL. In summary, MARBLER can be a valuable tool to the MRS\nresearch community by facilitating comprehensive and standardized evaluation of\nlearning algorithms on realistic simulations and physical hardware. Links to\nour open-source framework and videos of real-world experiments can be found at\nhttps://shubhlohiya.github.io/MARBLER/.\n",
        "published": "2023",
        "authors": [
            "Reza Torbati",
            "Shubham Lohiya",
            "Shivika Singh",
            "Meher Shashwat Nigam",
            "Harish Ravichandar"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2307.04004v1",
        "title": "MAP-NBV: Multi-agent Prediction-guided Next-Best-View Planning for\n  Active 3D Object Reconstruction",
        "abstract": "  We propose MAP-NBV, a prediction-guided active algorithm for 3D\nreconstruction with multi-agent systems. Prediction-based approaches have shown\ngreat improvement in active perception tasks by learning the cues about\nstructures in the environment from data. But these methods primarily focus on\nsingle-agent systems. We design a next-best-view approach that utilizes\ngeometric measures over the predictions and jointly optimizes the information\ngain and control effort for efficient collaborative 3D reconstruction of the\nobject. Our method achieves 22.75% improvement over the prediction-based\nsingle-agent approach and 15.63% improvement over the non-predictive\nmulti-agent approach. We make our code publicly available through our project\nwebsite: http://raaslab.org/projects/MAPNBV/\n",
        "published": "2023",
        "authors": [
            "Harnaik Dhami",
            "Vishnu D. Sharma",
            "Pratap Tokekar"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2307.08568v1",
        "title": "Congestion and Scalability in Robot Swarms: a Study on Collective\n  Decision Making",
        "abstract": "  One of the most important promises of decentralized systems is scalability,\nwhich is often assumed to be present in robot swarm systems without being\ncontested. Simple limitations, such as movement congestion and communication\nconflicts, can drastically affect scalability. In this work, we study the\neffects of congestion in a binary collective decision-making task. We evaluate\nthe impact of two types of congestion (communication and movement) when using\nthree different techniques for the task: Honey Bee inspired, Stigmergy based,\nand Division of Labor. We deploy up to 150 robots in a physics-based simulator\nperforming a sampling mission in an arena with variable levels of robot\ndensity, applying the three techniques. Our results suggest that applying\nDivision of Labor coupled with versioned local communication helps to scale the\nsystem by minimizing congestion.\n",
        "published": "2023",
        "authors": [
            "Karthik Soma",
            "Vivek Shankar Vardharajan",
            "Heiko Hamann",
            "Giovanni Beltrame"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2307.08966v2",
        "title": "Multi-Robot Patrol Algorithm with Distributed Coordination and\n  Consciousness of the Base Station's Situation Awareness",
        "abstract": "  Multi-robot patrolling is the potential application for robotic systems to\nsurvey wide areas efficiently without human burdens and mistakes. However, such\nsystems have few examples of real-world applications due to their lack of human\npredictability. This paper proposes an algorithm: Local Reactive (LR) for\nmulti-robot patrolling to satisfy both needs: (i)patrol efficiently and\n(ii)provide humans with better situation awareness to enhance system\npredictability. Each robot operating according to the proposed algorithm\nselects its patrol target from the local areas around the robot's current\nlocation by two requirements: (i)patrol location with greater need, (ii)report\nits achievements to the base station. The algorithm is distributed and\ncoordinates the robots without centralized control by sharing their patrol\nachievements and degree of need to report to the base station. The proposed\nalgorithm performed better than existing algorithms in both patrolling and the\nbase station's situation awareness.\n",
        "published": "2023",
        "authors": [
            "Kazuho Kobayashi",
            "Seiya Ueno",
            "Takehiro Higuchi"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2307.10614v1",
        "title": "GPRL: Gaussian Processes-Based Relative Localization for Multi-Robot\n  Systems",
        "abstract": "  Relative localization is crucial for multi-robot systems to perform\ncooperative tasks, especially in GPS-denied environments. Current techniques\nfor multi-robot relative localization rely on expensive or short-range sensors\nsuch as cameras and LIDARs. As a result, these algorithms face challenges such\nas high computational complexity, dependencies on well-structured environments,\netc. To overcome these limitations, we propose a new distributed approach to\nperform relative localization using a Gaussian Processes map of the Radio\nSignal Strength Indicator (RSSI) values from a single wireless Access Point\n(AP) to which the robots are connected. Our approach, Gaussian Processes-based\nRelative Localization (GPRL), combines two pillars. First, the robots locate\nthe AP w.r.t. their local reference frames using novel hierarchical inferencing\nthat significantly reduces computational complexity. Secondly, the robots\nobtain relative positions of neighbor robots with an AP-oriented vector\ntransformation. The approach readily applies to resource-constrained devices\nand relies only on the ubiquitously-available RSSI measurement. We extensively\nvalidate the performance of the two pillars of the proposed GRPL in Robotarium\nsimulations. We also demonstrate the applicability of GPRL through a\nmulti-robot rendezvous task with a team of three real-world robots. The results\ndemonstrate that GPRL outperformed state-of-the-art approaches regarding\naccuracy, computation, and real-time performance.\n",
        "published": "2023",
        "authors": [
            "Ehsan Latif",
            "Ramviyas Parasuraman"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2307.11252v2",
        "title": "Introducing Delays in Multi-Agent Path Finding",
        "abstract": "  We consider a Multi-Agent Path Finding (MAPF) setting where agents have been\nassigned a plan, but during its execution some agents are delayed. Instead of\nreplanning from scratch when such a delay occurs, we propose delay\nintroduction, whereby we delay some additional agents so that the remainder of\nthe plan can be executed safely. We show that the corresponding decision\nproblem is NP-Complete in general. However, in practice we can find optimal\ndelay-introductions using CBS for very large numbers of agents, and both\nplanning time and the resulting length of the plan are comparable, and\nsometimes outperform, the state-of-the-art heuristics for replanning.\n",
        "published": "2023",
        "authors": [
            "Justin Kottinger",
            "Shaull Almagor",
            "Oren Salzman",
            "Morteza Lahijanian"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2307.16727v2",
        "title": "Multi Agent Navigation in Unconstrained Environments using a Centralized\n  Attention based Graphical Neural Network Controller",
        "abstract": "  In this work, we propose a learning based neural model that provides both the\nlongitudinal and lateral control commands to simultaneously navigate multiple\nvehicles. The goal is to ensure that each vehicle reaches a desired target\nstate without colliding with any other vehicle or obstacle in an unconstrained\nenvironment. The model utilizes an attention based Graphical Neural Network\nparadigm that takes into consideration the state of all the surrounding\nvehicles to make an informed decision. This allows each vehicle to smoothly\nreach its destination while also evading collision with the other agents. The\ndata and corresponding labels for training such a network is obtained using an\noptimization based procedure. Experimental results demonstrates that our model\nis powerful enough to generalize even to situations with more vehicles than in\nthe training data. Our method also outperforms comparable graphical neural\nnetwork architectures. Project page which includes the code and supplementary\ninformation can be found at https://yininghase.github.io/multi-agent-control/\n",
        "published": "2023",
        "authors": [
            "Yining Ma",
            "Qadeer Khan",
            "Daniel Cremers"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2308.07723v1",
        "title": "Extended Preintegration for Relative State Estimation of Leader-Follower\n  Platform",
        "abstract": "  Relative state estimation using exteroceptive sensors suffers from\nlimitations of the field of view (FOV) and false detection, that the\nproprioceptive sensor (IMU) data are usually engaged to compensate. Recently\nego-motion constraint obtained by Inertial measurement unit (IMU)\npreintegration has been extensively used in simultaneous localization and\nmapping (SLAM) to alleviate the computation burden. This paper introduces an\nextended preintegration incorporating the IMU preintegration of two platforms\nto formulate the motion constraint of relative state. One merit of this\nanalytic constraint is that it can be seamlessly integrated into the unified\ngraph optimization framework to implement the relative state estimation in a\nhigh-performance real-time tracking thread, another point is a full smoother\ndesign with this precise constraint to optimize the 3D coordinate and refine\nthe state for the refinement thread. We compare extensively in simulations the\nproposed algorithms with two existing approaches to confirm our outperformance.\nIn the real virtual reality (VR) application design with the proposed\nestimator, we properly realize the visual tracking of the six degrees of\nfreedom (6DoF) controller suitable for almost all scenarios, including the\nchallenging environment with missing features, light mutation, dynamic scenes,\netc. The demo video is at https://www.youtube.com/watch?v=0idb9Ls2iAM. For the\nbenefit of the community, we make the source code public.\n",
        "published": "2023",
        "authors": [
            "Ruican Xia",
            "Hailong Pei"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2308.08862v1",
        "title": "Nowhere to Go: Benchmarking Multi-robot Collaboration in Target Trapping\n  Environment",
        "abstract": "  Collaboration is one of the most important factors in multi-robot systems.\nConsidering certain real-world applications and to further promote its\ndevelopment, we propose a new benchmark to evaluate multi-robot collaboration\nin Target Trapping Environment (T2E). In T2E, two kinds of robots (called\ncaptor robot and target robot) share the same space. The captors aim to catch\nthe target collaboratively, while the target will try to escape from the trap.\nBoth the trapping and escaping process can use the environment layout to help\nachieve the corresponding objective, which requires high collaboration between\nrobots and the utilization of the environment. For the benchmark, we present\nand evaluate multiple learning-based baselines in T2E, and provide insights\ninto regimes of multi-robot collaboration. We also make our benchmark publicly\navailable and encourage researchers from related robotics disciplines to\npropose, evaluate, and compare their solutions in this benchmark. Our project\nis released at https://github.com/Dr-Xiaogaren/T2E.\n",
        "published": "2023",
        "authors": [
            "Hao Zhang",
            "Jiaming Chen",
            "Jiyu Cheng",
            "Yibin Li",
            "Simon X. Yang",
            "Wei Zhang"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2308.13499v1",
        "title": "MRNAV: Multi-Robot Aware Planning and Control Stack for Collision and\n  Deadlock-free Navigation in Cluttered Environments",
        "abstract": "  Multi-robot collision-free and deadlock-free navigation in cluttered\nenvironments with static and dynamic obstacles is a fundamental problem for\nmany applications. We introduce MRNAV, a framework for planning and control to\neffectively navigate in such environments. Our design utilizes short, medium,\nand long horizon decision making modules with qualitatively different\nproperties, and defines the responsibilities of them. The decision making\nmodules complement each other and provide the effective navigation capability.\nMRNAV is the first hierarchical approach combining these three levels of\ndecision making modules and explicitly defining their responsibilities. We\nimplement our design for simulated multi-quadrotor flight. In our evaluations,\nwe show that all three modules are required for effective navigation in diverse\nsituations. We show the long-term executability of our approach in an eight\nhour long wall time (six hour long simulation time) uninterrupted simulation\nwithout collisions or deadlocks.\n",
        "published": "2023",
        "authors": [
            "Baskın Şenbaşlar",
            "Pilar Luiz",
            "Wolfgang Hönig",
            "Gaurav S. Sukhatme"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2308.14042v2",
        "title": "Multi-agent Coordination Under Temporal Logic Tasks and Team-Wise\n  Intermittent Communication",
        "abstract": "  Multi-agent systems outperform single agent in complex collaborative tasks.\nHowever, in large-scale scenarios, ensuring timely information exchange during\ndecentralized task execution remains a challenge. This work presents an online\ndecentralized coordination scheme for multi-agent systems under complex local\ntasks and intermittent communication constraints. Unlike existing strategies\nthat enforce all-time or intermittent connectivity, our approach allows agents\nto join or leave communication networks at aperiodic intervals, as deemed\noptimal by their online task execution. This scheme concurrently determines\nlocal plans and refines the communication strategy, i.e., where and when to\ncommunicate as a team. A decentralized potential game is modeled among agents,\nfor which a Nash equilibrium is generated iteratively through online local\nsearch. It guarantees local task completion and intermittent communication\nconstraints. Extensive numerical simulations are conducted against several\nstrong baselines.\n",
        "published": "2023",
        "authors": [
            "Junjie Wang",
            "Meng Guo",
            "Zhongkui Li"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2309.00327v1",
        "title": "Implementing BDI Continual Temporal Planning for Robotic Agents",
        "abstract": "  Making autonomous agents effective in real-life applications requires the\nability to decide at run-time and a high degree of adaptability to\nunpredictable and uncontrollable events. Reacting to events is still a\nfundamental ability for an agent, but it has to be boosted up with proactive\nbehaviors that allow the agent to explore alternatives and decide at run-time\nfor optimal solutions. This calls for a continuous planning as part of the\ndeliberation process that makes an agent able to reconsider plans on the base\nof temporal constraints and changes of the environment. Online planning\nliterature offers several approaches used to select the next action on the base\nof a partial exploration of the solution space. In this paper, we propose a BDI\ncontinuous temporal planning framework, where interleave planning and execution\nloop is used to integrate online planning with the BDI control-loop. The\nframework has been implemented with the ROS2 robotic framework and planning\nalgorithms offered by JavaFF.\n",
        "published": "2023",
        "authors": [
            "Alex Zanetti",
            "Devis Dal Moro",
            "Redi Vreto",
            "Marco Robol",
            "Marco Roveri",
            "Paolo Giorgini"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2309.00985v1",
        "title": "Multi-agent Collective Construction using 3D Decomposition",
        "abstract": "  This paper addresses a Multi-Agent Collective Construction (MACC) problem\nthat aims to build a three-dimensional structure comprised of cubic blocks. We\nuse cube-shaped robots that can carry one cubic block at a time, and move\nforward, reverse, left, and right to an adjacent cell of the same height or\nclimb up and down one cube height. To construct structures taller than one\ncube, the robots must build supporting stairs made of blocks and remove the\nstairs once the structure is built. Conventional techniques solve for the\nentire structure at once and quickly become intractable for larger workspaces\nand complex structures, especially in a multi-agent setting. To this end, we\npresent a decomposition algorithm that computes valid substructures based on\nintrinsic structural dependencies. We use Mixed Integer Linear Programming\n(MILP) to solve for each of these substructures and then aggregate the\nsolutions to construct the entire structure. Extensive testing on 200 randomly\ngenerated structures shows an order of magnitude improvement in the solution\ncomputation time compared to an MILP approach without decomposition.\nAdditionally, compared to Reinforcement Learning (RL) based and\nheuristics-based approaches drawn from the literature, our solution indicates\norders of magnitude improvement in the number of pick-up and drop-off actions\nrequired to construct a structure. Furthermore, we leverage the independence\nbetween substructures to detect which sub-structures can be built in parallel.\nWith this parallelization technique, we illustrate a further improvement in the\nnumber of time steps required to complete building the structure. This work is\na step towards applying multi-agent collective construction for real-world\nstructures by significantly reducing solution computation time with a bounded\nincrease in the number of time steps required to build the structure.\n",
        "published": "2023",
        "authors": [
            "Akshaya Kesarimangalam Srinivasan",
            "Shambhavi Singh",
            "Geordan Gutow",
            "Howie Choset",
            "Bhaskar Vundurthy"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2309.01240v1",
        "title": "Decentralized shape formation and force-based interactive formation\n  control in robot swarms",
        "abstract": "  Swarm robotic systems utilize collective behaviour to achieve goals that\nmight be too complex for a lone entity, but become attainable with localized\ncommunication and collective decision making. In this paper, a behaviour-based\ndistributed approach to shape formation is proposed. Flocking into strategic\nformations is observed in migratory birds and fish to avoid predators and also\nfor energy conservation. The formation is maintained throughout long periods\nwithout collapsing and is advantageous for communicating within the flock.\nSimilar behaviour can be deployed in multi-agent systems to enhance\ncoordination within the swarm. Existing methods for formation control are\neither dependent on the size and geometry of the formation or rely on\nmaintaining the formation with a single reference in the swarm (the leader).\nThese methods are not resilient to failure and involve a high degree of\ndeformation upon obstacle encounter before the shape is recovered again. To\nimprove the performance, artificial force-based interaction amongst the\nentities of the swarm to maintain shape integrity while encountering obstacles\nis elucidated.\n",
        "published": "2023",
        "authors": [
            "Akshaya C S",
            "Karthik Soma",
            "Visweswaran B",
            "Aditya Ravichander",
            "Venkata Nagarjun PM"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2309.08896v1",
        "title": "Graph-based Decentralized Task Allocation for Multi-Robot Target\n  Localization",
        "abstract": "  We introduce a new approach to address the task allocation problem in a\nsystem of heterogeneous robots comprising of Unmanned Ground Vehicles (UGVs)\nand Unmanned Aerial Vehicles (UAVs). The proposed model, \\texttt{\\method}, or\n\\textbf{G}raph \\textbf{A}ttention \\textbf{T}ask \\textbf{A}llocato\\textbf{R}\naggregates information from neighbors in the multi-robot system, with the aim\nof achieving joint optimality in the target localization efficiency.Being\ndecentralized, our method is highly robust and adaptable to situations where\ncollaborators may change over time, ensuring the continuity of the mission. We\nalso proposed heterogeneity-aware preprocessing to let all the different types\nof robots collaborate with a uniform model.The experimental results demonstrate\nthe effectiveness and scalability of the proposed approach in a range of\nsimulated scenarios. The model can allocate targets' positions close to the\nexpert algorithm's result, with a median spatial gap less than a unit length.\nThis approach can be used in multi-robot systems deployed in search and rescue\nmissions, environmental monitoring, and disaster response.\n",
        "published": "2023",
        "authors": [
            "Juntong Peng",
            "Hrishikesh Viswanath",
            "Kshitij Tiwari",
            "Aniket Bera"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2309.11057v1",
        "title": "Safe and Robust Multi-Agent Reinforcement Learning for Connected\n  Autonomous Vehicles under State Perturbations",
        "abstract": "  Sensing and communication technologies have enhanced learning-based decision\nmaking methodologies for multi-agent systems such as connected autonomous\nvehicles (CAV). However, most existing safe reinforcement learning based\nmethods assume accurate state information. It remains challenging to achieve\nsafety requirement under state uncertainties for CAVs, considering the noisy\nsensor measurements and the vulnerability of communication channels. In this\nwork, we propose a Robust Multi-Agent Proximal Policy Optimization with robust\nSafety Shield (SR-MAPPO) for CAVs in various driving scenarios. Both robust\nMARL algorithm and control barrier function (CBF)-based safety shield are used\nin our approach to cope with the perturbed or uncertain state inputs. The\nrobust policy is trained with a worst-case Q function regularization module\nthat pursues higher lower-bounded reward in the former, whereas the latter,\ni.e., the robust CBF safety shield accounts for CAVs' collision-free\nconstraints in complicated driving scenarios with even perturbed vehicle state\ninformation. We validate the advantages of SR-MAPPO in robustness and safety\nand compare it with baselines under different driving and state perturbation\nscenarios in CARLA simulator. The SR-MAPPO policy is verified to maintain\nhigher safety rates and efficiency (reward) when threatened by both state\nperturbations and unconnected vehicles' dangerous behaviors.\n",
        "published": "2023",
        "authors": [
            "Zhili Zhang",
            "Yanchao Sun",
            "Furong Huang",
            "Fei Miao"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2309.13451v1",
        "title": "Communication-Aware Map Compression for Online Path-Planning",
        "abstract": "  This paper addresses the problem of the communication of optimally compressed\ninformation for mobile robot path-planning. In this context, mobile robots\ncompress their current local maps to assist another robot in reaching a target\nin an unknown environment. We propose a framework that sequentially selects the\noptimal compression, guided by the robot's path, by balancing the map\nresolution and communication cost. Our approach is tractable in close-to-real\nscenarios and does not necessitate prior environment knowledge. We design a\nnovel decoder that leverages compressed information to estimate the unknown\nenvironment via convex optimization with linear constraints and an encoder that\nutilizes the decoder to select the optimal compression. Numerical simulations\nare conducted in a large close-to-real map and a maze map and compared with two\nalternative approaches. The results confirm the effectiveness of our framework\nin assisting the robot reach its target by reducing transmitted information, on\naverage, by approximately 50% while maintaining satisfactory performance.\n",
        "published": "2023",
        "authors": [
            "Evangelos Psomiadis",
            "Dipankar Maity",
            "Panagiotis Tsiotras"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2309.13494v4",
        "title": "Communication-Constrained Multi-Robot Exploration with Intermittent\n  Rendezvous",
        "abstract": "  This paper deals with the Multi-robot Exploration (MRE) under communication\nconstraints problem. We propose a novel intermittent rendezvous method that\nallows robots to explore an unknown environment while sharing maps at\nrendezvous locations through agreements. In our method, robots update the\nagreements to spread the rendezvous locations during the exploration and\nprioritize exploring unknown areas near them. To generate the agreements\nautomatically, we reduced the MRE to instances of the Job Shop Scheduling\nProblem (JSSP) and ensured intermittent communication through a temporal\nconnectivity graph. We evaluate our method in simulation in various virtual\nurban environments and a Gazebo simulation using the Robot Operating System\n(ROS). Our results suggest that our method can be better than using relays or\nmaintaining intermittent communication with a base station since we can explore\nfaster without additional hardware to create a relay network.\n",
        "published": "2023",
        "authors": [
            "Alysson Ribeiro da Silva",
            "Luiz Chaimowicz",
            "Vijay Kumar",
            "Thales Costa Silva",
            "Ani Hsieh"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2309.15373v1",
        "title": "Human-robot Matching and Routing for Multi-robot Tour Guiding under Time\n  Uncertainty",
        "abstract": "  This work presents a framework for multi-robot tour guidance in a partially\nknown environment with uncertainty, such as a museum. A simultaneous matching\nand routing problem (SMRP) is formulated to match the humans with robot guides\naccording to their requested places of interest (POIs) and generate the routes\nfor the robots according to uncertain time estimation. A large neighborhood\nsearch algorithm is developed to efficiently find sub-optimal low-cost\nsolutions for the SMRP. The scalability and optimality of the multi-robot\nplanner are evaluated computationally. The largest case tested involves 50\nrobots, 250 humans, and 50 POIs. A photo-realistic multi-robot simulation was\ndeveloped to verify the tour guiding performance in an uncertain indoor\nenvironment.\n",
        "published": "2023",
        "authors": [
            "Bo Fu",
            "Tribhi Kathuria",
            "Denise Rizzo",
            "Matthew Castanier",
            "X. Jessie Yang",
            "Maani Ghaffari",
            "Kira Barton"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2309.16838v1",
        "title": "Social Navigation in Crowded Environments with Model Predictive Control\n  and Deep Learning-Based Human Trajectory Prediction",
        "abstract": "  Crowd navigation has received increasing attention from researchers over the\nlast few decades, resulting in the emergence of numerous approaches aimed at\naddressing this problem to date. Our proposed approach couples agent motion\nprediction and planning to avoid the freezing robot problem while\nsimultaneously capturing multi-agent social interactions by utilizing a\nstate-of-the-art trajectory prediction model i.e., social long short-term\nmemory model (Social-LSTM). Leveraging the output of Social-LSTM for the\nprediction of future trajectories of pedestrians at each time-step given the\nrobot's possible actions, our framework computes the optimal control action\nusing Model Predictive Control (MPC) for the robot to navigate among\npedestrians. We demonstrate the effectiveness of our proposed approach in\nmultiple scenarios of simulated crowd navigation and compare it against several\nstate-of-the-art reinforcement learning-based methods.\n",
        "published": "2023",
        "authors": [
            "Viet-Anh Le",
            "Behdad Chalaki",
            "Vaishnav Tadiparthi",
            "Hossein Nourkhiz Mahjoub",
            "Jovin D'sa",
            "Ehsan Moradi-Pari"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2310.00333v1",
        "title": "Proceedings of the Third Workshop on Agents and Robots for reliable\n  Engineered Autonomy",
        "abstract": "  The volume comprises the proceedings of the Third Workshop on Agents and\nRobots for reliable Engineered Autonomy (AREA 2023), held alongside the 26th\nEuropean Conference on Artificial Intelligence (ECAI 2023). It explores the\nconvergence of autonomous agents and robotics, emphasizing the practical\napplication of agents in real-world scenarios with physical interactions. The\nworkshop highlights the growing importance of enhanced autonomy and reliable\nbehavior in robotic systems and the need for novel verification and validation\nmethods. Its primary objective is to promote collaboration between researchers\nin these fields, aiming to address complex challenges in autonomous robotic\nsystems. The volume includes 7 full papers and 5 short papers.\n",
        "published": "2023",
        "authors": [
            "Angelo Ferrando",
            "Rafael Cardoso"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2310.01614v1",
        "title": "Distributed Multi-agent Interaction Generation with Imagined Potential\n  Games",
        "abstract": "  Interactive behavior modeling of multiple agents is an essential challenge in\nsimulation, especially in scenarios when agents need to avoid collisions and\ncooperate at the same time. Humans can interact with others without explicit\ncommunication and navigate in scenarios when cooperation is required. In this\nwork, we aim to model human interactions in this realistic setting, where each\nagent acts based on its observation and does not communicate with others. We\npropose a framework based on distributed potential games, where each agent\nimagines a cooperative game with other agents and solves the game using its\nestimation of their behavior. We utilize iLQR to solve the games and\nclosed-loop simulate the interactions. We demonstrate the benefits of utilizing\ndistributed imagined games in our framework through various simulation\nexperiments. We show the high success rate, the increased navigation\nefficiency, and the ability to generate rich and realistic interactions with\ninterpretable parameters. Illustrative examples are available at\nhttps://sites.google.com/berkeley.edu/distributed-interaction.\n",
        "published": "2023",
        "authors": [
            "Lingfeng Sun",
            "Pin-Yun Hung",
            "Changhao Wang",
            "Masayoshi Tomizuka",
            "Zhuo Xu"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2310.01866v2",
        "title": "Route Design in Sheepdog System--Traveling Salesman Problem Formulation\n  and Evolutionary Computation Solution--",
        "abstract": "  In this study, we consider the guidance control problem of the sheepdog\nsystem, which involves the guidance of the flock using the characteristics of\nthe sheepdog and sheep. Sheepdog systems require a strategy to guide sheep\nagents to a target value using a small number of sheepdog agents, and various\nmethods have been proposed. Previous studies have proposed a guidance control\nlaw to guide a herd of sheep reliably, but the movement distance of a sheepdog\nrequired for guidance has not been considered. Therefore, in this study, we\npropose a novel guidance algorithm in which a supposedly efficient route for\nguiding a flock of sheep is designed via Traveling Salesman Problem and\nevolutionary computation. Numerical simulations were performed to confirm\nwhether sheep flocks could be guided and controlled using the obtained guidance\nroutes. We specifically revealed that the proposed method reduces both the\nguidance failure rate and the guidance distance.\n",
        "published": "2023",
        "authors": [
            "Wataru Imahayashi",
            "Yusuke Tsunoda",
            "Masaki Ogura"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2310.02339v1",
        "title": "Safe and Robust Robot Behavior Planning via Constraint Programming",
        "abstract": "  The safe operation of an autonomous system is a complex endeavor, one pivotal\nelement being its decision-making. Decision-making logic can formally be\nanalyzed using model checking or other formal verification approaches. Yet, the\nnon-deterministic nature of realistic environments makes these approaches\nrather troublesome and often impractical. Constraint-based planning approaches\nsuch as Tumato have been shown to be capable of generating policies for a\nsystem to reach a stated goal and abiding safety constraints, with guarantees\nof soundness and completeness by construction. However, uncertain outcomes of\nactions in the environment are not explicitly modeled or accounted for,\nseverely limiting the expressiveness of Tumato.\n  In this work, we extend Tumato with support for non-deterministic outcomes of\nactions. Actions have a specific intended result yet can be modeled to have\nalternative outcomes that may realistically occur. The adapted solver generates\na policy that enables reaching the goals in a safe manner, even when\nalternative outcomes of actions occur. Furthermore, we introduce a purely\ndeclarative way of defining safety in Tumato, increasing its expressiveness.\nFinally, the addition of cost or duration values to actions enables the solver\nto restore safety when necessary, in the most preferred way.\n",
        "published": "2023",
        "authors": [
            "Jan Vermaelen",
            "Tom Holvoet"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2310.02346v1",
        "title": "Evaluating Heuristic Search Algorithms in Pathfinding: A Comprehensive\n  Study on Performance Metrics and Domain Parameters",
        "abstract": "  The paper presents a comprehensive performance evaluation of some heuristic\nsearch algorithms in the context of autonomous systems and robotics. The\nobjective of the study is to evaluate and compare the performance of different\nsearch algorithms in different problem settings on the pathfinding domain.\nExperiments give us insight into the behavior of the evaluated heuristic search\nalgorithms, over the variation of different parameters: domain size, obstacle\ndensity, and distance between the start and the goal states. Results are then\nused to design a selection algorithm that, on the basis of problem\ncharacteristics, suggests the best search algorithm to use.\n",
        "published": "2023",
        "authors": [
            "Aya Kherrour",
            "Marco Robol",
            "Marco Roveri",
            "Paolo Giorgini"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2310.02726v1",
        "title": "Optimal Collaborative Transportation for Under-Capacitated Vehicle\n  Routing Problems using Aerial Drone Swarms",
        "abstract": "  Swarms of aerial drones have recently been considered for last-mile\ndeliveries in urban logistics or automated construction. At the same time,\ncollaborative transportation of payloads by multiple drones is another\nimportant area of recent research. However, efficient coordination algorithms\nfor collaborative transportation of many payloads by many drones remain to be\nconsidered. In this work, we formulate the collaborative transportation of\npayloads by a swarm of drones as a novel, under-capacitated generalization of\nvehicle routing problems (VRP), which may also be of separate interest. In\ncontrast to standard VRP and capacitated VRP, we must additionally consider\nwaiting times for payloads lifted cooperatively by multiple drones, and the\ncorresponding coordination. Algorithmically, we provide a solution encoding\nthat avoids deadlocks and formulate an appropriate alternating minimization\nscheme to solve the problem. On the hardware side, we integrate our algorithms\nwith collision avoidance and drone controllers. The approach and the impact of\nthe system integration are successfully verified empirically, both on a swarm\nof real nano-quadcopters and for large swarms in simulation. Overall, we\nprovide a framework for collaborative transportation with aerial drone swarms,\nthat uses only as many drones as necessary for the transportation of any single\npayload.\n",
        "published": "2023",
        "authors": [
            "Akash Kopparam Sreedhara",
            "Deepesh Padala",
            "Shashank Mahesh",
            "Kai Cui",
            "Mengguang Li",
            "Heinz Koeppl"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2310.03394v1",
        "title": "Kinodynamic Motion Planning for a Team of Multirotors Transporting a\n  Cable-Suspended Payload in Cluttered Environments",
        "abstract": "  We propose a motion planner for cable-driven payload transportation using\nmultiple unmanned aerial vehicles (UAVs) in an environment cluttered with\nobstacles. Our planner is kinodynamic, i.e., it considers the full dynamics\nmodel of the transporting system including actuation constraints. Due to the\nhigh dimensionality of the planning problem, we use a hierarchical approach\nwhere we first solve the geometric motion planning using a sampling-based\nmethod with a novel sampler, followed by constrained trajectory optimization\nthat considers the full dynamics of the system. Both planning stages consider\ninter-robot and robot/obstacle collisions. We demonstrate in a\nsoftware-in-the-loop simulation that there is a significant benefit in\nkinodynamic motion planning for such payload transport systems with respect to\npayload tracking error and energy consumption compared to the standard methods\nof planning for the payload alone. Notably, we observe a significantly higher\nsuccess rate in scenarios where the team formation changes are needed to move\nthrough tight spaces.\n",
        "published": "2023",
        "authors": [
            "Khaled Wahba",
            "Joaquim Ortiz-Haro",
            "Marc Toussaint",
            "Wolfgang Hönig"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2310.06153v1",
        "title": "Multi-Robot Task Assignment and Path Finding for Time-Sensitive Missions\n  with Online Task Generation",
        "abstract": "  Executing time-sensitive multi-robot missions involves two distinct problems:\nMulti-Robot Task Assignment (MRTA) and Multi-Agent Path Finding (MAPF).\nComputing safe paths that complete every task and minimize the time to mission\ncompletion, or makespan, is a significant computational challenge even for\nsmall teams. In many missions, tasks can be generated during execution which is\ntypically handled by either recomputing task assignments and paths from\nscratch, or by modifying existing plans using approximate approaches. While\nperforming task reassignment and path finding from scratch produces\ntheoretically optimal results, the computational load makes it too expensive\nfor online implementation. In this work, we present Time-Sensitive Online Task\nAssignment and Navigation (TSOTAN), a framework which can quickly incorporate\nonline generated tasks while guaranteeing bounded suboptimal task assignment\nmakespans. It does this by assessing the quality of partial task reassignments\nand only performing a complete reoptimization when the makespan exceeds a user\nspecified suboptimality bound. Through experiments in 2D environments we\ndemonstrate TSOTAN's ability to produce quality solutions with computation\ntimes suitable for online implementation.\n",
        "published": "2023",
        "authors": [
            "David Thorne",
            "Brett T. Lopez"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2310.06964v1",
        "title": "Multi-Robot Cooperative Navigation in Crowds: A Game-Theoretic\n  Learning-Based Model Predictive Control Approach",
        "abstract": "  In this paper, we develop a control framework for the coordination of\nmultiple robots as they navigate through crowded environments. Our framework\ncomprises of a local model predictive control (MPC) for each robot and a social\nlong short-term memory model that forecasts pedestrians' trajectories. We\nformulate the local MPC formulation for each individual robot that includes\nboth individual and shared objectives, in which the latter encourages the\nemergence of coordination among robots. Next, we consider the multi-robot\nnavigation and human-robot interaction, respectively, as a potential game and a\ntwo-player game, then employ an iterative best response approach to solve the\nresulting optimization problems in a centralized and distributed fashion.\nFinally, we demonstrate the effectiveness of coordination among robots in\nsimulated crowd navigation.\n",
        "published": "2023",
        "authors": [
            "Viet-Anh Le",
            "Vaishnav Tadiparthi",
            "Behdad Chalaki",
            "Hossein Nourkhiz Mahjoub",
            "Jovin D'sa",
            "Ehsan Moradi-Pari",
            "Andreas A. Malikopoulos"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2310.10502v1",
        "title": "Adaptive Robot Assistance: Expertise and Influence in Multi-User Task\n  Planning",
        "abstract": "  This paper addresses the challenge of enabling a single robot to effectively\nassist multiple humans in decision-making for task planning domains. We\nintroduce a comprehensive framework designed to enhance overall team\nperformance by considering both human expertise in making the optimal decisions\nand robot influence on human decision-making. Our model integrates these\nfactors seamlessly within the task-planning domain, formulating the problem as\na partially observable Markov decision process (POMDP) while treating expertise\nand influence as unobservable components of the system state. To solve for the\nrobot's actions in such systems, we propose an efficient Attention-Switching\npolicy. This policy capitalizes on the inherent structure of such systems,\nsolving multiple smaller POMDPs to generate heuristics for prioritizing\ninteractions with different human teammates, thereby reducing the state space\nand improving scalability. Our empirical results on a simulated kit fulfillment\ntask demonstrate improved team performance when the robot's policy accounts for\nboth expertise and influence. This research represents a significant step\nforward in the field of adaptive robot assistance, paving the way for\nintegration into cost-effective small and mid-scale industries, where\nsubstantial investments in robotic infrastructure may not be economically\nviable.\n",
        "published": "2023",
        "authors": [
            "Abhinav Dahiya",
            "Stephen L. Smith"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2310.11843v1",
        "title": "Do We Run Large-scale Multi-Robot Systems on the Edge? More Evidence for\n  Two-Phase Performance in System Size Scaling",
        "abstract": "  With increasing numbers of mobile robots arriving in real-world applications,\nmore robots coexist in the same space, interact, and possibly collaborate.\nMethods to provide such systems with system size scalability are known, for\nexample, from swarm robotics. Example strategies are self-organizing behavior,\na strict decentralized approach, and limiting the robot-robot communication.\nDespite applying such strategies, any multi-robot system breaks above a certain\ncritical system size (i.e., number of robots) as too many robots share a\nresource (e.g., space, communication channel). We provide additional evidence\nbased on simulations, that at these critical system sizes, the system\nperformance separates into two phases: nearly optimal and minimal performance.\nWe speculate that in real-world applications that are configured for optimal\nsystem size, the supposedly high-performing system may actually live on\nborrowed time as it is on a transient to breakdown. We provide two modeling\noptions (based on queueing theory and a population model) that may help to\nsupport this reasoning.\n",
        "published": "2023",
        "authors": [
            "Jonas Kuckling",
            "Robin Luckey",
            "Viktor Avrutin",
            "Andrew Vardy",
            "Andreagiovanni Reina",
            "Heiko Hamann"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2310.12816v1",
        "title": "Multi-Robot Local Motion Planning Using Dynamic Optimization Fabrics",
        "abstract": "  In this paper, we address the problem of real-time motion planning for\nmultiple robotic manipulators that operate in close proximity. We build upon\nthe concept of dynamic fabrics and extend them to multi-robot systems, referred\nto as Multi-Robot Dynamic Fabrics (MRDF). This geometric method enables a very\nhigh planning frequency for high-dimensional systems at the expense of being\nreactive and prone to deadlocks. To detect and resolve deadlocks, we propose\nRollout Fabrics where MRDF are forward simulated in a decentralized manner. We\nvalidate the methods in simulated close-proximity pick-and-place scenarios with\nmultiple manipulators, showing high success rates and real-time performance.\n",
        "published": "2023",
        "authors": [
            "Saray Bakker",
            "Luzia Knoedler",
            "Max Spahn",
            "Wendelin Böhmer",
            "Javier Alonso-Mora"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2310.12909v1",
        "title": "Collaborative Adaptation: Learning to Recover from Unforeseen\n  Malfunctions in Multi-Robot Teams",
        "abstract": "  Cooperative multi-agent reinforcement learning (MARL) approaches tackle the\nchallenge of finding effective multi-agent cooperation strategies for\naccomplishing individual or shared objectives in multi-agent teams. In\nreal-world scenarios, however, agents may encounter unforeseen failures due to\nconstraints like battery depletion or mechanical issues. Existing\nstate-of-the-art methods in MARL often recover slowly -- if at all -- from such\nmalfunctions once agents have already converged on a cooperation strategy. To\naddress this gap, we present the Collaborative Adaptation (CA) framework. CA\nintroduces a mechanism that guides collaboration and accelerates adaptation\nfrom unforeseen failures by leveraging inter-agent relationships. Our findings\ndemonstrate that CA enables agents to act on the knowledge of inter-agent\nrelations, recovering from unforeseen agent failures and selecting appropriate\ncooperative strategies.\n",
        "published": "2023",
        "authors": [
            "Yasin Findik",
            "Paul Robinette",
            "Kshitij Jerath",
            "S. Reza Ahmadzadeh"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2310.12910v1",
        "title": "Influence of Team Interactions on Multi-Robot Cooperation: A Relational\n  Network Perspective",
        "abstract": "  Relational networks within a team play a critical role in the performance of\nmany real-world multi-robot systems. To successfully accomplish tasks that\nrequire cooperation and coordination, different agents (e.g., robots)\nnecessitate different priorities based on their positioning within the team.\nYet, many of the existing multi-robot cooperation algorithms regard agents as\ninterchangeable and lack a mechanism to guide the type of cooperation strategy\nthe agents should exhibit. To account for the team structure in cooperative\ntasks, we propose a novel algorithm that uses a relational network comprising\ninter-agent relationships to prioritize certain agents over others. Through\nappropriate design of the team's relational network, we can guide the\ncooperation strategy, resulting in the emergence of new behaviors that\naccomplish the specified task. We conducted six experiments in a multi-robot\nsetting with a cooperative task. Our results demonstrate that the proposed\nmethod can effectively influence the type of solution that the algorithm\nconverges to by specifying the relationships between the agents, making it a\npromising approach for tasks that require cooperation among agents with a\nspecified team structure.\n",
        "published": "2023",
        "authors": [
            "Yasin Findik",
            "Hamid Osooli",
            "Paul Robinette",
            "Kshitij Jerath",
            "S. Reza Ahmadzadeh"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2310.12912v1",
        "title": "Impact of Relational Networks in Multi-Agent Learning: A Value-Based\n  Factorization View",
        "abstract": "  Effective coordination and cooperation among agents are crucial for\naccomplishing individual or shared objectives in multi-agent systems. In many\nreal-world multi-agent systems, agents possess varying abilities and\nconstraints, making it necessary to prioritize agents based on their specific\nproperties to ensure successful coordination and cooperation within the team.\nHowever, most existing cooperative multi-agent algorithms do not take into\naccount these individual differences, and lack an effective mechanism to guide\ncoordination strategies. We propose a novel multi-agent learning approach that\nincorporates relationship awareness into value-based factorization methods.\nGiven a relational network, our approach utilizes inter-agents relationships to\ndiscover new team behaviors by prioritizing certain agents over other,\naccounting for differences between them in cooperative tasks. We evaluated the\neffectiveness of our proposed approach by conducting fifteen experiments in two\ndifferent environments. The results demonstrate that our proposed algorithm can\ninfluence and shape team behavior, guide cooperation strategies, and expedite\nagent learning. Therefore, our approach shows promise for use in multi-agent\nsystems, especially when agents have diverse properties.\n",
        "published": "2023",
        "authors": [
            "Yasin Findik",
            "Paul Robinette",
            "Kshitij Jerath",
            "S. Reza Ahmadzadeh"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2310.12958v1",
        "title": "Local Non-Cooperative Games with Principled Player Selection for\n  Scalable Motion Planning",
        "abstract": "  Game-theoretic motion planners are a powerful tool for the control of\ninteractive multi-agent robot systems. Indeed, contrary to predict-then-plan\nparadigms, game-theoretic planners do not ignore the interactive nature of the\nproblem, and simultaneously predict the behaviour of other agents while\nconsidering change in one's policy. This, however, comes at the expense of\ncomputational complexity, especially as the number of agents considered grows.\nIn fact, planning with more than a handful of agents can quickly become\nintractable, disqualifying game-theoretic planners as possible candidates for\nlarge scale planning. In this paper, we propose a planning algorithm enabling\nthe use of game-theoretic planners in robot systems with a large number of\nagents. Our planner is based on the reality of locality of information and thus\ndeploys local games with a selected subset of agents in a receding horizon\nfashion to plan collision avoiding trajectories. We propose five different\nprincipled schemes for selecting game participants and compare their collision\navoidance performance. We observe that the use of Control Barrier Functions for\npriority ranking is a potent solution to the player selection problem for\nmotion planning.\n",
        "published": "2023",
        "authors": [
            "Makram Chahine",
            "Roya Firoozi",
            "Wei Xiao",
            "Mac Schwager",
            "Daniela Rus"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2310.19400v1",
        "title": "Distributed multi-agent magnetic field norm SLAM with Gaussian processes",
        "abstract": "  Accurately estimating the positions of multi-agent systems in indoor\nenvironments is challenging due to the lack of Global Navigation Satelite\nSystem (GNSS) signals. Noisy measurements of position and orientation can cause\nthe integrated position estimate to drift without bound. Previous research has\nproposed using magnetic field simultaneous localization and mapping (SLAM) to\ncompensate for position drift in a single agent. Here, we propose two novel\nalgorithms that allow multiple agents to apply magnetic field SLAM using their\nown and other agents measurements.\n  Our first algorithm is a centralized approach that uses all measurements\ncollected by all agents in a single extended Kalman filter. This algorithm\nsimultaneously estimates the agents position and orientation and the magnetic\nfield norm in a central unit that can communicate with all agents at all times.\nIn cases where a central unit is not available, and there are communication\ndrop-outs between agents, our second algorithm is a distributed approach that\ncan be employed.\n  We tested both algorithms by estimating the position of magnetometers carried\nby three people in an optical motion capture lab with simulated odometry and\nsimulated communication dropouts between agents. We show that both algorithms\nare able to compensate for drift in a case where single-agent SLAM is not. We\nalso discuss the conditions for the estimate from our distributed algorithm to\nconverge to the estimate from the centralized algorithm, both theoretically and\nexperimentally.\n  Our experiments show that, for a communication drop-out rate of 80 percent,\nour proposed distributed algorithm, on average, provides a more accurate\nposition estimate than single-agent SLAM. Finally, we demonstrate the\ndrift-compensating abilities of our centralized algorithm on a real-life\npedestrian localization problem with multiple agents moving inside a building.\n",
        "published": "2023",
        "authors": [
            "Frida Viset",
            "Rudy Helmons",
            "Manon Kok"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2311.01078v1",
        "title": "Multi-agent robotic systems and exploration algorithms: Applications for\n  data collection in construction sites",
        "abstract": "  The construction industry has been notoriously slow to adopt new technology\nand embrace automation. This has resulted in lower efficiency and productivity\ncompared to other industries where automation has been widely adopted. However,\nrecent advancements in robotics and artificial intelligence offer a potential\nsolution to this problem. In this study, a methodology is proposed to integrate\nmulti-robotic systems in construction projects with the aim of increasing\nefficiency and productivity. The proposed approach involves the use of multiple\nrobot and human agents working collaboratively to complete a construction task.\nThe methodology was tested through a case study that involved 3D digitization\nof a small, occluded space using two robots and one human agent. The results\nshow that integrating multi-agent robotic systems in construction can\neffectively overcome challenges and complete tasks efficiently. The\nimplications of this study suggest that multi-agent robotic systems could\nrevolutionize the industry.\n",
        "published": "2023",
        "authors": [
            "Samuel A. Prieto",
            "Nikolaos Giakoumidis",
            "Borja Garcia de Soto"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2311.03655v1",
        "title": "PUMA: Fully Decentralized Uncertainty-aware Multiagent Trajectory\n  Planner with Real-time Image Segmentation-based Frame Alignment",
        "abstract": "  Fully decentralized, multiagent trajectory planners enable complex tasks like\nsearch and rescue or package delivery by ensuring safe navigation in unknown\nenvironments. However, deconflicting trajectories with other agents and\nensuring collision-free paths in a fully decentralized setting is complicated\nby dynamic elements and localization uncertainty. To this end, this paper\npresents (1) an uncertainty-aware multiagent trajectory planner and (2) an\nimage segmentation-based frame alignment pipeline. The uncertainty-aware\nplanner propagates uncertainty associated with the future motion of detected\nobstacles, and by incorporating this propagated uncertainty into optimization\nconstraints, the planner effectively navigates around obstacles. Unlike\nconventional methods that emphasize explicit obstacle tracking, our approach\nintegrates implicit tracking. Sharing trajectories between agents can cause\npotential collisions due to frame misalignment. Addressing this, we introduce a\nnovel frame alignment pipeline that rectifies inter-agent frame misalignment.\nThis method leverages a zero-shot image segmentation model for detecting\nobjects in the environment and a data association framework based on geometric\nconsistency for map alignment. Our approach accurately aligns frames with only\n0.18 m and 2.7 deg of mean frame alignment error in our most challenging\nsimulation scenario. In addition, we conducted hardware experiments and\nsuccessfully achieved 0.29 m and 2.59 deg of frame alignment error. Together\nwith the alignment framework, our planner ensures safe navigation in unknown\nenvironments and collision avoidance in decentralized settings.\n",
        "published": "2023",
        "authors": [
            "Kota Kondo",
            "Claudius T. Tewari",
            "Mason B. Peterson",
            "Annika Thomas",
            "Jouko Kinnari",
            "Andrea Tagliabue",
            "Jonathan P. How"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2311.07105v1",
        "title": "Collaborative Goal Tracking of Multiple Mobile Robots Based on Geometric\n  Graph Neural Network",
        "abstract": "  Multi-robot systems are widely used in spatially distributed tasks, and their\ncollaborative path planning is of great significance for working efficiency.\nCurrently, different multi-robot collaborative path planning methods have been\nproposed, but how to process the sensory information of neighboring robots at\ndifferent locations from a local perception perspective in real environment to\nmake better decisions is still a major difficulty. To address this problem,\nthis paper proposes a multi-robot collaborative path planning method based on\ngeometric graph neural network (GeoGNN). GeoGNN introduces the relative\nposition information of neighboring robots into each interaction layer of the\ngraph neural network to better integrate neighbor sensing information. An\nexpert data generation method is designed for the robot to advance in a single\nstep, by which expert data are generated in ROS to train the network.\nExperimental results show that the accuracy of the proposed method is improved\nby about 5% compared to the model based only on CNN on the expert data set. In\nROS simulation environment path planning test, the success rate is improved by\nabout 4% compared to CNN and flowtime increase is reduced about 8%, which\noutperforms other graph neural network models.\n",
        "published": "2023",
        "authors": [
            "Qingquan Lin",
            "Weining Lu"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2311.09439v1",
        "title": "Learning Hyperplanes for Multi-Agent Collision Avoidance in Space",
        "abstract": "  A core challenge of multi-robot interactions is collision avoidance among\nrobots with potentially conflicting objectives. We propose a game-theoretic\nmethod for collision avoidance based on rotating hyperplane constraints. These\nconstraints ensure collision avoidance by defining separating hyperplanes that\nrotate around a keep-out zone centered on certain robots. Since it is\nchallenging to select the parameters that define a hyperplane without\nintroducing infeasibilities, we propose to learn them from an expert trajectory\ni.e., one collected by recording human operators. To do so, we solve for the\nparameters whose corresponding equilibrium trajectory best matches the expert\ntrajectory. We validate our method by learning hyperplane parameters from noisy\nexpert trajectories and demonstrate the generalizability of the learned\nparameters to scenarios with more robots and previously unseen initial\nconditions.\n",
        "published": "2023",
        "authors": [
            "Fernando Palafox",
            "Yue Yu",
            "David Fridovich-Keil"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2311.10176v1",
        "title": "Hypergraph-based Multi-robot Motion Planning with Topological Guidance",
        "abstract": "  We present a multi-robot motion planning algorithm that efficiently finds\npaths for robot teams up to ten times larger than existing methods in congested\nsettings with narrow passages in the environment. Narrow passages represent a\nsource of difficulty for sampling-based motion planning algorithms. This\nproblem is exacerbated for multi-robot systems where the planner must also\navoid inter-robot collisions within these congested spaces, requiring\ncoordination. Topological guidance, which leverages information about the\nrobot's environment, has been shown to improve performance for mobile robot\nmotion planning in single robot scenarios with narrow passages. Additionally,\nour prior work has explored using topological guidance in multi-robot settings\nwhere a high degree of coordination is required of the full robot group. This\nhigh level of coordination, however, is not always necessary and results in\nexcessive computational overhead for large groups. Here, we propose a novel\nmulti-robot motion planning method that leverages topological guidance to\ninform the planner when coordination between robots is necessary, leading to a\nsignificant improvement in scalability.\n",
        "published": "2023",
        "authors": [
            "Courtney McBeth",
            "James Motes",
            "Marco Morales",
            "Nancy M. Amato"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2311.11144v1",
        "title": "A Model for Multi-Agent Autonomy That Uses Opinion Dynamics and\n  Multi-Objective Behavior Optimization",
        "abstract": "  This paper reports a new hierarchical architecture for modeling autonomous\nmulti-robot systems (MRSs): a non-linear dynamical opinion process is used to\nmodel high-level group choice, and multi-objective behavior optimization is\nused to model individual decisions. Using previously reported theoretical\nresults, we show it is possible to design the behavior of the MRS by the\nselection of a relatively small set of parameters. The resulting behavior -\nboth collective actions and individual actions - can be understood intuitively.\nThe approach is entirely decentralized and the communication cost scales by the\nnumber of group options, not agents. We demonstrated the effectiveness of this\napproach using a hypothetical `explore-exploit-migrate' scenario in a two hour\nfield demonstration with eight unmanned surface vessels (USVs). The results\nfrom our preliminary field experiment show the collective behavior is robust\neven with time-varying network topology and agent dropouts.\n",
        "published": "2023",
        "authors": [
            "Tyler M. Paine",
            "Michael R. Benjamin"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2311.12580v1",
        "title": "CoVOR-SLAM: Cooperative SLAM using Visual Odometry and Ranges for\n  Multi-Robot Systems",
        "abstract": "  A swarm of robots has advantages over a single robot, since it can explore\nlarger areas much faster and is more robust to single-point failures. Accurate\nrelative positioning is necessary to successfully carry out a collaborative\nmission without collisions. When Visual Simultaneous Localization and Mapping\n(VSLAM) is used to estimate the poses of each robot, inter-agent loop closing\nis widely applied to reduce the relative positioning errors. This technique can\nmitigate errors using the feature points commonly observed by different robots.\nHowever, it requires significant computing and communication capabilities to\ndetect inter-agent loops, and to process the data transmitted by multiple\nagents. In this paper, we propose Collaborative SLAM using Visual Odometry and\nRange measurements (CoVOR-SLAM) to overcome this challenge. In the framework of\nCoVOR-SLAM, robots only need to exchange pose estimates, covariances\n(uncertainty) of the estimates, and range measurements between robots. Since\nCoVOR-SLAM does not require to associate visual features and map points\nobserved by different agents, the computational and communication loads are\nsignificantly reduced. The required range measurements can be obtained using\npilot signals of the communication system, without requiring complex additional\ninfrastructure. We tested CoVOR-SLAM using real images as well as real\nultra-wideband-based ranges obtained with two rovers. In addition, CoVOR-SLAM\nis evaluated with a larger scale multi-agent setup exploiting public image\ndatasets and ranges generated using a realistic simulation. The results show\nthat CoVOR-SLAM can accurately estimate the robots' poses, requiring much less\ncomputational power and communication capabilities than the inter-agent loop\nclosing technique.\n",
        "published": "2023",
        "authors": [
            "Young-Hee Lee",
            "Chen Zhu",
            "Thomas Wiedemann",
            "Emanuel Staudinger",
            "Siwei Zhang",
            "Christoph Günther"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2311.14145v1",
        "title": "Multi-Agent Motion Planning with Bézier Curve Optimization under\n  Kinodynamic Constraints",
        "abstract": "  Multi-Agent Motion Planning (MAMP) is a problem that seeks collision-free\ndynamically-feasible trajectories for multiple moving agents in a known\nenvironment while minimizing their travel time. MAMP is closely related to the\nwell-studied Multi-Agent Path-Finding (MAPF) problem. Recently, MAPF methods\nhave achieved great success in finding collision-free paths for a substantial\nnumber of agents. However, those methods often overlook the kinodynamic\nconstraints of the agents, assuming instantaneous movement, which limits their\npracticality and realism. In this paper, we present a three-level MAPF-based\nplanner called PSB to address the challenges posed by MAMP. PSB fully considers\nthe kinodynamic capability of the agents and produces solutions with smooth\nspeed profiles that can be directly executed by the controller. Empirically, we\nevaluate PSB within the domains of traffic intersection coordination for\nautonomous vehicles and obstacle-rich grid map navigation for mobile robots.\nPSB shows up to 49.79% improvements in solution cost compared to existing\nmethods.\n",
        "published": "2023",
        "authors": [
            "Jingtian Yan",
            "Jiaoyang Li"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2311.17681v1",
        "title": "Autonomous Intersection Management for Non-Communicative Autonomous\n  Vehicles",
        "abstract": "  This paper addresses the traffic management problem for autonomous vehicles\nat intersections without traffic signals. In the current system, a road\njunction has no traffic signals when the traffic volume is low to medium.\nInstalling infrastructure at each unsignalled crossing to coordinate autonomous\ncars can be formidable. We propose a novel decentralized strategy where the\nvehicles use a harmony matrix to find the best possible combination of the cars\nto cross the intersection without any crashes. We formulate a maximal clique\nproblem using harmony matrix that maximizes the intersection throughput. This\nalgorithm does not require communication between the vehicles. We compared our\nwork with state-of-the-art communicative strategies and widely used traditional\nand modern methods for intersection management. Through extensive simulation,\nwe showed that our algorithm is comparable to state-of-the-art and outperforms\ntraditional methods.\n",
        "published": "2023",
        "authors": [
            "Rugved Katole",
            "Arpita Sinha"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2311.17697v1",
        "title": "Swarm Synergy: A Silent Way of Forming Community",
        "abstract": "  In this paper, we introduce a novel swarm application, swarm synergy, where\nrobots in a swarm intend to form communities. Each robot is considered to make\nindependent decisions without any communication capability (silent agent). The\nproposed algorithm is based on parameters local to individual robots. Engaging\nscenarios are studied where the silent robots form communities without the\npreset conditions on the number of communities, community size, goal location\nof each community, and specific members in the community. Our approach allows\nsilent robots to achieve this self-organized swarm behavior using only sensory\ninputs from the environment. The algorithm facilitates the formation of\nmultiple swarm communities at arbitrary locations with unspecified goal\nlocations. We further infer the behavior of swarm synergy to ensure the\nanonymity/untraceability of both robots and communities. The robots intend to\nform a community by sensing the neighbors, creating synergy in a bounded\nenvironment. The time to achieve synergy depends on the environment boundary\nand the onboard sensor's field of view. Compared to the state-of-art with\nsimilar objectives, the proposed communication-free swarm synergy shows\ncomparative time to synergize with untraceability features.\n",
        "published": "2023",
        "authors": [
            "Sweksha Jain",
            "Rugved Katole",
            "Leena Vachhani"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2311.18394v1",
        "title": "HMAS: enabling seamless collaboration between drones, quadruped robots,\n  and human operators with efficient spatial awareness",
        "abstract": "  Heterogeneous robots equipped with multi-modal sensors (e.g., UAV, wheeled\nand legged terrestrial robots) provide rich and complementary functions that\nmay help human operators to accomplish complex tasks in unknown environments.\nHowever, seamlessly integrating heterogeneous agents and making them interact\nand collaborate still arise challenging issues. In this paper, we define a ROS\n2 based software architecture that allows to build incarnated heterogeneous\nmulti-agent systems (HMAS) in a generic way. We showcase its effectiveness\nthrough a scenario integrating aerial drones, quadruped robots, and human\noperators (see https://youtu.be/iOtCCticGuk). In addition, agent spatial\nawareness in unknown outdoor environments is a critical step for realizing\nautonomous individual movements, interactions, and collaborations. Through\nintensive experimental measurements, RTK-GPS is shown to be a suitable solution\nfor achieving the required locating accuracy.\n",
        "published": "2023",
        "authors": [
            "Amaury Saint-Jore",
            "Ye-Qiong Song",
            "Laurent Ciarletta"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2312.03488v1",
        "title": "Modeling Aggregate Downwash Forces for Dense Multirotor Flight",
        "abstract": "  Dense formation flight with multirotor swarms is a powerful, nature-inspired\nflight regime with numerous applications in the realworld. However, when\nmultirotors fly in close vertical proximity to each other, the propeller\ndownwash from the vehicles can have a destabilising effect on each other.\nUnfortunately, even in a homogeneous team, an accurate model of downwash forces\nfrom one vehicle is unlikely to be sufficient for predicting aggregate forces\nfrom multiple vehicles in formation.\n  In this work, we model the interaction patterns produced by one or more\nvehicles flying in close proximity to an ego-vehicle. We first present an\nexperimental test rig designed to capture 6-DOF exogenic forces acting on a\nmultirotor frame. We then study and characterize these measured forces as a\nfunction of the relative states of two multirotors flying various patterns in\nits vicinity.\n  Our analysis captures strong non-linearities present in the aggregation of\nthese interactions. Then, by modeling the formation as a graph, we present a\nnovel approach for learning the force aggregation function, and contrast it\nagainst simpler linear models. Finally, we explore how our proposed models\ngeneralize when a fourth vehicle is added to the formation.\n",
        "published": "2023",
        "authors": [
            "Jennifer Gielis",
            "Ajay Shankar",
            "Ryan Kortvelesy",
            "Amanda Prorok"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2312.07523v1",
        "title": "Self-Healing Distributed Swarm Formation Control Using Image Moments",
        "abstract": "  Human-swarm interaction is facilitated by a low-dimensional encoding of the\nswarm formation, independent of the (possibly large) number of robots. We\npropose using image moments to encode two-dimensional formations of robots.\nEach robot knows the desired formation moments, and simultaneously estimates\nthe current moments of the entire swarm while controlling its motion to better\nachieve the desired group moments. The estimator is a distributed optimization,\nrequiring no centralized processing, and self-healing, meaning that the process\nis robust to initialization errors, packet drops, and robots being added to or\nremoved from the swarm. Our experimental results with a swarm of 50 robots,\nsuffering nearly 50% packet loss, show that distributed estimation and control\nof image moments effectively achieves desired swarm formations.\n",
        "published": "2023",
        "authors": [
            "C. Lin Liu",
            "Israel L. Donato Ridgley",
            "Matthew L. Elwin",
            "Michael Rubenstein",
            "Randy A. Freeman",
            "Kevin M. Lynch"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2312.08554v1",
        "title": "Adaptive Robot Coordination: A Subproblem-based Approach for Hybrid\n  Multi-Robot Motion Planning",
        "abstract": "  This work presents Adaptive Robot Coordination (ARC), a novel hybrid\nframework for multi-robot motion planning (MRMP) that employs local subproblems\nto resolve inter-robot conflicts. ARC creates subproblems centered around\nconflicts, and the solutions represent the robot motions required to resolve\nthese conflicts. The use of subproblems enables an inexpensive hybrid\nexploration of the multi-robot planning space. ARC leverages the hybrid\nexploration by dynamically adjusting the coupling and decoupling of the\nmulti-robot planning space. This allows ARC to adapt the levels of coordination\nefficiently by planning in decoupled spaces, where robots can operate\nindependently, and in coupled spaces where coordination is essential. ARC is\nprobabilistically complete, can be used for any robot, and produces efficient\ncost solutions in reduced planning times. Through extensive evaluation across\nrepresentative scenarios with different robots requiring various levels of\ncoordination, ARC demonstrates its ability to provide simultaneous scalability\nand precise coordination. ARC is the only method capable of solving all the\nscenarios and is competitive with coupled, decoupled, and hybrid baselines.\n",
        "published": "2023",
        "authors": [
            "Irving Solis",
            "James Motes",
            "Mike Qin",
            "Marco Morales",
            "Nancy M. Amato"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2312.11084v2",
        "title": "Multi-Agent Reinforcement Learning for Connected and Automated Vehicles\n  Control: Recent Advancements and Future Prospects",
        "abstract": "  Connected and automated vehicles (CAVs) have emerged as a potential solution\nto the future challenges of developing safe, efficient, and eco-friendly\ntransportation systems. However, CAV control presents significant challenges,\ngiven the complexity of interconnectivity and coordination required among the\nvehicles. To address this, multi-agent reinforcement learning (MARL), with its\nnotable advancements in addressing complex problems in autonomous driving,\nrobotics, and human-vehicle interaction, has emerged as a promising tool for\nenhancing the capabilities of CAVs. However, there is a notable absence of\ncurrent reviews on the state-of-the-art MARL algorithms in the context of CAVs.\nTherefore, this paper delivers a comprehensive review of the application of\nMARL techniques within the field of CAV control. The paper begins by\nintroducing MARL, followed by a detailed explanation of its unique advantages\nin addressing complex mobility and traffic scenarios that involve multiple\nagents. It then presents a comprehensive survey of MARL applications on the\nextent of control dimensions for CAVs, covering critical and typical scenarios\nsuch as platooning control, lane-changing, and unsignalized intersections. In\naddition, the paper provides a comprehensive review of the prominent simulation\nplatforms used to create reliable environments for training in MARL. Lastly,\nthe paper examines the current challenges associated with deploying MARL within\nCAV control and outlines potential solutions that can effectively overcome\nthese issues. Through this review, the study highlights the tremendous\npotential of MARL to enhance the performance and collaboration of CAV control\nin terms of safety, travel efficiency, and economy.\n",
        "published": "2023",
        "authors": [
            "Min Hua",
            "Dong Chen",
            "Xinda Qi",
            "Kun Jiang",
            "Zemin Eitan Liu",
            "Quan Zhou",
            "Hongming Xu"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2312.11802v1",
        "title": "IKT-BT: Indirect Knowledge Transfer Behavior Tree Framework for\n  Multi-Robot Systems Through Communication Eavesdropping",
        "abstract": "  Multi-agent and multi-robot systems (MRS) often rely on direct communication\nfor information sharing. This work explores an alternative approach inspired by\neavesdropping mechanisms in nature that involves casual observation of agent\ninteractions to enhance decentralized knowledge dissemination. We achieve this\nthrough a novel IKT-BT framework tailored for a behavior-based MRS,\nencapsulating knowledge and control actions in Behavior Trees (BT). We present\ntwo new BT-based modalities - eavesdrop-update (EU) and eavesdrop-buffer-update\n(EBU) - incorporating unique eavesdropping strategies and efficient episodic\nmemory management suited for resource-limited swarm robots. We theoretically\nanalyze the IKT-BT framework for an MRS and validate the performance of the\nproposed modalities through extensive experiments simulating a search and\nrescue mission. Our results reveal improvements in both global mission\nperformance outcomes and agent-level knowledge dissemination with a reduced\nneed for direct communication.\n",
        "published": "2023",
        "authors": [
            "Sanjay Oruganti",
            "Ramviyas Parasuraman",
            "Ramana Pidaparti"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2312.16564v1",
        "title": "Balancing Priorities in Patrolling with Rabbit Walks",
        "abstract": "  In an environment with certain locations of higher priority, it is required\nto patrol these locations as frequently as possible due to their importance.\nHowever, the Non-Priority locations are often neglected during the task. It is\nnecessary to balance the patrols on both kinds of sites to avoid breaches in\nsecurity. We present a distributed online algorithm that assigns the routes to\nagents that ensures a finite time visit to the Non-Priority locations along\nwith Priority Patrolling. The proposed algorithm generates offline patrol\nroutes (Rabbit Walks) with three segments (Hops) to explore non-priority\nlocations. The generated number of offline walks depends exponentially on a\nparameter introduced in the proposed algorithm, thereby facilitating the\nscalable implementation based on the onboard resources available on each\npatrolling robot. A systematic performance evaluation through simulations and\nexperimental results validates the proportionately balanced visits and suggests\nthe proposed algorithm's versatile applicability in the implementation of\ndeterministic and non-deterministic scenarios.\n",
        "published": "2023",
        "authors": [
            "Rugved Katole",
            "Deepak Mallya",
            "Leena Vachhani",
            "Arpita Sinha"
        ]
    },
    {
        "id": "http://arxiv.org/abs/2401.00167v1",
        "title": "Leveraging Partial Symmetry for Multi-Agent Reinforcement Learning",
        "abstract": "  Incorporating symmetry as an inductive bias into multi-agent reinforcement\nlearning (MARL) has led to improvements in generalization, data efficiency, and\nphysical consistency. While prior research has succeeded in using perfect\nsymmetry prior, the realm of partial symmetry in the multi-agent domain remains\nunexplored. To fill in this gap, we introduce the partially symmetric Markov\ngame, a new subclass of the Markov game. We then theoretically show that the\nperformance error introduced by utilizing symmetry in MARL is bounded, implying\nthat the symmetry prior can still be useful in MARL even in partial symmetry\nsituations. Motivated by this insight, we propose the Partial Symmetry\nExploitation (PSE) framework that is able to adaptively incorporate symmetry\nprior in MARL under different symmetry-breaking conditions. Specifically, by\nadaptively adjusting the exploitation of symmetry, our framework is able to\nachieve superior sample efficiency and overall performance of MARL algorithms.\nExtensive experiments are conducted to demonstrate the superior performance of\nthe proposed framework over baselines. Finally, we implement the proposed\nframework in real-world multi-robot testbed to show its superiority.\n",
        "published": "2023",
        "authors": [
            "Xin Yu",
            "Rongye Shi",
            "Pu Feng",
            "Yongkai Tian",
            "Simin Li",
            "Shuhao Liao",
            "Wenjun Wu"
        ]
    }
]